{
  "post_id": 44,
  "comment_count": 10,
  "comments": [
    {
      "id": 573,
      "author": "Pervez Sadiq",
      "email": "pervezs@cyber.net.pk",
      "date": "2007-03-23 19:19:52",
      "content": "<p>The write up is fantastic and it captures the spirit of the trip. I believe that another trip was made on 11th March.  When will we recieve that write up.</p>\n\n\t<p>I would have loved to join you, but the Scuba diving season is ending in March so perhaps next time.  Khalid Omar-thanks a lot for sending me the link—and regards to Humayun Qureshi—hope he comes back to Scuba sometimes.</p>\n\n\t<p>I would be obliged if the <span class=\"caps\">GPS</span> points of the trip are posted also</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 574,
      "author": "Humayun Qureshi",
      "email": "humayun@misl.org",
      "date": "2007-03-24 11:04:17",
      "content": "<p>Pervez, thanks. Next year I promise diving. Maybe we can bring many of the off-roaders with us? Maybe just skin diving to give them the taste!</p>\n\n\t<p>Now you need to get your adventure spirit in the mountains and the valleys, although the season is similar for both diving and offroading.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 575,
      "author": "Sajid Dadabhoy",
      "email": "sajidd@hotmail.com",
      "date": "2007-03-24 21:59:47",
      "content": "<p>Salman. You have articiulated our memories wonderfully.</p>\n\n\t<p>Indeed my expedition started a week before when I decided to test the dual shocks on my Defender.  Getting the Landy  ready for the Dhereji took a minor miricle and it would not have been possible without Taimor Bhai’s and Col. Azmat’s help. So once again thanks a lot guys for your help.</p>\n\n\t<p>Cant wait for the next expedition and this time I will make sure that I dont start a week before in phase 8.</p>\n\n\t<p>Sajid</p>\n\n\t<p>Oh and I must thank my cousin and friend sajjad vaid for braving the phase 8 drive with me…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 576,
      "author": "Dr. Awab Alvi",
      "email": "drawab@cyber.net.pk",
      "date": "2007-03-26 01:58:41",
      "content": "<p><span class=\"caps\">WOW </span>- the entire article was simply captivating.</p>\n\n\t<p>Khalid has been teasing me with these reviews for some time and this article made me into a believer.  Please place my name on your to-call list for the next adventure, and I will cross-my-heart-and-hope-to-die promise that I will definitely join the next off-roaders trip with my Vigo.  The pimp-kick-ass truck definitely needs a run for its money its been lounging on the streets of Karachi for too long and needs to flex its muscle.</p>\n\n\t<p>I’m geared up and ready for the next outing, count me in – Don’t forget me…………</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 577,
      "author": "khalid Mahmood",
      "email": "kmahmood@getzpharma.com",
      "date": "2007-03-26 15:16:00",
      "content": "<p>I am green with envy with what your adventure and expedition. Thanks, Salim Khan for a prolific write up.</p>\n\n\t<p>I have climbed the highest peaks in the continental United States and have been an avid back packer in Mexco and California.  I believe that  Baluchistan offers one of the most beautiful landscapes in the world, both coastal and in land.  I only hope that i can join you all in your next expedition.  I will  apply for membership in your club and hope to qualify for the membership.  best regards, Khalid Mahmood</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 578,
      "author": "Salim Khan",
      "email": "salimkhan1967@gmail.com",
      "date": "2007-03-27 23:22:20",
      "content": "<p>Khaild Mehmood, if i remember correctly, your the guy who went to “Outdoor Adventure” with Behram Avari and the <span class=\"caps\">ICI</span> guy, and I was the one who took you there? I recall you having told me about climbing the highest peak in the US.</p>\n\n\t<p>Hope to see you on the next expedition.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 579,
      "author": "Imran Fatmi",
      "email": "imranfatmi@gmail.com",
      "date": "2007-04-02 10:37:46",
      "content": "<p>Salim, a great narration of the events. 4×4 club has stirred up a new spirit in us to go out and explore our beautiful country. Some of us went to Hingol River and Kund Malir beach on the way recently.http://picasaweb.google.com/addysayeed/HingolDayTrip?authkey=aqt85UT4rDQ.  The trip to Dureji was a wonderful experience for me and my daughter. Do let us know of all the upcoming adventures.</p>\n\n\t<p>Imran Fatmi</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 580,
      "author": "Alamdar",
      "email": "alamdar_h@hotmail.com",
      "date": "2007-05-23 18:31:26",
      "content": "<p>Can I have <span class=\"caps\">GPS </span>Cordinates of your Dureji Trip</p>\n\n\t<p>Alamdar Hussain</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 581,
      "author": "Saadia Rahman",
      "email": "saadia.rahman@gmail.com",
      "date": "2007-09-21 12:41:10",
      "content": "<p>I just have one word <span class=\"caps\">WOW</span>.</p>\n\n\t<p>I didnt know something so organized existed in Pakistan as far as adventures are concerned.</p>\n\n\t<p>The xpeditions are really great! They makeyou get up grab your backpack and hit the highway!</p>\n\n\t<p>Great work!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 582,
      "author": "Mussadiq Janjua",
      "email": "mussadiqj@aol.com",
      "date": "2007-12-11 12:25:37",
      "content": "<p>I rally surprised to see about this healthy activity, I gone very fresh and excited. thanks for entertaining, such a nice article</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}