{
  "post_id": 64,
  "comment_count": 3,
  "comments": [
    {
      "id": 740,
      "author": "Sehar Siddiqui",
      "email": "catsrus528@msn.com",
      "date": "2006-01-17 06:51:34",
      "content": "\t<p>Hiya. omg I was so sad. I was crying. About the earthquake. I wish you luck on finding donations. I will try to donate if I can I don&#8217;t know if theres an age limit on it. But I will</p>\n\n\t<p>g&#8217;bye</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 741,
      "author": "Naeem Tyab",
      "email": "tyabnaeem@gmail.com",
      "date": "2006-02-24 10:56:53",
      "content": "\t<p><span class=\"caps\">STORY FROM KASHMIR</span>:</p>\n\n\t<p>&#8220;I <span class=\"caps\">WANT TO BE A PILOT</span>&#8221;</p>\n\n\t<p>Esha Batool a 6 year old nursery student. As I scribbled her name on my notepad, she promptly corrected: &#8220;it starts with an E&#8230;not I&#8221;. Her astuteness amused and impressed me as she answered my questions sharply. Esha lives in a tent with her parents in a nearby village, along with one sister and brother. Her mother is a house wife and father works in a government department. Esha lost her best friend Komal in the earthquake tragedy, Komal&#8217;s house collapsed; Esha misses her terribly. When asked what she aspires to become after completing her studies, she swiftly and confidently responded: &#8220;I want to be a Pilot to fly helicopter&#8221;.</p>\n\n\t<p>Six year old Mohsin Khan told me: &#8220;I was in the school when the earthquake started; I ran out of the building with the other children and I survived&#8221;. &#8220;Mariam and Maria my class fellows died, they were really nice and good class fellows. My school is totally damaged and there is nothing left. I live with my parents in a tent which is not comfortable and in the night it&#8217;s extremely cold. I had two sisters and 3 brothers, one of my sisters and a brother died along with two of my uncles, grandmother and a builder who was working in our house at the time when the earthquake happened. I really miss my brother and sister&#8221;. Mohsin wants to become a doctor when he is older.</p>\n\n\t<p>Esha and Mohsin attended the same school, but since the school building has been reduced to rubble, the children have no place left to go for study. In addition to suffering from the loss of their homes and loved one&#8217;s, thousands of children like Esha and Mohsin are also left without any suitable facilities to continue their education. In light of this situation, Islamic Relief provided tents for makeshift schools to be set up in Muzaffarabad. Parents and children may have found some temporary relief in these makeshift schools, but as Esha and Mohsin describe, &#8216;this tent school is nice but its cold when it rains and not feasible to study as its muddy everywhere. We do not even have any play ground here&#8217;.</p>\n\n\t<p><span class=\"caps\">I WISH WE CAN HELP THESE CHILDREN WHO ARE OUR FUTURE</span>. COME <span class=\"caps\">FORWARD AND DONATE</span>.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 743,
      "author": "Andaleeb",
      "email": "andaleeb.rizvi@gmail.com",
      "date": "2006-08-21 04:15:50",
      "content": "\t<p>I have returned a month ago from Kashmir where I was working for three months on a Reconstruction Project in Bagh. The situation is still not so good about shelters and houses, as the government authorities are too slow in providing technical aid and guidelines. As far as I feel it would have been faster if there had been no involvement from Non Government and Government agencies both. All this involvement is leading to delays and it is almost a year now and construction will be completely impossible in two months from now, even currently it is not easy to do any sort of construction activity as the monsoon has hit very hard. For the month of June a lot of times we had to stop work on site because of heavy rain. I hope the authorities will soon realize what is going wrong&#8230;.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}