{
  "post_id": 69,
  "comment_count": 16,
  "comments": [
    {
      "id": 760,
      "author": "Ahson",
      "email": "hayat.a@pg.com",
      "date": "2006-05-30 17:06:55",
      "content": "<p>Been there… dont that… got stuck just like this guy. ( jeep used <span class=\"caps\">LC 40</span> series 1982 ) Some of these mini dunes on phase 8 can be quite brutal. Fortunately I managed to do this on a lonely weekday with no one nearby with a camera. Unfortunately I had to walk the rest of the way to the construction sites to beg & pay one of the big <span class=\"caps\">CATS</span> to drag me out of that mess. Moral of the story: scout your approach 1st, reduce tire pressure, get diff locks.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 761,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-05-31 01:29:41",
      "content": "<p>Diff locks wouldn’t help much once the vehicle is high centered.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 762,
      "author": "Kashif",
      "email": "kashifzia72@yahoo.com",
      "date": "2006-06-10 15:09:35",
      "content": "<p>A very old Jeep repairing workshop is located in North Nazimabad, a very old man(70 years) repair and made modification in Jeeps,  people from Azad Kashmir & Baluchistanare coming here for purchase/ modification in their Jeeps.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 763,
      "author": "Faad ali",
      "email": "Fahad.ali@citigroup.com",
      "date": "2006-06-11 02:19:39",
      "content": "<p>But when Willys M-38 got stuck.Even the tractors cant pull it out.I have been into a situation at Rawal dam & it took three days to pull my jeep out of it.Three tractors got stuck trying to pull the jeep out.</p>\n\n\t<p>My wenc got broken but finaly chain kupy works.I send the Pics taken from my mobile to Khalid & Imad.I will appriciate if the same will be added here as well.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Fahad Ali</p>\n\n\t<p>Islamabad</p>\n\n\t<p>Pakistan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 764,
      "author": "Perwez Abbas",
      "email": "perrypup@yahoo.com",
      "date": "2006-06-19 19:07:42",
      "content": "<p>@Faad Ali…………….What is the address of that Jeep Mechanic in North Nazimabad????Could you kindly give me his address and telephone number, if any.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 765,
      "author": "amar",
      "email": "deepdive@gmail.com",
      "date": "2006-06-29 21:48:05",
      "content": "<p>Happened to me too at the same spot about 5 years ago, with</p>\n\n\t<p>my range rover. I was a newbie in those days and had no idea</p>\n\n\t<p>of sand driving. So when the diffs hit the sand, there was nothing</p>\n\n\t<p>that could move the vehicle.</p>\n\n\t<p>Had to walk all the way back, get shovels, and essentially dig</p>\n\n\t<p>the vehicle out. By taking out sand from underneath the diffs</p>\n\n\t<p>and making gentle slopes for the tyre to easily haul themselves</p>\n\n\t<p>up. Took about an hour.</p>\n\n\t<p>Moral of the story: you cant learn sand driving the easy way <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':-)' class='wp-smiley' /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 766,
      "author": "sajid",
      "email": "sajidd@Hotmail.com",
      "date": "2006-07-05 00:36:53",
      "content": "<p>Hmm, I will be out there Sunday…and after seeing the pics and reading comments now am praying that I dont get stuck! but then its all part of the thrill of off roading..right guys ?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 767,
      "author": "Ashraf",
      "email": "katss299@gmail.com",
      "date": "2006-07-05 12:39:13",
      "content": "<p>well guys !</p>\n\n\t<p>this is the second time i m seeing that <span class=\"caps\">BIG GUY</span> stucked. it happend when  i was with freinds gathered in a desert outside the city Riyadh. we had very much fun racing in normal sand of that desert. the Hummer (2003)  driver while trying to perform some maneurvers got stuck in the sand. then my freind having Land Cruiser <span class=\"caps\">II 4800</span> cc V8 came for help we just hooked it from the front with the electronice winch of the landcruiser, and at the first attempt it was released from that sand.</p>\n\n\t<p>but my peception about the Hummer <span class=\"caps\">NOW</span> is that it is a totalll flopped 4×4.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 768,
      "author": "Nick Ahmad",
      "email": "nicholas_ahmad@hotmail.com",
      "date": "2006-07-13 23:12:42",
      "content": "<p>unbelievable! Unaarees on board. So glad u got this pic!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 769,
      "author": "imran",
      "email": "imrankkl@hotmail.com",
      "date": "2006-07-14 00:24:17",
      "content": "<p>well first of all who was the jack ass driving this janaza……..</p>\n\n\t<p>this vehicle is for road cruising only do urself a favor and dont take this for offroad……</p>\n\n\t<p>there is only one jeep…………………….</p>\n\n\t<p>rest r creep</p>\n\n\t<p>Chaooo</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 770,
      "author": "umair",
      "email": "UMAIR_KHAN69@HOTMAIL.COM",
      "date": "2006-07-14 16:06:51",
      "content": "<p>haha umer saleem tryin to be a offroader ov pakistan ..haha i will luv to met dats man cause he is host ov high octane  i wll say to him plz its anit kids job jus drive cars jus street raceoffroadin its aint fo kids</p>\n\n\t<p>” as i enjage ma 4X4 and tear the rocks apart u kids be stunn like u hav never seen dats art ”</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 771,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-08-16 16:40:43",
      "content": "<p>There is an old saying: “chullo bhar paanii men doob mar” which roughly translates as: “drown in a handfull of water”.</p>\n\n\t<p>Seems appropriate here!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 772,
      "author": "Ahmed",
      "email": "ahmed_xp@yahoo.com",
      "date": "2006-08-22 10:50:22",
      "content": "<p><span class=\"caps\">CJ7</span> rescues Hummer <span class=\"caps\">H2 </span>… <span class=\"caps\">ROTFL</span></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 773,
      "author": "Nasir Manzoor",
      "email": "nasir_manzoor@hotmail.com",
      "date": "2006-08-27 01:48:03",
      "content": "<p>Excellent picture and great description of the fact.  Off road driving specially Sand requires lot of battle wounds and experience. It can be a v8 Hummer or a 4 cylinder Suzuki.  In my case all the experience came from only when I got stuck.  In sand you always want to keep momentum.  The moment you realize you are getting stuck you stop right there and take your foot off the gas and don’t dig your self any deeper because you don’t want the belly to touch the ground. Hitting the gas peddle is not gonna get you out any faster but will only dig you deeper.  Get out and see which wheels are getting stuck and than take sand out with your hands or shovel if you have one.  Now lower the air pressure to 15 <span class=\"caps\">PSI</span> and you will come right out but do it all slowly.  If you have only 2 wheels drive than lower the air pressure from only those tires that got stuck.  Lowering air pressure to 15 <span class=\"caps\">PSI</span> even works great in 2 wheels drive SUVs but no recommended.  Driving a 4×4 efficiently in Sand is a talent not a privilege.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 774,
      "author": "mangolian",
      "email": "m_rahman23@hotmail.com",
      "date": "2006-10-28 13:51:37",
      "content": "<p>i dont have any comment, b/c i dont have any experience of ofroading, but i must say that the comments are very intresting especially KO’s.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 775,
      "author": "FARAZ SHAH",
      "email": "faraz98@hotmail.com",
      "date": "2006-11-17 00:07:06",
      "content": "<p>I have worked at the Hummer <span class=\"caps\">H2 </span>Assy Plant and Hummer is a pretty good offroader if you know what you are doing. But don’t get it high centered, it will get you stuck. The truth is, nothing beats a Jeep. I am not saying that because I work at Jeep now, I have taken Jeeps offroad and the are excellent rock crawlers.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}