{
  "post_id": 45,
  "comment_count": 3,
  "comments": [
    {
      "id": 584,
      "author": "amar",
      "email": "deepdive@gmail.com",
      "date": "2007-05-25 17:11:24",
      "content": "\t<p>Salim Khan, you write well.</p>\n\n\t<p>I hope that one day I will be able to join you guys  in one of</p>\n\n\t<p>such adventures.</p>\n\n\t<p>amar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 585,
      "author": "Teeth Maestro",
      "email": "drawab@cyber.net.pk",
      "date": "2007-06-09 14:17:53",
      "content": "\t<p>Wow Salim Uncle &#8211; this was yet another captivating article which I have read on OffRoadPakistan.  The one on Dureji 2007 can be credited to be the article which had me latched and hooked onto the 4&#215;4 craze.</p>\n\n\t<p>This article tops it far better since I can relate to each incident and each turn we took on the Hingol trip.  Truly an amazing article and it does indeed capture the three day adventure in these few paragraphs.</p>\n\n\t<p>I personally loved the trip but what really topped the expedition were the people, it was by far, the best group of people I have ever been with.  They were strangers to me when I started off with them on that fateful Saturday morning but by the end of the three days I was part of the family &#8211; it was a without doubt a fun loving crazy bunch of adventure seekers who truly enjoyed this sport but despite all the gung-ho attitude they valued each persons safety with great care.  Which I feel sets them apart from any thrill seekers in Pakistan.</p>\n\n\t<p>Thank you <span class=\"caps\">OFFROADPAKISTAN</span></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 586,
      "author": "Ashok",
      "email": "askhemani@inbox.com",
      "date": "2008-09-01 19:45:42",
      "content": "\t<p>Sir why not if ur intrested to make Hinglaj Yatra History book im know one man who is always go this yatra or help u 2make this book complete but im thinking sir u make complete pakistani temp book thousand of temp in pakistan and im also intrested to make book or research Hinduism Temp pakistan which is famouse</p>\n\n\t<p>ur brother</p>\n\n\t<p>Ashok Khemani</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}