{
  "post_id": 87,
  "comment_count": 3,
  "comments": [
    {
      "id": 936,
      "author": "Jeepaholic",
      "email": "dosaipk@yahoo.com",
      "date": "2007-11-23 00:47:12",
      "content": "<p>Thats not fair friend we waited all that long for the first test drive of the Beast F1 and no pics and no performance details????</p>\n\n\t<p>well I Declare The Beast as “The Most Rare Restored offroader in Pakistan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 938,
      "author": "Raza",
      "email": "colraza@gmail.com",
      "date": "2007-11-27 23:06:21",
      "content": "<p>Dr. Toor,</p>\n\n\t<p>The crux of the narration leaves no doubt that age is no barrier for adventure. Stay young. Keep enjoying. We shall be wating for a set of water colour paintings of the trip.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 939,
      "author": "Abu Jamal",
      "email": "aye44@hotmail.com",
      "date": "2007-11-29 14:29:13",
      "content": "<p>What a delight it is to read your post Sir. I can so relate to so many of the surprises and mishaps (and some rash descisions) that happened to you during your trip. I would still like to make a few points for your future reference:</p>\n\n\t<p>1. Never go to sleep immediately after ascending to a high altitude. Although your body will dictate you otherwise, but stay awake for at least 3 – 4 hours so that your body can acclamatize to the height. The body is not used to the low oxygen in the the air at such altitude and <span class=\"caps\">ITS</span> intake gets even lower while sleeping, which could even result in death.</p>\n\n\t<p>2. Never trek at night unless you are trained for it.</p>\n\n\t<p>3. 80% of trekking/mountaineering accidents happen while descending, so never tire yourself to a point where you can’t control where you’re going.</p>\n\n\t<p>It was wonderful reading your story. You have surely made my day.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}