{
  "post_id": 28,
  "comment_count": 90,
  "comments": [
    {
      "id": 325,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2005-03-16 14:40:44",
      "content": "\t<p>Do you still have this car? You guys need a real appreciation.</p>\n\n\t<p>Best wishes.</p>\n\n\t<p>Umar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 326,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-03-16 14:55:18",
      "content": "\t<p>This car is still there, though in pieces. A rebuild has been long planned.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 327,
      "author": "raulz",
      "email": "rahulbutola@indiatimes.com",
      "date": "2005-03-24 13:05:11",
      "content": "\t<p>gr8 history</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 328,
      "author": "Khizar",
      "email": "khizar88@hotmail.com",
      "date": "2005-04-03 19:45:14",
      "content": "\t<p>Hi</p>\n\n\t<p>Nice there is this car parked at your home or in the factory because I want to have a look at it</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 329,
      "author": "KO",
      "email": "khalido@gmail.com",
      "date": "2005-04-03 23:04:47",
      "content": "\t<p>The car is currently in pieces. It has be be put together first.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 330,
      "author": "rizwan",
      "email": "pakgizmo@yahoo.com",
      "date": "2005-04-25 17:52:12",
      "content": "\t<p>why did not the goverment hire these ppl to build cars. if the gov wud have helped at that time we cud have also have our own <span class=\"caps\">BMW</span>&#8217;s or <span class=\"caps\">MERC</span> type cars in pakistan  by this time &#8230;&#8230;.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 331,
      "author": "Rizwan kazmi",
      "email": "rizwankazmi72@yahoo.com",
      "date": "2005-04-26 05:45:18",
      "content": "\t<p>U guys are really talented and deserve a lot of appreciation but unfortunately, I havnt seen any one of you in news of that time. No body high lighted how gr8 work u did even in those days. I wonder why Pakistan govt doesnt have any poilicy to appreciate and benifit the people like you. Aap sab designers ko mayra salam hai.</p>\n\n\t<p>Rizwan kazmi</p>\n\n\t<p>Denmark</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 332,
      "author": "Malik Asif Joyia",
      "email": "asif@palmchip.com",
      "date": "2005-04-28 15:36:38",
      "content": "\t<p><span class=\"caps\">AOA</span>. I am proud of you like people of pakistan, who like to make their own world with their efforts&#8230; Best of Luck.</p>\n\n\t<p><span class=\"caps\">ASIF</span></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 333,
      "author": "kashif",
      "email": "crown-enterprise@hotmail.com",
      "date": "2005-05-08 00:39:29",
      "content": "\t<p>salaam 2 u all.</p>\n\n\t<p>my salute goes to all of u ,who built this great car.</p>\n\n\t<p>i kinda like the car and i even  suprised that it was built in late 60&#8217;s.</p>\n\n\t<p>this is a perfect example of a free mind. you guys r great pakistani.</p>\n\n\t<p>it shows the world what we can do on our own.</p>\n\n\t<p>great job!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 334,
      "author": "Haris",
      "email": "mhariskhan_1986@hotmai.com",
      "date": "2005-06-02 23:39:33",
      "content": "\t<p>spectacular work dudes.i would really want to see you guys go further. do not loose heart as you people were not appreciated.I assure you that if you guys give another try you will not be unnoticed this time as we have free media.Please tell me that are you guys engineers&#8230;&#8230;&#8230;</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 335,
      "author": "Faris Durrani",
      "email": "faris.durrani@gmail.com",
      "date": "2005-06-06 00:29:19",
      "content": "\t<p>When I saw this picture I remembered another one that my father had from his college days. Turns out it was the same car and that he knew Mr Hamid Omer. The picture that i have has a group of my fathers friend in the same car. Been a fan for a long time. Great work!!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 336,
      "author": "Shoaib",
      "email": "je_shoaib@hotmail.com",
      "date": "2005-06-06 11:12:02",
      "content": "\t<p>Gr8&#8230; it makes me feel so proud.. if you people still own it please do let me know i would really like to see it <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /> .</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 337,
      "author": "Hassaan",
      "email": "hascorpio@hotmail.com",
      "date": "2005-06-12 23:42:59",
      "content": "\t<p>I really appreciate u &#8230;.really a gr8 history &#8230;..i solute u &#8230;bye</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 338,
      "author": "Agha Abbas",
      "email": "aghaabbas@yahoo.com",
      "date": "2005-06-14 02:31:53",
      "content": "\t<p><span class=\"caps\">ASA</span>,</p>\n\n\t<p>Absolutely amazed!  I am a TV director currently producing a program on automobiles. I&#8217;m sure here&#8217;s a story worth sharing, I hope you wont have any reservations in this regard. Please let me know when and where we can meet. Keep the good work going. All the best.</p>\n\n\t<p>Abbas</p>\n\n\t<p>Karachi</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 339,
      "author": "Atif Sheikh",
      "email": "armaxim@hotmail.com",
      "date": "2005-06-15 23:54:55",
      "content": "\t<p>AoA!</p>\n\n\t<p>Well, it certianly is a tremendous thing to have a look at this picture &#8220;The first ever car made in pakistan&#8221;.. However, having said that I do have some thoughts! We have been extremely unfortunate that we could not enjoy stable political conditions, but people like Mr Hamid Omar should have taken steps at that time to explore this industry. I mean, if you do something good and yet no one sees it, then whats the use of doing something like this.. Please dont get this wrong, I have alot of respect for people like you but please bear in mind that until you do not bring home industries (self contained projects) in the mainstream, I am afraid we cannot do much but just to commend such projects and thats about it!</p>\n\n\t<p>Regards</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 340,
      "author": "Tajemel Toheed",
      "email": "ttoheed@gmail.com",
      "date": "2005-06-23 19:44:55",
      "content": "\t<p>It was a gr8 effort. But unfortunately ur efforts were not taken seriuos by the govt. of pakistan. Otherwise we bacame now the 16th country of the world. where as in ur case may be we were in 10&#8217;s. My solute to all of you.</p>\n\n\t<p>bye</p>\n\n\t<p>Toheed</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 341,
      "author": "Sardar Nabeel Wali",
      "email": "nabeelwali@hotmail.com",
      "date": "2005-08-29 00:05:46",
      "content": "\t<p>I think this was a red coloured car always piled up with people especialy students of Aitchison College. Am I right?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 342,
      "author": "Cher",
      "email": "sher_isit@yahoo.co.uk",
      "date": "2005-09-16 13:14:10",
      "content": "\t<p>Well, That was great to have built a car in a country like pakistan especially with left over metal. I think Pakistanis should treat this kind of people as natinal heros. <span class=\"caps\">BUT</span>, I think it is quite the oppsite, People usualy lable these Inventors unislamic. I mean look at pakistanis, they are left behind by Indians and even Sri Lankans. A country where majority of the people put religion before the country, how can that country be self relient. To be very Frank, all of your scientist in the past centuries, Avisena, Ibn-e Khaldoon, Ibn- Rashad, to name a very few, were all muslims by name. they never practiced religion in there whole lives instead they spent their lives researching and teaching mankind to improve human life. and of course, Philosphers like, Dr Iqbal, Umer Khayyam, Bullah shah, Al- mansoor (who&#8221;supposedly&#8221; claimed to be God). were acually the real peole who dared to search for knoledge but were declared to be non muslims and Al-mansoor was even killed and mutilated on the orders of the state and thrown out on the street. If it wasn&#8217;t for President Musharaf, pakistan would have been turned into a Jungle full of 150 million animals. Be thankfull to your President who is acually trying his best to improve human life in Pakistan just like your Prophet did 1500 years ago. Learn to appreciate good people like the ones who built this Car and leave religion for spare time. God is for people not the other way around. religion is to make human life better but it seems the Opposite in Pakistan. Good on you Thinking people, who built the car just keep on trying.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 343,
      "author": "Vijay",
      "email": "vkd77@hotmail.com",
      "date": "2005-10-13 09:42:29",
      "content": "\t<p>thatz a really nice piece of history&#8230;. <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':-)' class='wp-smiley' /></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 344,
      "author": "Sony",
      "email": "sonyseth1@yahoo.com",
      "date": "2005-10-15 13:14:43",
      "content": "\t<p>Man! How can such gr8 news remain unearthed for so long! Omars plz restore the car. This is national heritage. Kudos!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 345,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2005-10-15 16:07:41",
      "content": "\t<p>Just want to add that from 1967 to 2005, 38 years, guys now we need just to design our own Pakistani car brand. We can get things at the best rates from around the world from all sorts of vendor industries as is done by all the car manufacturers. The car manufacturers are basically designing, assembling, marketing and developing the network of after sales service. All this requires enormous resources and highly efficient corporate approach to survive in ruthlessly competitive environment. Money can buy us expertise from around the world. We can select the basic popular sizes of the vehicles, which are economically viable to sell. If the local car assemblers have to be given unnecessary protection then it should not be to the foreign brands that have been fleecing money but to the totally indigenous local car manufacturers.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 346,
      "author": "Farrukh Shahzad",
      "email": "fshahzad@gmail.com",
      "date": "2005-10-16 01:06:45",
      "content": "\t<p>My Words are too limited to praise these guys!!</p>\n\n\t<p>We have destroyed our country by not taking our young ones seriosly&#8230;</p>\n\n\t<p>May Allah Give us the help and power to face the world and do the better for our own Country&#8230;Pakistan, Pakistan, Pakistan</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 347,
      "author": "zak",
      "email": "KAZ888knox@hotmail.com",
      "date": "2005-10-27 04:02:38",
      "content": "\t<p>i like it</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 348,
      "author": "Anis.Khan",
      "email": "anis.ali.khan@gmail.com",
      "date": "2005-11-15 20:22:01",
      "content": "\t<p>I am seriously impressed by this historic car! If you think about it, Pakistan built a lightweight, small displacement sports roadster <span class=\"caps\">IN THE 1960</span>&#8217;s&#8230; This is something companies like <span class=\"caps\">LOTUS</span> and MG are doing with success only in the past 20 years&#8230; The early British models of the 60&#8217;s era were certainly not known for their reliability, so on that basis, it truly is amazing that it was used as a daily driver for <span class=\"caps\">TEN</span> years! It must have had quite responsive handling thanks to it&#8217;s small size and engine weight&#8230; Amazing&#8230; Pakistan&#8217;s very own Lotus of the 1960&#8217;s!</p>\n\n\t<p>A truly wonderful example of Pakistani ingenuity and creativity&#8230; Restoration is a must! This is an inspiration for today&#8217;s young!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 349,
      "author": "Harpreet Shergill",
      "email": "autoassign@yahoo.com",
      "date": "2005-12-15 17:06:08",
      "content": "\t<p>It is indeed a great job done in that era. I would appreciate the effort especially the body design and the way the Engine is wedded to the British motorcycle type gear box. The packing is quite wonderful. The body proportions sounds great.</p>\n\n\t<p>All I expect on the wrong side would be a tricky gear shifting ( If kept ) and vibrations emitted by the pumpset engine. Western countries do buck up their lads to come up with such improvisations but here in this sub-continent things are different. However, in India the scene is quite better with many people coming up with such improvisations and many times these  come closer to be called an innovation. Now, such people even have formed groups to combine their resources and come up with final results comparable to that of western world.  Some of these even saw  actual production and succuss. <span class=\"caps\">RTV</span> being produced by Hindustan Motors is one such example.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 350,
      "author": "singh",
      "email": "mohit_harm@hotmail.com",
      "date": "2006-01-04 22:48:17",
      "content": "\t<p>wow, now a days that car would be junk, but when you guys made it, it probably was like looking at a ferreri.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 351,
      "author": "Hamid Omar",
      "email": "khalid.omar@gmail.com",
      "date": "2006-01-05 03:22:51",
      "content": "\t<p>In those times, as long as you had a car/transport/beautiful machine<img src=\"!\" alt=\"\" border=\"0\" /><img src=\"/whatever\" alt=\"\" border=\"0\" />!! but for that time it was really something!</p>\n\n\t<p>The car is in pieces now, as it is in the initial stages of being restored by <span class=\"caps\">AO </span>&#038;  KO. The color is going to Ferrari red, as it used to be when originally made.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 352,
      "author": "Asad",
      "email": "ggg@yahoo.com",
      "date": "2006-01-19 21:20:01",
      "content": "\t<p>Great</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 353,
      "author": "Desiree",
      "email": "dd150805@yahoo.com",
      "date": "2006-01-21 03:11:33",
      "content": "\t<p>Like you guys really need another car.  It&#8217;s very impressive that you own the first car ever built in Pakistan but you don&#8217;t even have room to park the cars you own that do run.  And where do you expect to put the huge Ford truck you&#8217;re re-building?    You should donate the car to a museum.  Oh, that&#8217;s right-you don&#8217;t have any in Karachi.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 354,
      "author": "Khurram",
      "email": "mr__khurram@hotmail.com",
      "date": "2006-04-11 02:33:08",
      "content": "\t<p>haha thats how we used to treat our heros&#8230;.NO <span class=\"caps\">NAME NO APPRECIATION</span> nothing&#8230;&#8230;&#8230;&#8230;</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 355,
      "author": "Umar Farooq",
      "email": "farooq@brain.net.pk",
      "date": "2006-04-11 12:53:08",
      "content": "\t<p>Great job. Is car still intact? There is a need for a &#8220;Car Museum&#8221; in our country through public-private partnership. It would be great if a car like this along with numerous other vintage cars with history are placed in such type of a museum in Pakistan. So folks we need to have a &#8220;Car Museum&#8221; in Pakistan.</p>\n\n\t<p>Thanks and bye.</p>\n\n\t<p>Umar Farooq</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 356,
      "author": "Josh",
      "email": "yearight@hotmail.com",
      "date": "2006-06-08 09:08:20",
      "content": "\t<p>so is this the first car ever built, or just the first car ever built in Pakistan/</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 357,
      "author": "Ehsan Khan",
      "email": "ehsan_tareen@hotmail.com",
      "date": "2006-06-14 13:11:47",
      "content": "\t<p>were any of the components manufactured in pakistan? a great effort nonetheless.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 358,
      "author": "matt",
      "email": "matthewomears@hotmail.com",
      "date": "2006-06-27 12:39:12",
      "content": "\t<p>i think that it was very good have u still got it?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 359,
      "author": "asad malik",
      "email": "asadmalik80@hotmail.com",
      "date": "2006-06-27 13:41:12",
      "content": "\t<p>its a very good feeling to know that the car was built in 1967.but a bit sad that we dont have many pakistani built and design cars.inshaallah we will have more in near future.i like the vintage cars.there are many vintage cars in australia.but i cant explain the feeling to know that the vintage and clasic cars some of the people have in karachi are in that good condition and they have restored them.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 360,
      "author": "Zia",
      "email": "akhtarzia@gmail.com",
      "date": "2006-06-27 19:38:57",
      "content": "\t<p>Great  man. Mashallah</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 361,
      "author": "muazzam malik",
      "email": "muazzampk10@yahoo.com",
      "date": "2006-07-12 14:46:24",
      "content": "\t<p>I am impressed, its a gr8 job done by a Pakistani but it was un noticed by the high ups, i am sure if govt would have patronized you at that time we have our own <span class=\"caps\">PMW </span>(Pakistam Motor Works)</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 362,
      "author": "babur",
      "email": "aaioje@ddio.co",
      "date": "2006-08-04 18:20:23",
      "content": "\t<p>Very impressive, now we are waiting for a modern local built car as good as any other foreign car. i am sure we will do it very soon.</p>\n\n\t<p>babur</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 363,
      "author": "Sameer",
      "email": "sameerfair@yahoo.com",
      "date": "2006-08-07 15:14:37",
      "content": "\t<p>Astonishing work&#8230;</p>\n\n\t<p>certainly magnificent.</p>\n\n\t<p>I would like to request for some information regarding registering a car with the same problem.</p>\n\n\t<p>What is the legal procedure for registering a prototype suc as this.</p>\n\n\t<p>Specially with an engine out of a superbike.</p>\n\n\t<p>similar to a gocart in design but with good ground clearance and serious power.</p>\n\n\t<p>a sports car precisely.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 364,
      "author": "Amir Chishti",
      "email": "achishti786@hotmail.com",
      "date": "2006-09-13 00:42:26",
      "content": "\t<p>Hi,</p>\n\n\t<p>First of all it was quite shocking that Pakistan Made its first car in 1967, which I really dont know becasue I was not aware of that and even we have not got any Information about this but I would like also to impart a bit information as one another car ( Pickup was 100 %) was made in Pakistan by the name of Proficent and might be some of you people have seen that pickup still on the road.</p>\n\n\t<p>but the point is this that we or our Government is Stupid because some rulers want Pakistan as a slave of <span class=\"caps\">USA</span> and I think right now we are and thats the maing reason we were,are or might be in future as well will not be able to Market our Products.</p>\n\n\t<p>So sad of that and <span class=\"caps\">MAY MY ALLAH </span>Keep us in <span class=\"caps\">HIS </span>Peace. <span class=\"caps\">AMEEN</span></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 365,
      "author": "Sunil",
      "email": "sunil@sunil.com",
      "date": "2006-09-29 17:43:24",
      "content": "\t<p>Hmm, interesting. Nice work, and it definitely needs some appreciation. But the story of the car made me shockingly realize that you guys are still in the stone ages. Recently I heard another news that Pakistan is rolling out their first production car. I saw some pictures from the production line. Can&#8217;t help commenting that those kind of production lines existed in the 1950s elsewhere in the world. <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\t<p>Greetings from India!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 366,
      "author": "Mubashir Farooq",
      "email": "mubashiroffline@yahoo.com",
      "date": "2007-01-25 19:39:46",
      "content": "\t<p>welldone! i appreciate ur talent n efforts, the best Pakistani car of not only 60&#8217;s but also of today! atleast better than todays <span class=\"caps\">REVO</span><img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" />!!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 367,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2007-01-26 17:05:37",
      "content": "\t<p>It is really pleasing to see the very historic and nostalgic pics of the &#8220;Car in the Making&#8221;. Well Done.</p>\n\n\t<p>Umar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 368,
      "author": "Kashif Tahir",
      "email": "kashif9099@yahoo.com",
      "date": "2007-02-06 01:00:32",
      "content": "\t<p>Man! where have you folks been hiding? Its a great discovery. I ashmed that that such wonderful talent was lost to bureaucracy.</p>\n\n\t<p>And please do inform when the car is restored. Anything I can help with, I&#8217;ll be more than happy to forward a helping hand.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Kashif Tahir.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 369,
      "author": "hamza",
      "email": "hamzasohail_1@hotmail.com",
      "date": "2007-04-05 20:39:23",
      "content": "\t<p>this is simply a great work. i would give my saalaam to all the ppl who made this car. u guys can even open a new car comp and sell cars at a low rate to poor pakistanis and help everyone have a car. Grt job<img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" />!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 370,
      "author": "priscilla kilgore",
      "email": "pris69lemansdude@yahoo.com",
      "date": "2007-04-15 00:31:31",
      "content": "\t<p>This is a really cute car.As you can tell from my email addressI drive a 1969 Pontiac Lemans. I have always loved cars.  The red car was a stroke of guiness.  How cool!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 371,
      "author": "Asad Ali",
      "email": "s.asadali@yahoo.com",
      "date": "2007-04-21 12:06:55",
      "content": "\t<p>im really impressed by the fact that there are many people around us who intend to do something different. We are the poeple who love their heritage and should have such vehices (environment friendly ofcourse) with a history on the roads. I live in malir cantt and know a guy who has just fiished his work of developing a volks wagon that looks just as authentic as it was in 1966 in the showroom. This guy did all the paint, denting, engine and what not by his own hands. Earlier he got an appreciation letter from Ford motors&#8217; president after he sent them a sketch of a new model he proposed them to build.</p>\n\n\t<p>We should have a society sponsored by businesses to support them for giving a chance to show their crafts. An enterprising effort is required.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 372,
      "author": "Waqar Khan",
      "email": "loaferkan@hotmail.com",
      "date": "2007-05-08 13:54:48",
      "content": "\t<p>Hey guys a very great story and it just make me cry to hear such great stories. Shame on Pakistani Govt, the only reason that the Pakistani government didn�t allow you to register that car as to what I think was because they couldn�t get any bribe from you since it was a home made car. �Until there is this bribe system in Pakistan, it will never ever succeed� By me. What a Shame, however in Pakistan we have this system of pointing our fingers to other but we forget to look at the three fingers binding toward us. Who is government? It we Pakistani, I, you and yes even you reading this. We have to change all of this once and for all to succeed. I have lived in the <span class=\"caps\">USA</span> for 15 years and came here back when I was 10 years old. In these 15years I have never given bribe or ever heard that someone have actually accepted a bribe. To tell you my story I went to Pakistan last summer and at the Airport they checked my suitcase; however I told them that put my stuff back the way you found it since the guy was so rude checking it. He neglected and even canceled my ticket. Being an American Citizen I was shocked, I knew why was he checking my stuff and what he wanted from me. But I didn�t attempt to give him a bribe because if I had given him any bribe I would be equally responsible. So those who point fingers at those who take bribe should look at those three fingers binding toward them. Hey guys to change the system we have to change our self.  So what if I missed my flight but I didn�t bowed down to an illegal act, so those of you who is reading this please promise today that you will never take a bribe or give a bribe in your life and see what the good karma bring back to you. Thanks Waqar Khan US, New York</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 373,
      "author": "1",
      "email": "1@AOL.com",
      "date": "2007-05-22 00:05:33",
      "content": "\t<p>this isnt first car ever made</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 374,
      "author": "Urfi",
      "email": "mr.urfi@gmail.com",
      "date": "2007-06-01 18:28:32",
      "content": "\t<p>plz Sir give me your contect number</p>\n\n\t<p>+92-345-6926909</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 375,
      "author": "mujahid",
      "email": "mujahid28c@yahoo.com",
      "date": "2007-07-04 18:53:54",
      "content": "\t<p>Although it is very late to say congrats to you all but this another failiure on the part of govt by not getting the services of such talented people.i wonder why publicity not given to this car beside the fact that it was driven by one of the top guy of related govt department.may i request you like many others to please considr case for its rebuild in near future.best wishes for the project <span class=\"caps\">RED CAR</span></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 376,
      "author": "Zeeshan Mustafa",
      "email": "shani38@gmail.com",
      "date": "2007-07-11 13:50:45",
      "content": "\t<p>I am seriously impressed by this&#8230;This is a really cute car.</p>\n\n\t<p>really impressed from this job but dear its <span class=\"caps\">PAKISTAN</span></p>\n\n\t<p>thats y the people dont know about this if this was don another country</p>\n\n\t<p>the whole world know about this</p>\n\n\t<p>my best wishes for all Pakisanti persons who want to do something better&#8230;&#8230;..</p>\n\n\t<p>With Best Regad</p>\n\n\t<p>Zeeshan Mustaf</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 377,
      "author": "kazim",
      "email": "kazim_322@hotmil.com",
      "date": "2007-07-22 15:01:52",
      "content": "\t<p>My hobbey Car I love  car</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 378,
      "author": "Saad",
      "email": "don_no_fear@hotmail.com",
      "date": "2007-07-24 18:32:59",
      "content": "\t<p>this iz great</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 379,
      "author": "yasir",
      "email": "yyasir3@yahoo.com",
      "date": "2007-08-01 01:19:35",
      "content": "\t<p>very good information for me itz realy amazed me. it mean in 1967 ppl r very intelegent and youngsters have so much potential at that time kashhhhhhhhhhhhhhh govt pakistan take it seriously at that time.. Now we have our own well known pakistani car idustry.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 380,
      "author": "Syed Rizwan Ahmed",
      "email": "raazzi@hotmail.com",
      "date": "2007-10-01 08:06:02",
      "content": "\t<p>hi,</p>\n\n\t<p>You Guyz really did a great job at that time &#8230;  I am impressed.</p>\n\n\t<p>Best regards</p>\n\n\t<p>Rizwan (USA)</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 381,
      "author": "mujeeb",
      "email": "mujeeb_mufti@hotmail.com",
      "date": "2007-10-01 17:50:12",
      "content": "\t<p>its an amazing example of engineering expertise.a tru work of art.a glimpse of the hidden talent our country holds.unfortunately no one gives the required publicity and support to these true <span class=\"caps\">PAKISTANI</span> craftsmen and designers who can make a difference&#8230;a lovely car which really deserves to be back on the roads and and car shows.pls restore it!had there been a decent response we wouldnt be sitting here getting ripped off by second grade cars from intrnational manufacturers.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 382,
      "author": "Taymoor",
      "email": "timmi51@hotmail.com",
      "date": "2007-10-02 07:49:16",
      "content": "\t<p>It was a g8 job done by u.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 383,
      "author": "Hassan Talal",
      "email": "has_tal@hotmail.com",
      "date": "2007-10-07 16:37:35",
      "content": "\t<p><span class=\"caps\">AOA</span></p>\n\n\t<p>I dont believ its ur own work u should now restore this car nd show who u r&#8230;!</p>\n\n\t<p>If u did this then u should hav must be in car designing or engineering sorts of works our automotiv industries need ppl like u.</p>\n\n\t<p>can i know what was ur age at that time and also now</p>\n\n\t<p><span class=\"caps\">SALUTE</span></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 384,
      "author": "bilal wains",
      "email": "bilalwains@hotmail.com",
      "date": "2007-10-10 12:34:15",
      "content": "\t<p>it&#8217;s great pleasure to see about talented people of pakistan like u.</p>\n\n\t<p>u r a sort of inspiration for new generation especially for those who love automobile industry.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 385,
      "author": "M.Shahzad khan",
      "email": "shahmsk@gmail.com",
      "date": "2007-11-15 00:44:07",
      "content": "\t<p>very nice work may i know ur place i want to meet u such a nice work u have don in past wat do u do now a days and r u palning some new projects i wish u very best of luck</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 386,
      "author": "Fahim(Ireland)",
      "email": "fahi_pak@yahoo.com",
      "date": "2008-05-31 17:58:53",
      "content": "\t<p>wow, thats great guy, whatever u have done in the 60s was a great idea to make a car in Pakistan where it wasnt that easy, by the way i loved the work you guy done and am sure that there is alot talent in Pakistan as well.</p>\n\n\t<p>I am but not only me but all Pakistan must proved on you.</p>\n\n\t<p>Thanks</p>\n\n\t<p>Fahim</p>\n\n\t<p>Ireland</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 387,
      "author": "Saquib Malik",
      "email": "saquib.malik@yahoo.com",
      "date": "2008-08-24 13:43:41",
      "content": "\t<p>bravo guyz &#8230; i wud like to see the car &#8230; u should try to keep all the pieces up and joined</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 388,
      "author": "Car Dealers",
      "email": "info@carbroker.org",
      "date": "2008-11-05 19:26:10",
      "content": "\t<p>Very nice and informative post about The Red Car &#8211; First Pakistani Car.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 389,
      "author": "neivadan",
      "email": "1994jerosh@hotmail.com",
      "date": "2008-12-12 21:54:59",
      "content": "\t<p>how long did you work to build this car and can u send me some pics this car</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 390,
      "author": "Mohammad",
      "email": "moe.khan@gmail.com",
      "date": "2009-05-09 02:30:33",
      "content": "\t<p>I honestly have to applaud your family&#8217;s efforts in designing/building this car. It&#8217;s extremely basic, but not without charm. I love all things Pakistani, and all things automotive, so it&#8217;s a shame the two rarely cross paths. Perhaps you should consider building replicas of such a car, or at least restoring it and displaying it for fellow enthusiasts.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 391,
      "author": "Mushtaq Ahmed",
      "email": "ahmedmushtaq@hotmail.com",
      "date": "2009-05-22 09:14:04",
      "content": "\t<p>Great Work manship, taking into consideration the spare market at that time. It must hae been a tough project. If this car is still in Pieces then I would like to help in building it a one peice in my workshop. If you are interested call me . 0300 8400036.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 392,
      "author": "MUZAHIR",
      "email": "muzahir6262@gmail.com",
      "date": "2009-09-28 17:53:47",
      "content": "\t<p>Dear , I like that type of working</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 393,
      "author": "Cheap Repo Cars",
      "email": "cat_jarritt@hotmail.co.uk",
      "date": "2009-11-04 05:00:05",
      "content": "\t<p>Some very nice historic information here. Good archive work!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 394,
      "author": "Mohsin",
      "email": "malang.adam@yahoo.com",
      "date": "2010-01-27 15:03:41",
      "content": "\t<p>It is really a great work done by a Pakistani. I desire that now all the cars in Pakistan should be made completely in Pakistan and this type of engineers should be hired in that industry.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 395,
      "author": "Malang",
      "email": "nikkidoddy@gmail.com",
      "date": "2010-02-16 22:25:53",
      "content": "\t<p>Well said mohsin. It will be a progress of our country to manufacture everything here in Pakistan.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 396,
      "author": "Shakaib Uzzaman Khan",
      "email": "sk_v12@hotmail.com",
      "date": "2010-02-19 01:31:46",
      "content": "\t<p>Hamid Omar sahab..</p>\n\n\t<p>Salute! Pakistani Automotive Enthusiasts are proud of you. I would also like to mention that I have read about your Ford F1 truck project and saw that beautiful machine at the motor show. You rock! God bless you and your family.</p>\n\n\t<p>Here&#8217;s a link to a few pictures of your Ford <span class=\"caps\">F1 I</span> snapped at <span class=\"caps\">VCCCP</span> show-2010.</p>\n\n\t<p><a href=\"http://www.flickr.com/photos/sk_v12/sets/72157623317282099/\" rel=\"nofollow\">http://www.flickr.com/photos/sk_v12/sets/72157623317282099/</a></p>\n\n\t<p>Best of luck for future endeavors <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\t<p>Shakaib Khan</p>\n\n\t<p><span class=\"caps\">SK </span>Motor Syndicate</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 397,
      "author": "Asher Fawad",
      "email": "asherfawad@yahoo.com",
      "date": "2010-02-24 18:46:08",
      "content": "\t<p>You guys have made me proud. I was so pleasantly surprised to see that some Pakistanis made a car back in the 60s on their own. The card turned out to be cute. <span class=\"caps\">I HIGHLY</span> encourage you to, at least, restore that car.</p>\n\n\t<p>Also think about creating a better version of the same car. Don&#8217;t worry about mass production yet. Make one good, robust, economical car which everyone will like. If it is successful, then someone investor will come forward to mass produce it. Why don&#8217;t you join hands with Mr. Feroze Khan of past Adam Motors.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 398,
      "author": "Syed Ali Raheel",
      "email": "ali_a102@hotmail.com",
      "date": "2010-03-13 13:06:05",
      "content": "\t<p>Absolutely amazing &#8230;. I am totally impressed gr8 work guys. We have all the talent here in pakistan but unfortunately we are not been supported by the government.</p>\n\n\t<p>Best Regards</p>\n\n\t<p>Ali Raheel</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 399,
      "author": "Adelaja Fawaz",
      "email": "faznice@yahoo.com",
      "date": "2010-03-30 20:31:57",
      "content": "\t<p>I would like to know how it works.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 400,
      "author": "Muhammad Omar",
      "email": "mossspk@hotmail.com",
      "date": "2010-05-11 11:26:11",
      "content": "\t<p>1967 and 2010 its been 43 years how cruel of the people responsible for not supporting. I am into motor industry and i know the problems which the people of my country face while getting a car though i make money out of it and the business was started by my father but i still think i wanna do some thing like this may it be less money and more effort but i will do it. My apologies for not being born at that time&#8230;&#8230; i am already in the process of making 1 and launching it into the market not at a massive level but i am getting started from only a little more then scratch&#8230;Do pray!!</p>\n\n\t<p>Again Hats off to you Sir.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 401,
      "author": "MAQureshi London",
      "email": "mukhtal@yahoo.com",
      "date": "2010-11-07 18:32:57",
      "content": "\t<p>Really you have done talent job,</p>\n\n\t<p>but democratic, liberal and Aristocratic system don&#8217;t have support for such people. I applaud your personal efforts, wish you good luck</p>\n\n\t<p>&#8221; A country can never progress when his talent has no respect.&#8221; Miller Smith Head of National Motors who runs big brands of cars at the beck curtain.</p>\n\n\t<p><span class=\"caps\">MAQ</span></p>\n\n\t<p>London</p>\n\n\t<p>unitrust@london.com</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 402,
      "author": "Imran Khan",
      "email": "imrantes111t@yahoo.com",
      "date": "2010-12-26 04:50:56",
      "content": "\t<p><span class=\"caps\">AOA</span>,</p>\n\n\t<p>This is living proof of talent present in Pakistan, unfortunately the government is too crooked and &#8216;busy&#8217; to support people like you.  Their top priority is to collect donations from other countries and fill their own pockets.  Its a shame that Pakistan still does not have its own manufactured vehicles and India is many many years ahead from us.</p>\n\n\t<p>Our nation&#8217;s talent keep going to waste and nobody seems to care.  The future of Pakistan&#8217;s motor industry is very dark indeed, unless the government jumps in and start funding projects like this.  Its about time that Pakistan starts manufacturing its own vehicles.</p>\n\n\t<p>Keep up the good work.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1556,
      "author": "Hamid Omar",
      "email": "Hamid.omar@offroadpakistan.com",
      "date": "2012-04-13 03:01:12",
      "content": "Yes still have the car - its in a carton - in pieces - rusting away in Karachi! Some parts missing!!! \n\nHO",
      "parent_id": 325,
      "approved": true
    },
    {
      "id": 1558,
      "author": "Muhammad Tauseef",
      "email": "ariess_41@hotmail.com",
      "date": "2012-05-17 13:41:45",
      "content": "I know Hamid shb and I worked under his supervision. He is soft spoken and very talented person. He has lot of knowledge. He made lot of another kind of machinery in Pakistan as well as rebuild a Bedford mini truck I proud on him being pakistani and i proud on my self because I have worked under the supervision of Hamid shb. \n\nNote:I have seen some of pieces of red car in yard.\n\nMuhammad Tauseef\n\nBerlin Germany",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1559,
      "author": "Muhammad Tauseef",
      "email": "ariess_41@hotmail.com",
      "date": "2012-05-17 14:01:35",
      "content": "Ford mini truck rebuilt by Hamid shb.\n\nhttp://www.pakwheels.com/forums/cool-classic-cars-latest/53766-classic-ford-f1-1948-rebuilt-karachi-3\n\n\nMuhammad Tauseef",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1567,
      "author": "Shahid Rocky",
      "email": "shahid.rocky79@yahoo.com",
      "date": "2012-12-10 21:38:44",
      "content": "I would like to buy this precious car. Where from i can buy this? Omer bhai.\n\nWaiting for your reply",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1570,
      "author": "naeem",
      "email": "naaeem302@yahoo.com",
      "date": "2012-12-23 00:40:38",
      "content": "sir i like ur car\nplz re condtion ur car \nthanx\nif possibale plz give me more pics \nthanx",
      "parent_id": 1556,
      "approved": true
    },
    {
      "id": 1600,
      "author": "Khan",
      "email": "khang@gmail.com",
      "date": "2013-05-06 09:41:31",
      "content": "Really lovely pictures\nloved them :)",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1634,
      "author": "Asif",
      "email": "m.aasif18@gmail.com",
      "date": "2013-11-01 15:45:03",
      "content": "v nice yar",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1637,
      "author": "Maliha",
      "email": "fidodidosignals@gmail.com",
      "date": "2013-11-22 17:08:53",
      "content": "I would like to know that how this Car works now?",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1670,
      "author": "Xyed",
      "email": "mehdix@hotmail.com",
      "date": "2014-02-22 12:52:45",
      "content": "Sir I salute you dedication .. hats off ..",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1964,
      "author": "Mobile Phone",
      "email": "mypakistani9@yahoo.com",
      "date": "2014-12-25 13:24:32",
      "content": "Great art. The first car looking real science.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2009,
      "author": "Iftikhar Siddiqi",
      "email": "ucl.pakistan@yahoo.com",
      "date": "2015-06-08 08:00:58",
      "content": "Hamid Bhai, KM Raza sent me the link to your car project. With your permission, I will refer to your work in my \"Lahore Chronicles\": https://www.facebook.com/iftikhar.h.siddiqi/posts/10153325723581069. After success of your Syntech Fibre project, I suggest you plan about designing cheap 1-5 KW solar and 1-2 MW hydro power systems. It will be a pleasure to be associated with you for any futuristic project in some capacity. Regards. Iftikhar Siddiqi; 0300-8490183",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2057,
      "author": "Abid hussain",
      "email": "abcoent@yahoo.com",
      "date": "2016-01-15 10:20:50",
      "content": "Gentlemen hats off to you. I wonder if you would have continued making  this beautiful red car . Automotive industry in Pakistan ? Job ? Export instead of import ? How much you could have contributed to Pakistani economy !!!!!  This should be saved and put into a museum .",
      "parent_id": 0,
      "approved": true
    }
  ]
}