{
  "post_id": 27,
  "comment_count": 22,
  "comments": [
    {
      "id": 303,
      "author": "Shan",
      "email": "shan91shan@hotmail.com",
      "date": "2005-01-30 19:39:26",
      "content": "\t<p>Could u tell me where this place is , and find me more places like these , cause i&#8217;m going to make a movie and i need good places to shoot it in. When u email me back , write in subject : <span class=\"caps\">PAKISTAN </span>, cause i won&#8217;t find it in junk mail.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 304,
      "author": "susannthomsen",
      "email": "susannthomsen@yahoo.com",
      "date": "2005-02-19 21:16:13",
      "content": "\t<p>hello khalid,</p>\n\n\t<p>congratulations to job great done (almost<img src=\")\" alt=\"\" border=\"0\" /></p>\n\n\t<p>wish i would have had the chance to read this years ago, when i was living in karachi (1989-1994). but nevertheless i will always return, which means to me &#8220;coming home&#8221; as pakistan is my abolute favorite country and my friends are living there.</p>\n\n\t<p>i was in the lucky situation riding a 4-wheel-car myself and enjoying many trips to hub dam and mostly hingol. my happiest memory.</p>\n\n\t<p>as i&#8217;m writing this, please tell me: is there a chance for a tourist renting a 4-wheel-car for a decent price? and if so, would it be possible to join someone on a trip?</p>\n\n\t<p>it would be nice, if you would find some time for a short answer.</p>\n\n\t<p>take care,</p>\n\n\t<p>susann</p>\n\n\t<p>P.S.: my homepage is in german language. I am trying to find as many intresting links and pages as possible for german readers, because i just can&#8217;t understand that people know so little about your beautiful homecountry.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 305,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2005-03-16 14:48:24",
      "content": "\t<p>Hay: Good job done, highlighting areas around Karachi, invigorating zeal in the local population and also highlighting Pakistan internationally.</p>\n\n\t<p>Umar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 306,
      "author": "Masood Ahmed",
      "email": "masood_x@yahoo.com",
      "date": "2005-05-31 17:41:55",
      "content": "\t<p>The surrounding areas of Karachi include the Khar centre of Kirthar National Park; the other being Krachat centre in Dadu district. The Khar centre is 80km north of Karachi. There is a fine rest house and in the morning people go for hiking on the hills to have a look at Ibex. I spend a night there back in November 2000.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 307,
      "author": "Rizwan",
      "email": "prizwan@cyber.net.pk",
      "date": "2005-06-03 19:58:14",
      "content": "\t<p>It was nice to see such great piece of interest, insight and knowlege in the day trip from Karachi.</p>\n\n\t<p>I really found this site interesting. I acknowlege and appreciate your work. Hope you will be keen in sharing more information regrding traveklling in and outside Karachi.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 308,
      "author": "chelsea",
      "email": "chelseamaya@hotmail.com",
      "date": "2005-06-07 03:01:48",
      "content": "\t<p>I was in Pakistan for a month with my grandmother in 1988. We absolutely loved it. I am coming back for the first time since then, now with my 8-year-old daughter. We have been invited to a week-long wedding in Karachi. We will also have a week to travel around. I remember fondly my former trip to Chaukandi tombs and Thatta on our way farther north. Since we only have an extra week to travel and it will be extremely hot in July, I&#8217;m wondering if it&#8217;s possible to get up north or not. I&#8217;d like to go to the mountain villages which would be too cold at other times of the year. We will not be trekking, but I like different cultures (and cool air if I can find it).</p>\n\n\t<p>Thanks for a great site, Chelsea</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 309,
      "author": "Afraz",
      "email": "sasa@hotmail.com",
      "date": "2005-11-22 04:45:57",
      "content": "\t<p>Dude karachi rocks no doubt about it</p>\n\n\t<p>What i wanna know is there are mangroves in downtown karachi like there is a bridge from where ppl feed school of Buoy i forgot the english name hmmm&#8230;.MULLETS yea baby mullets&#8230;.so like i said there are mangroves opposite to dat bridge, can we fish in those areas and the fish are they edible&#8230;.Oh and if anyone could also tell me some <span class=\"caps\">GREAT</span> fishin places Salt or fresh in and around karachi&#8230;.(not to faar tough lol 100 <span class=\"caps\">KM MAX </span>) <sup>_</sup></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 310,
      "author": "S.M.Ahsan",
      "email": "smahsan92@lycos.com",
      "date": "2005-11-23 01:42:56",
      "content": "\t<p>Dear Khalid Sahib</p>\n\n\t<p>I m very happy to see such a nice and interesting site here by u and i some time find such things about our country.I m also very interested in the company of fishing troops by the coast of Karachi and particularly Mubarak village and churna island or let me know about any club.I have been to many nice places by all over the Pakistan and abroad,if u arrange the visiters country wide pictures display so this will be exclusive part of this site.I m resident of karachi.</p>\n\n\t<p>Regards</p>\n\n\t<p>Ahsan</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 311,
      "author": "nomi",
      "email": "noumans@hotmail.com",
      "date": "2005-12-18 02:17:51",
      "content": "\t<p>I need to go to port qasim from karachi how far is it and what is the public transport like? Is it safe? I can I fly there? Any info will be appreciated.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 312,
      "author": "Salman Ali",
      "email": "turumti@gmail.com",
      "date": "2005-12-20 11:14:46",
      "content": "\t<p>There are any buses which go from Karachi to PQ. You should be able to get one from either the Saddar bus stand near the Empress Market or the Quaidabad Bus stand.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 313,
      "author": "Afzal Janjua",
      "email": "empathizers@hotmail.com",
      "date": "2006-03-14 08:38:08",
      "content": "\t<p>It is a good site.There is sufficient information,Please add pictures alos.Are there any places of speical interest for foreigners in the city and aroumd?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 314,
      "author": "naeem",
      "email": "love_humanity85@yahoo.com",
      "date": "2006-07-13 23:42:03",
      "content": "\t<p>Dear Friends,</p>\n\n\t<p>I m student of geology in UK,now a days the teacher here given to me to write about the industrial pollution surrounding the dam side,So i taken a decision that y not i write about the Industrial pollution surrounding the Hub dam in Pakistan b/c it is my home land,i want to prominant my country problem infront of the ppl who r responsible to solve these problems and try to get  some aid and assistance to solve this problem for my country.For this I ve already taken a permission from my teacher.If any one can help me to write and search a detail lecture , then plz send me a mail on love_humanity85@yahoo.com.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 315,
      "author": "Anwer",
      "email": "saeenmirza@hotmail.com",
      "date": "2007-02-26 18:16:12",
      "content": "\t<p>Why go anywhere else in the world, i thought the only places to see in Pakistan were north of Islamabad and Peshawar, though i havent lived in Khi for the past 14 years, i hadn&#8217;t heard of these places during my time there or during my various trips to the mother land. I will definitely make a point to pay homage. More reasons for us overseas pakis to move back.</p>\n\n\t<p>The info you have provided is very comprehensive but do you know if maps are available for these areas, where to find a guide etc</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 316,
      "author": "dr muhammad ali",
      "email": "drali_99@yahoo.com",
      "date": "2007-03-08 16:24:57",
      "content": "\t<p>could you plz let me know abt the fishing spots in karachi or outside both fresh water and salt water as i am fond of fishing</p>\n\n\t<p>thx</p>\n\n\t<p>dr ali</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 317,
      "author": "Amir Kapasi",
      "email": "amirkapasi@hotmail.com",
      "date": "2007-06-11 23:19:11",
      "content": "\t<p>Hi, we are attending a wedding in Karachi and at the same time planning a family trip, as a group (approx 20 of us nearby Karachi as this is our base) for 2-3 days.</p>\n\n\t<p>Can you suggest anywhere?</p>\n\n\t<p>Amir.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 318,
      "author": "faisal khan",
      "email": "sardarfaisal334@yahoo.com",
      "date": "2007-07-09 11:44:30",
      "content": "\t<p>Dear it is quite informative but there is need and provision in it to make it more scientific interms of biodiversity .It can be done very wel if focused on flora and fauna of the arae visted, it can also beneficial for the net based searchers to make an outline for the proper managing of the scientific expeditions.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 319,
      "author": "Muhammad Mohiuddin",
      "email": "muhammadmohiuddin@yahoo.com",
      "date": "2008-11-12 22:38:07",
      "content": "\t<p>This really was very interesting and worth reading topics. I&#8217;ve been to a few places around karachi.</p>\n\n\t<p>But i would like to know if Kalat hill station in Balochistan is safe enough to venture and are there any tourist spots over there? Because in Kalat during winter snowfall occurs and i love to c it. I haven&#8217;t really seen snowfall in my life. I can&#8217;t go to Northern areas due to time constraints. So it is feasible to go out there and have fun with friends? Also do inform me about the road conditions leading to Kalat??</p>\n\n\t<p>I would be very grateful to any1 who sends me the required info.</p>\n\n\t<p>Regards&#8230;</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 320,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2008-11-15 22:10:06",
      "content": "\t<p>Mohiuddin, I can&#8217;t say for sure about the Kalat area safetywise these days &#8211; I do know it snows in some places in Kalat, and it is very cold there all year around! The road to Kalat is in great shape, it&#8217;s the main highway to Quettta &#8211; Kalat is about midway.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 321,
      "author": "Hamid Omar",
      "email": "hamid.omar@offroadpakistan.com",
      "date": "2008-11-24 14:16:45",
      "content": "\t<p>From Karachi to Kalat is a good road with little traffic. From <span class=\"caps\">HUB</span> to about another 50km the road is being improved so the going is a bit slow but onwards upto Kalat it&#8217;s really good. Drive from Karachi to Kalat is about 6 hrs.</p>\n\n\t<p>Kalat is a rather small town &#8211; nothing much historical to see there (except Khan of Kalat Palace &#8211; for that you would need permission from some family member) &#8211; there are apple orchards etc.</p>\n\n\t<p>A place worth visiting is Harboi (it&#8217;s over 8,000ft)  &#8211; some 3 hrs of dirt track from Kalat &#8211; plenty of old Junipur trees there &#8211; some as old as two thousand years. One would need a Jeep to go to Harboi &#8211; preferably it should be maybe 3 vehicles. It&#8217;s cold there in summers &#8211; don&#8217;t know if the track would be open in winters.</p>\n\n\t<p>Safety &#8211; well in parts of Baluchistan (these days some risk is there)<img src=\"!\" alt=\"\" border=\"0\" /> So one has to take chances regarding safety<img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" /> Best of luck if you to decide to go to Kalat/Harboi<img src=\"!\" alt=\"\" border=\"0\" />!!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 322,
      "author": "DR SHER MOHD MEMON",
      "email": "drsheri75@yahoo.com",
      "date": "2009-11-27 16:35:09",
      "content": "\t<p>very very beautifull historical place if any body who is not seen the place historical in thatta that mean he or she has seen pakistan but incomplete history of pakistan. keenjhar lake need modernize for world peoples&#8230;.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 323,
      "author": "DR SHER MOHD MEMON",
      "email": "drsheri75@yahoo.com",
      "date": "2009-11-27 16:35:35",
      "content": "\t<p>very very beautifull historical place if any body who is not seen the place historical in thatta that mean he or she has seen pakistan but incomplete history of pakistan. keenjhar lake need modernize for world peoples&#8230;.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 324,
      "author": "Irfan Khan",
      "email": "mirfan01@hotmail.com",
      "date": "2010-01-05 10:42:58",
      "content": "\t<p>Thanks for the useful and detailed help..</p>\n\n\t<p>but can you please include the beaches in Balochistan like Sonmiani and the others? have heard a lot about a beach there to which i have never been. but yes, i have been to sonmiani and it was a good catch. we even sighted a couple of dolphins there.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}