{
  "post_id": 815,
  "comment_count": 8,
  "comments": [
    {
      "id": 1676,
      "author": "Syed F Akbar",
      "email": "syedfakbar@gmail.com",
      "date": "2014-04-27 08:54:57",
      "content": "Nice, very nice. Very well written.\n\nIn a land bereft of opportunity (for the common man), people tend to seize on every chance to gain a coin ... and control.\n\nYes, control. Tired of bending and bowing, the little people relish the opportunity to say \"This is my house, and these are my rules\".\n\nNow, if you would have indicated a desire to make a 'nazrana' of a thousand rupees at the maz'ar of the baba, the rules would have been relaxed, the veil would have lifted, to allow you access. You could also have achieved the same relaxation of rules by donning a military officer's uniform.\n\nIt is akin to a writer, a good writer, withholding the location of both of the two places he (or she) so deliciously describes. \n\nIt says  \"This is my blog, and it is my choice\" \n\nIt asks  \"Do you have a nazrana ?\"\n\nOh' ignore my rant, please. Will you ?   I am just a senile old man writing from the other side of the globe, too frail to visit any of these wonderful places I read about.  You go ahead and write, for you have a gift. Write with an open heart ... throw it all up in the air. Let the chips fall where ever they may.\n\nYes, I enjoyed reading your article/blog. Thank you.\n\nFazal",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1677,
      "author": "Irfan Husain",
      "email": "irfan.husain@gmail.com",
      "date": "2014-04-28 20:03:06",
      "content": "Thanks for a very well-written piece about a little-known corner of Pakistan",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1678,
      "author": "Salman Rashid",
      "email": "odysseuslahori@gmail.com",
      "date": "2014-04-29 09:32:59",
      "content": "What a lovely and interesting piece of work. Well done. With all my claims of having been everywhere, I did not know of this place. Thank you for putting this up.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1680,
      "author": "Rizwana Shelley",
      "email": "rizwanashelley@gmail.com",
      "date": "2014-05-01 15:13:24",
      "content": "From Rizwana Shelley in Kent, UK. lovely to read of your experience. I pray that the security situation in Pakistan will be better and we shall too be able to visit this mystical place.\nWishing you all the best.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1682,
      "author": "semyne khan",
      "email": "semyne.khan@gmail.com",
      "date": "2014-05-10 20:07:32",
      "content": "I am a great admirer of your travel writings, and  thrilled you liked this.",
      "parent_id": 1678,
      "approved": true
    },
    {
      "id": 1683,
      "author": "Semyne Khan",
      "email": "semyne.khan@gmail.com",
      "date": "2014-05-10 20:09:58",
      "content": "I hope so too, as there are a vast number of stunning places that are worth visiting in Pakistan.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1684,
      "author": "Semyne Khan",
      "email": "semyne.khan@gmail.com",
      "date": "2014-05-10 20:13:00",
      "content": "Irfan Husain, thank you, really pleased you liked it .",
      "parent_id": 1677,
      "approved": true
    },
    {
      "id": 2211,
      "author": "Zahoor Ahmed",
      "email": "bajkani82@gmail.com",
      "date": "2017-09-10 01:09:45",
      "content": "Veri nice Fazal sb.....you creat a mismerising realm with words....",
      "parent_id": 1676,
      "approved": true
    }
  ]
}