{
  "post_id": 6,
  "comment_count": 7,
  "comments": [
    {
      "id": 7,
      "author": "Salman Ali",
      "email": "turumti@hotmail.com",
      "date": "2003-06-26 02:58:00",
      "content": "<p>Kanrach is not just 120 km from Karachi. It is approx. 190km from Karachi. (Karachi – Winder 70 km, Winder -Kanrach 120 km : Total – 190km).</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 8,
      "author": "A Travellor",
      "email": "haha@hotmail.com",
      "date": "2003-08-23 12:33:52",
      "content": "<p>why don’t you write for us urdu-medium folks as well….once in a while hum apni mother tongue main bhi kuch parh lia karain<img src=\"!\" alt=\"\" border=\"0\" />! mainoo samajh nahin aathi ithni angrezi<img src=\"!\" alt=\"\" border=\"0\" /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 9,
      "author": "Ejaz Asi",
      "email": "ejaz@eruditiononline.com",
      "date": "2003-10-06 11:05:30",
      "content": "<p>well thats pretty decent and justified wishlist: blogging in urdu medium. Now its up to founders/team of OffroadPakistan how to come up with the solutions. But it would sure be cool.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 10,
      "author": "Azhar",
      "email": "azharkhan20@hotmail.com",
      "date": "2005-02-25 12:22:02",
      "content": "<p>Just one observation that i would like to make here is that the birds you saw flying in formations were Demosil Cranes (Koonj) not Flamigos. Flamingos do not migerate from Siberia.</p>\n\n\t<p>Siranda lake has dried up for several years now, it received some water around rains of 2003. Thanks to the japanese funded tube wells, the surface water does not stay too long even if there are suffecient rains.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 11,
      "author": "Yaseen",
      "email": "yaseen@offroadpakistan.com",
      "date": "2005-02-25 15:12:59",
      "content": "<p>I don’t know if the birds we spotted were enroute to or from siberia, but I do know that they were flamingos and not demoiselle cranes. These birds were off whitish with a pink hue  and had pinkish legs whereas demoiselle cranes are gray with dark legs and not quite as tall.</p>\n\n\t<p>Another thing, the lake wasn’t dry last year. It did seem very stagnant though.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 12,
      "author": "Azhar",
      "email": "azharkhan20@hotmail.com",
      "date": "2005-02-28 18:13:25",
      "content": "\t<p>Hi, Yaseen,</p>\n\n\t<p>I made out as you described the birds very high and in circeling motion, which is very koong like. Koonj or Lakha Jani (Flamingo), I think it must have been a great sight seeing so many birds.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 13,
      "author": "kashif",
      "email": "kashifzia72@yahoo.com",
      "date": "2005-10-29 10:21:41",
      "content": "<p>i have also craze to see hidden beautiful places around us (near Karachi)</p>\n\n\t<p>I have seen many places after browzing <span class=\"caps\">OFFROAD PAKISTAN</span>.COM.</p>\n\n\t<p>1st i journey to <span class=\"caps\">HINGOL</span></p>\n\n\t<p>2nd Bhootani farm, Dureji.</p>\n\n\t<p>3rd <span class=\"caps\">MOUNTAINS</span> of Hingol – Omara</p>\n\n\t<p>Now Kanrach Inshallah.</p>\n\n\t<p>Mountains from Hingol to Ormara are also very beautiful, your web page have no details about this beautiful place.</p>\n\n\t<p>Hollywood actress Angelie Jolie says about this beautiful place.</p>\n\n\t<p>Hollywood actress Angelie Jolie when visited Pakistan last year in her capacity as a <span class=\"caps\">UNICEF</span> goodwill ambassador and traveled along the coastal highway, she was so moved by the sight of the naturally carved figure that she promptly named it “Princess of Good Hope”.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 14,
      "author": "usama",
      "email": "usama_yousaf89@hotmail.com",
      "date": "2009-04-10 01:53:24",
      "content": "<p>salam yar im intersted in fish hunting but so kindly guide me.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}