{
  "post_id": 120,
  "comment_count": 4,
  "comments": [
    {
      "id": 1011,
      "author": "Shair Ali",
      "email": "shair@qtapaknet.com.pk",
      "date": "2004-06-08 12:12:19",
      "content": "\t<p>Bismillaha hirrahman irrahim.</p>\n\n\t<p>I observed by travelling from Loralai to Dera Ghazi Khan that it take double time due to diversious route as compared to the previous time. The work on this route going on very slowly. So the work on this area should be increased in order to save the time of nation and get rapid economical progress.To achieve these goals infrastructure and labour need to be increased. The labour should also be local and well equiped. After completion of scheme,the greenery should be introduced near the road to ensure proper shadow in severe hot for travellers. I expect that my comments would be taken in to account,inshaAllah.</p>\n\n\t<p>Thankyou</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1012,
      "author": "Dr.Jalal",
      "email": "jalalkhanleghari@hotmail.com",
      "date": "2005-02-18 15:58:18",
      "content": "\t<p>Pictures of fort munro must be their you can get these by <span class=\"caps\">PTV </span>Ntional</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1013,
      "author": "Farooq Malik",
      "email": "fhmalik@ridearound.com",
      "date": "2005-05-12 07:14:40",
      "content": "\t<p>Sounds like a very interesting trip.  I hope to do something like this this upcoming winter.  Would you suggest using a <span class=\"caps\">GPS</span> system incase you get lost or are most people able to help you with directions?</p>\n\n\t<p>Farooq</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1014,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-05-16 11:54:10",
      "content": "\t<p>There aren&#8217;t any good Pakistani maps of <span class=\"caps\">GPS</span> which I am aware of, so a <span class=\"caps\">GPS</span> isn&#8217;t really that usefull for navigation. Secondly, people are very helpfull with directions.</p>\n\n\t<p>Still, a <span class=\"caps\">GPS</span> is handy to have to know things like altitude etc. as no where in the northen areas will anyone be able to tell you the precise height of whereever you are. The sign posts are often wrong too.</p>\n\n\t<p>The other interesting use is, with a advanced model, you can save all your waypoints, and later on lay it over a map. So I would recommend using a <span class=\"caps\">GPS</span>, its just that you can&#8217;t rely on it as a primary navigation.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}