{
  "post_id": 25,
  "comment_count": 23,
  "comments": [
    {
      "id": 268,
      "author": "M. Hameed Sumbal",
      "email": "hsumbal@hotmail.com",
      "date": "2004-07-14 22:36:45",
      "content": "<p>Extremly valuable information. I like the way U narated it sir.</p>\n\n\t<p>I am an automobile enthusiast. I live in Lahore and I ma looking for a god Jeep rebuilder.</p>\n\n\t<p>I think I have an answer now.</p>\n\n\t<p>I want to get some opinions and tips from u sir.</p>\n\n\t<p>I would be obliged if U give me ur email address.</p>\n\n\t<p>Thanx</p>\n\n\t<p>Hameed</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 269,
      "author": "Taimur Mirza",
      "email": "fabric@super.net.pk",
      "date": "2004-07-15 09:58:53",
      "content": "<p>fabric@super.net.pk</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 270,
      "author": "Khurram Baig",
      "email": "xtrariter@yahoo.com",
      "date": "2004-09-08 18:09:29",
      "content": "<p>Great article, a real pleasure to see someone write on the subject of jeeps and rebuilding them. I have been going to Laloo for over a decade now, Hos sons have taken up the same line of work but are more jeep mechanics than rebuilders. Really nice to know there are others out there that share the same passion, Jeeps.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 271,
      "author": "Sameer",
      "email": "yourdadwhenever@hotmail.com",
      "date": "2004-11-21 23:31:53",
      "content": "<p>Hey i`m Sameer, I live in Lahore.It started with like a week back when i started taking interest to build a jeep for myself. The actual motive of the jeep would not be to indulge itself into full time off roading but sometimes for the sake of fun. Basically i would like to have some info about where to buy the jeep from ? where to get a new engine from ? questions like these are bluging out from my head and after colsulting your website and reading these articles i decided to post you for help. My basic objective would be to get built a attractive wide body converted jeep maybe a new model of <span class=\"caps\">CJ7</span> could work out very well or you suggest me any other model available in the local market. I certainly do expect a reply from you. And with the detail of the workships the resale showrooms and all …. Expecting for an early reply .. ( i need information regarding Lahore`s accesibility )ThanXx</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 272,
      "author": "Taimur Mirza",
      "email": "fabric@super.net.pk",
      "date": "2004-11-23 11:37:41",
      "content": "<p>Sameer,</p>\n\n\t<p>I suggest you take a trip to Pindi and check out the re-builders there, some excellent work is being done there and good sturdy offroad Jeeps are re-built. It would be cheaper and you would have hands on experience while your dream jeep is being made besides knowing your vehicle inside out, a pre requisite for an offroader.</p>\n\n\t<p>All the best.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 273,
      "author": "Shakilur rahman",
      "email": "shakilurrahman99@hotmail.com",
      "date": "2004-11-28 17:37:37",
      "content": "<p>We are also in the making of 4×4 jeeps with the exception that we specialize in giving our own design to the vehicles.</p>\n\n\t<p>In case you or your members are interested in 4×4 jeeps (custom made) we are there.</p>\n\n\t<p>Regards</p>\n\n\t<p>Moca Technologies</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 274,
      "author": "b.t.butt",
      "email": "shamimbutt2003@yahoo.com.uk",
      "date": "2004-12-27 20:42:40",
      "content": "<p>i was very pleased to read all the letters  from jeeps shokeen , i thought i was the the only one in the field. although i donot have a jeep in uk but soon i will be retiring to my native pakistan jhelum . and then i wish to buy one smaller version of course . do you know anywhere i can buy a second hand jeep not 4/4 desiel one. please advise me. happy nw year to you all. i found t. mirza letter very interesting.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 275,
      "author": "Shaikh",
      "email": "shaikhrasool@yahoo.com",
      "date": "2005-03-11 10:16:39",
      "content": "<p>Asalam O Alaikum,</p>\n\n\t<p>I am from Karachi and what a piece of article by Mr Taimur Mirza. Specially the funny part of balochi ppl used to say crack douglus i have my balouchi friends and they used to say “awaa khata hai” need air  and “fetrol fumf” Petrol Pump</p>\n\n\t<p>anyway rest is that i recently visited Gwadar 3 months back and as u know that <span class=\"caps\">FWO</span> made nice track all over and through that i have an interest in buying jeep</p>\n\n\t<p>I was broke and then i buy <span class=\"caps\">SUZUKI LJ 50 I</span> have rebuild myself the exterior part but i am little confused with the engine part it has a 2 stroke engine can any one help me out who is the professional in makin these engine or should i put on 4 stroke engine and  i m interested in buying <span class=\"caps\">CJ7</span> if anyone has it plz let me know.</p>\n\n\t<p>Sorry that there should be comments regarding this article , Actually i must say that u are really a fine discoverer and what a trip it would be and nice piece of mahine u have.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 276,
      "author": "Bilal Bajwa",
      "email": "bilal.asghar@gmail.com",
      "date": "2005-07-27 00:46:23",
      "content": "<p>Taimur, great article. Need your advise. Can I get your #? You can either email me or sms me at +92 300 8432187. Thanks a bundle.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 277,
      "author": "Perwez",
      "email": "perrypup@yahoo.com",
      "date": "2005-08-29 14:22:18",
      "content": "<p>Dear taimur Mirza,</p>\n\n\t<p>I would like to know the postal addresses of Ghani, Laloo, Noor Mohammad and Ustaad Shafi. Please reply <span class=\"caps\">ASAP</span> as I could spare some time for my dream jeep that I have been thinking about for years. I want to get the job done by your recommended Jeep builders but I do not have their contact number or address. Please help.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 278,
      "author": "Taimur Mirza",
      "email": "fabric@super.net.pk",
      "date": "2005-09-01 13:58:34",
      "content": "<p>What I can do is to get phone numbers of these guys and post them here for quick easy access.</p>\n\n\t<p>fot the moment I have only:</p>\n\n\t<p>Shafi’s : w/shop:  2520538</p>\n\n\t<p>: cell: 0333 3031050</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 279,
      "author": "Salman Khalid",
      "email": "mkhalid@magic.net.pk",
      "date": "2005-10-24 09:34:07",
      "content": "<p>Hi..I live in Lahore and I am looking for some experienced and competent mechanic to rebuild my Cj-7 Jeep. Please help me to find some experienced one in Lahore. Thanks</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 280,
      "author": "ryan",
      "email": "ryan@jeeprecycling.com",
      "date": "2005-12-28 23:53:17",
      "content": "<p>hello my name is ryan , and i am just wanting to let you know i manage a jeep wrecking yard where we have all years and models (lots of used parts)and we ship world wide. please e-mail me with any questions or requests.</p>\n\n\t<p>jeeprecyclers redding  CA. <span class=\"caps\">USA</span></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 281,
      "author": "Ali Saeed",
      "email": "im@alisaeed.com",
      "date": "2006-02-15 16:31:53",
      "content": "<p>Awosome info.</p>\n\n\t<p>I know nothing about jeeps, recemmend a jeep to me, which can go smooth on beach sand… i use to go Mubarak Goath weekly for fishing</p>\n\n\t<p>I want a basic jeep which can fillfull my requirement …</p>\n\n\t<p>please reply</p>\n\n\t<p>thanks</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 282,
      "author": "shahzaib",
      "email": "shahzaib_rocket@yahoo.com",
      "date": "2006-03-15 20:05:51",
      "content": "<p>i am the worlds greatest automobile enthusiast any one who is building or involved in any type  of  auto mobile work i can help him both technically and financially</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 283,
      "author": "hammad shah",
      "email": "hammadshah24@HOTMAIL.COM",
      "date": "2006-04-28 12:48:09",
      "content": "<p>its amazing stuff……… i just got absorbed in the narration…..</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 284,
      "author": "Aamir Basrai",
      "email": "aamir.basrai@pmapakistan.com",
      "date": "2006-05-26 14:43:29",
      "content": "<p>Hey Taimur, Excellent information, for laymen like us!, however wanted advice from pro’s like you onbuying a jeep, i go to Hingol 4-5 times a year, for fishing, but am dependent on ppl who have 4wd, so want to buy one of mine, got to Mubarak Goth, Ormara & places like those…..how about Vintage 1951?…how much would that cost?….or some other 4×4?…..</p>\n\n\t<p>Will be looking fwd to hearing from you soon.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 285,
      "author": "Arsalan",
      "email": "mehranmarble@gmail.com",
      "date": "2006-06-11 03:28:50",
      "content": "<p>Assalam O Alaikum.</p>\n\n\t<p>I’ve a Isuzu Trooper, 1990. My rides engine is almost dead. and I’m unable to locate a good engieire for my ride. Is this mechanic still alive?</p>\n\n\t<p>If yes, can you e-mail me his details?</p>\n\n\t<p>Best Regards,</p>\n\n\t<p>Arsalan Arif</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 286,
      "author": "Mir Islam",
      "email": "islammustafa@hotmail.com",
      "date": "2006-10-04 07:19:24",
      "content": "<p>Ustaad Ghani’s Number is</p>\n\n\t<p>0333-2318035</p>\n\n\t<p>and his son <span class=\"caps\">FAYAZ</span> whose in the same line…</p>\n\n\t<p>0321-2437412</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 287,
      "author": "Farhan",
      "email": "taxhitax@yahoo.com",
      "date": "2007-05-23 01:55:21",
      "content": "<p>Excellent Article by Taimur ! Recently I bought Pajero ‘92.  The only thing that worries me is its engine, its weak, yet the mech I consulted recommends not to rebuild it but better change it. Any idea where can i get a good 2800CC intercooler sound one (on exchange basis) Or if anyone who can testify that Ustad Ghani should have a second look at it before i decide to change it.</p>\n\n\t<p>Thanks a lot to everyone.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 288,
      "author": "farhan",
      "email": "f_kureshe@yahoo.com",
      "date": "2007-09-21 03:42:32",
      "content": "<p>Hi</p>\n\n\t<p>I have a <span class=\"caps\">CJ6</span> jeep,also have an unregistered wrangler,wanted to convert my <span class=\"caps\">CJ6</span> into wrangler,is it possible,how much would it cost?</p>\n\n\t<p>Thanx.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 289,
      "author": "Khawer Mirza",
      "email": "khawerjamal@yahoo.com",
      "date": "2007-10-10 21:19:47",
      "content": "<p>Best Ride of my Life:</p>\n\n\t<p>5 <span class=\"caps\">PM </span>- Heading home (Tariq Road) from Habib Public with Taimur (Age 14) at the Steering (I am 12) – Dawood Center’s bridge is grid locked from both sides – No problem says Taimur – and I am almost standing (when should be sitting) – in the excitment of the ride to follow. Taimur makes a slow right turn onto Queen’s Road – zigging thru the down and up traffic from and to the bridge – and as we reach the start of the bridge – there is no where to go – I look at Taimur and kinda dare him and urge him on at the same time – he smiles and takes the Jeep over on to the shoulder – all the way over – with right side wheels barely clearing the curb – and we drive on thru (inclined from left to right)- people are shocked – some are yelling – but we are driving on – over to the other side – smack in front of <span class=\"caps\">PIDC </span>- Oh, the thrill, the chill – and the spill – remains embedded forever.</p>\n\n\t<p>No one can handle a Jeep like you Taimur. You are the <span class=\"caps\">JEEPKING</span> of Pakiland.</p>\n\n\t<p>Thanks Taimur—for the memories – u r the best brother in the world</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 291,
      "author": "Shoaib Akhtar",
      "email": "shoaibxyz@yahoo.com",
      "date": "2008-01-09 14:11:05",
      "content": "<p>Dear,</p>\n\n\t<p>I know Ustaad Shafi throuh Mr. Omar, I bought his M-38 and he did few chanegs surely he is great person who knows what and how to rebuild old 4X4 vehicles. Love his job and Commitment.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}