{
  "post_id": 43,
  "comment_count": 9,
  "comments": [
    {
      "id": 564,
      "author": "Abbas Bilgrami",
      "email": "abbasb@progas.cc",
      "date": "2006-11-27 23:40:08",
      "content": "<p>Salim’s Journal forgot to mention the issue of Gulab Jamun’s would you care to elaborate. Omar the Barbarian certainly has enough hair for the balding Bilgrami. Cruel comments regarding Tanveer will not go down well. He will have his revenge. Of course you fail to mention the unfortunate demise of the <span class=\"caps\">CJ7 </span>(your pride and joy) if it hadn’t been for Erum’s presence you would no doubt have been ribbed greatly to your detriment. Most of the deer seemed to be part time actors who had found no work on <span class=\"caps\">PTV</span> serials in many years, hence the one horned Chinkara. I fear there were more donkeys in the valley then wild animals. Finally thank you Zulfiqar and Saleem for your hospitality. Sabiha for her patient and delightful company. Pappu sahib for just being there.</p>\n\n\t<p>See you all on a future trip. Do you guys have a motto like Lilo from Lilo & Stitch fame like ‘no one gets left behind’.</p>\n\n\t<p>Oh yes I still say Toyota’s are better…… Hehehehe</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 565,
      "author": "Salim Khan",
      "email": "salimkhan1967@hotmail.com",
      "date": "2006-11-28 10:46:29",
      "content": "<p>What Gulab Jamuns?  I fail to recollect any mention of such absurd things!</p>\n\n\t<p>I have been extremely forgetful in my written recollections of the trip…hence there was no mention of the fact that our financial wizard, the Tanveer of Doom, happened to stumble into the only 4 square feet of quicksand in the entire Balochistan Province spreading over hundreds of thousands of kilometeres…likewise, animals, to novice nature lovers, are simply animals, no matter what their size, color or species may be…hence……the deer appear to be donkeys and donkeys deer…….not to mention the almost extinct endangered species of “bonsai” Lions that i happened to show you during the night trip…..but lo and behold…….all of you amatuers thought it was a wild cat………will wonders never cease…..</p>\n\n\t<p>Hamid and Clan will turn over twice, loose some major sleep becuase for the past many years they have been advocating the “Cherokee” Jeep as the only Jeep on this planet…..a couple of trips in a comfortable Prado has changed their point view considerably as their prized possession, a Cherokee, is now for sale…..</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 566,
      "author": "Imad",
      "email": "imad.ali@gmail.com",
      "date": "2006-11-28 21:40:52",
      "content": "<p>Nice write up Salim <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' />  Some folks may have thought Azzo’s valley was tough – none of them were in my jeep though. All in a day’s offroading for us <img src='http://komac.local/wp-includes/images/smilies/icon_wink.gif' alt=';)' class='wp-smiley' /> . The hill climb was fun; a good contrast from the sand traps, especially since it required getting a bit technical. Rockcrawling is always more fun.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 567,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-11-29 13:06:33",
      "content": "<p>Great article… now you also need to write the voiceover for the video of the trip. It was a great trip, thanks for organizing it! Lots more to follow…</p>\n\n\t<p>About the wildlife – how do you expect to see any when 10 loud vehicles clatter to a stop at the first animal they see? I saw three largish “bonsai” lions, and a couple of small deer on the way to the dam early in the morning while you were all fast asleep.</p>\n\n\t<p>p.s Salim, you did receive a copy of the last trip to Bhootani. It must be your failing memory after being exposed too much sunshine… that must be why you even forget to mention your own jeep, which spent the day relaxing at the resort…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 568,
      "author": "Salim Khan",
      "email": "salimkhan1967@hotmail.com",
      "date": "2006-12-04 10:40:50",
      "content": "<p>I will most definitely confirm to you that i have received absolutely no video of the last trip to bhootani farm…in fact that was the first one that we went on and there was a lot of filming by the 4×4 Crew…unfortunately, the lens of the camera is the only thing i saw then…NO <span class=\"caps\">VIDEO</span>!  As i am also one who does not give up, i will request that a copy of that video may please be provided forthwith……..</p>\n\n\t<p>We are on to Kirthar National Park on the 8th of December, 2006……for two nights….hope to see you there</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 569,
      "author": "Abbas Bilgrami",
      "email": "abilgrami@hotmail.com",
      "date": "2006-12-12 00:28:54",
      "content": "<p>KO dont worry Salim is very forgetful.</p>\n\n\t<p>But only when it suits him. Like the Gulab Jamuns on the Sorh trip and the fact that the Kirthar Trip was to include the in laws as well.</p>\n\n\t<p>Also note that the Salim Khan english tends to be come rather officious and huffy when his memory starts failing him. I guess years in the civil service will do it.</p>\n\n\t<p>Great photos. The bat does look stunned in the flashlight though.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 570,
      "author": "Salim Khan",
      "email": "salimkhan1967@hotmail.com",
      "date": "2006-12-12 20:38:27",
      "content": "<p>All I can say about Abbas’ critique regarding my English is that he seems to have been bitten by an Offical “Bug” sometime not too far in the distant past- a bite which he still remembers to this day, albeit with some remorse, has further been heightened by the fact that he missed this great trip to “Kirthar.”</p>\n\n\t<p>Whereas my memory is concerned, it retains all that has to be retained? <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /> )))))</p>\n\n\t<p>Whereas regarding the In Laws, I can assure you that the only difference between In Laws and Out Laws is that the later are “Wanted!”</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 571,
      "author": "Ali Mansoor",
      "email": "alimansoor@hotmail.com",
      "date": "2006-12-13 17:17:43",
      "content": "<p>Nice write-up, the trip was fun and thanks to all organizers. Hope to see you all soon.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 572,
      "author": "Salim Khan",
      "email": "salimkhan1967@hotmail.com",
      "date": "2006-12-21 02:28:08",
      "content": "<p>Well Off Roaders, there are a number of options available at present for 2 or 3 day trips…..the first one being a trip up the 4,000 ft high mountain in Dureji with a night stay on top: the route would be either through Khar Center or via Karchat Center…..the other being a trip to RaniKot with a night stay at Bhit Shah………..lets get some feedback on the options and some ideas about dates..i must say that eid holidays are a good few days one can spend in the wilderness…other than that any weekend after the 15th is fine with me…what aobut you people?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}