{
  "post_id": 77,
  "comment_count": 12,
  "comments": [
    {
      "id": 844,
      "author": "Teeth Maestro",
      "email": "drawab@cyber.net.pk",
      "date": "2007-09-14 15:32:47",
      "content": "<p>Brings back fond memories of the trip – you must update us when it will come on <span class=\"caps\">TV </span>- hence are shot at fame and fortune <img src='http://komac.local/wp-includes/images/smilies/icon_wink.gif' alt=';)' class='wp-smiley' /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 845,
      "author": "Sajid Dadabhoy",
      "email": "sajidd@Hotmail.com",
      "date": "2007-09-22 00:36:32",
      "content": "<p>Hey KO/MO,  guys no movie on the Hingol trip that I made with you guys?</p>\n\n\t<p>Ko, still waiting for the volcanoe coordinates..</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 846,
      "author": "Ehsan Awan",
      "email": "e_awan@hotmail.com",
      "date": "2007-09-23 17:29:23",
      "content": "<p>Though i was not with u guys on this particular trip but sure it reminds me of our trip to Hingol last year.  thrilling and adventourous…. would like to go again….great bunch of ppl to camp with:)))</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 847,
      "author": "Dr Hassan Sandhu",
      "email": "hassansandhu@gmail.com",
      "date": "2007-09-26 12:23:58",
      "content": "<p>Dear Offroad Pakistan club members, I got a link to your video on HIngol National Park from <span class=\"caps\">ATP </span>(All things Pakistan). I clicked on the link just to check out the content and after 1 hr of intense viewing, I am sitting here sending this email, just to appreciate your activities and your spirit for exploration.  To be very honest with you, up untill I saw this video, I was not aware of the natural baeuty of Baluchistan.</p>\n\n\t<p>Thank you for posting this video.  Now that I got your website, I will watch each and evryone of them.  This is the best video/tv viewing I have had for the past 9 years sitting in London.</p>\n\n\t<p>Once again, very well done guys and gals. Your activities are very much appreciated.</p>\n\n\t<p>Regards and best wishes</p>\n\n\t<p>Dr Hassan Sandhu</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 848,
      "author": "Hamid Omar",
      "email": "hamid.omar@yahoo.com",
      "date": "2007-09-26 22:01:38",
      "content": "<p>Over the next few months we will be posting more videos on off- roading in Pakistan – so keep on the look out on our website. Another video being uploaded on video.google.com is called “Chasing Storms in Thar Desert” and should be available for viewing in another day or so.</p>\n\n\t<p>We are glad that you liked the Hingol video and thank you for your nice comment.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 849,
      "author": "Sikander",
      "email": "luke_ahmad@hotmail.com",
      "date": "2007-10-01 20:54:52",
      "content": "<p>I loved the video it was brilliant liked the offroadin bits. Make some more…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 850,
      "author": "amar",
      "email": "deepdive@gmail.com",
      "date": "2007-10-17 13:32:38",
      "content": "<p>Great work MO and offroadpastan!</p>\n\n\t<p>hats off!!</p>\n\n\t<p>amar</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 851,
      "author": "faisal",
      "email": "www.thrillerz78@hotmail.com",
      "date": "2007-12-03 16:50:14",
      "content": "<p>hi  this is faisal from karachi my hobby diving boating camping archery  sking ur website is good i c   hingol    national park lots of time</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 852,
      "author": "Abdullah",
      "email": "abdullah_aqua@hotmail.com",
      "date": "2009-04-24 16:05:54",
      "content": "<p>Hats off to you guys. I watched and enjoyed the each second of the video. Nice work and editing.</p>\n\n\t<p>I’ve been a fan of your site for more than year, I visited the Hingol National Park and Ormara Beach last month. That was such a splendid journey. And trust me since then, no beautiful place in English movies inspires me anymore, coz now I know that I have a much better place in my own beloved country.</p>\n\n\t<p>Thanks for sharing the breathtaking pictures, amazing videos and useful articles with us.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 853,
      "author": "Imran L",
      "email": "ladak.imran@gmail.com",
      "date": "2009-09-22 05:19:49",
      "content": "<p>Amazing!</p>\n\n\t<p>Makes me want to just get up and leave the city routine, and experience the great outdoors!</p>\n\n\t<p>Thanks for this!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1046,
      "author": "Nadeem Khan",
      "email": "paksafares@yahoo.com",
      "date": "2011-02-27 10:58:10",
      "content": "Hi, My name is Nadeem Khan, I saw your off road video, and was surprise that, you guys  with all the difficulties, and political problem, take time out for off road  trips. keep on doing, I would love to join you guys.\r\n\r\nThe name Sajid Dadabhoy, Sound very familiar, I remember, A friend in junior high school, Happy Home School In Tariq Road. i know guy Name Sajid, Are you brother of Tanweer's Dadabhoy.",
      "parent_id": 845,
      "approved": true
    },
    {
      "id": 1540,
      "author": "A video of an offroad trip to Hingol National Park - PakWheels Forums",
      "email": "",
      "date": "2011-12-14 16:36:33",
      "content": "[...] if u want to enjoy...watch the full video avilable on the following link Adventures in Hingol | OffroadPakistan      __________________  \"Fun Begins Where Road [...]",
      "parent_id": 0,
      "approved": true
    }
  ]
}