{
  "post_id": 82,
  "comment_count": 7,
  "comments": [
    {
      "id": 876,
      "author": "Jan Wind",
      "email": "jan-wind@planet.nl",
      "date": "2007-02-04 07:50:52",
      "content": "<p>Thank you for participating in the workshop. We had a good media coverage as well. Now our challenge how the make Hingol not only the largest and most divers and beautiful park but also the best managed park.</p>\n\n\t<p>Jan Wind Park Specialist</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 877,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2007-02-06 12:22:09",
      "content": "<p>It was nice to meet you at the workshop. I hope the many plans for the Hingol National Park are implemented.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 878,
      "author": "Mohammad Saleem Shaikh",
      "email": "saleemzeal@hotmail.com",
      "date": "2007-02-15 09:07:42",
      "content": "<p>It was good luck to see people from Offroad Club Karachi at the two-day consultative workshop ‘Scientific Surveys for the Park Management Plan’ organised by the Hingol National Park Management and held in Karachi the Regent Plaza hotel on February 2-3, 2007.</p>\n\n\t<p>On this occasion, ideas that came out from the Offroaders, Mr. Tahir Mirza in particular with regard to dew capturing’ are really wonderful. If materialised by the Park Management, the idea of the dew capturing’ can really do wonders for the people of Park area that are faced with persisting water shortage. It can help strengthen further the confidence building measures (CBMs) of the Park Management.</p>\n\n\t<p>I personally would encourage the Park Management team to go forward and kick off sittings with the people from the Offroaders Club to talk over ideas and initiatives that can yield feel-good results and overall impact on the lives of the people residing in the Hingol Park Area.</p>\n\n\t<p>Mohammad Saleem Shaikh</p>\n\n\t<p>Environmental Awareness/Communication Specialist,</p>\n\n\t<p><span class=\"caps\">DHV </span>Consultants</p>\n\n\t<p>Hingol National Park</p>\n\n\t<p>Uthal, Distt. Lasbela,</p>\n\n\t<p>Balochistan</p>\n\n\t<p>saleemzeal@hotmail.com</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 879,
      "author": "Muhammad Mazhar Liaqat",
      "email": "ranadfo@yahoo.co.in",
      "date": "2007-03-07 18:52:50",
      "content": "<p>It was very good to see people in the workshop from all over the Pakistan.We have received many ideas from all our respected participants and looking forward for their proper guidense.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 880,
      "author": "Jamal",
      "email": "jamalgawi@gmail.com",
      "date": "2007-03-16 13:50:55",
      "content": "<p>Dear, Mr. Mohammad Saleem Shaikh, I have an old friend working for <span class=\"caps\">DHV</span>, his name is Jan Wind. I would appreaciate if you can give me his contact email.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Jamal</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 881,
      "author": "raheel saleem",
      "email": "raheel.saleem911@gmail.com",
      "date": "2007-10-06 17:14:11",
      "content": "<p>Hello!</p>\n\n\t<p>Try to start an environment survival campaign through electronic and print mediums coz these are the most common and effective mediums for public interaction and awareness.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Raheel Saleem</p>\n\n\t<p>Cell: 0345-2865155</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 882,
      "author": "gari",
      "email": "sonia22@hotmail.com",
      "date": "2009-04-12 00:14:01",
      "content": "<p>That sounds interesting, is that happens every year.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}