{
  "post_id": 50,
  "comment_count": 27,
  "comments": [
    {
      "id": 619,
      "author": "raulz",
      "email": "ra@indiatimes.com",
      "date": "2005-03-24 13:19:06",
      "content": "<p>Hi guys,</p>\n\n\t<p>jst a query</p>\n\n\t<p>I never knew that jeep is an actual brand</p>\n\n\t<p>I used to think that it’s something which is part of general lingo</p>\n\n\t<p>neways this model looks rather dashing though <span class=\"caps\">SCORPIO</span> from mahindra</p>\n\n\t<p>is rather sturdy.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 620,
      "author": "kareem",
      "email": "kareem_eesaa@yahoo.com",
      "date": "2005-04-18 01:41:47",
      "content": "<p>I see that jeep hurricane is not qualified for offroad.Because its ground clearance is low.Its tyres are good,also the shape.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 621,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2005-04-18 16:07:44",
      "content": "<p>kareem, if this car is produced, it would be the most capable 4×4 ever mass procduced by far.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 622,
      "author": "Scott Alan Fisher",
      "email": "tangibledesigns@sbcglobal.net",
      "date": "2005-04-19 02:46:13",
      "content": "<p>It`s great & it`s bad</p>\n\n\t<p>Asthetically it`s fine too great</p>\n\n\t<p>The turn rad is great</p>\n\n\t<p>I`ll asumme you took in account maximum articulation of suspension.</p>\n\n\t<p>Drop the 2nd engine-Which you probably already knew that</p>\n\n\t<p>Youre drive train would have to be maniputed now that the 2nd head-ache has been deleted -But will still work the same</p>\n\n\t<p>Nice going college kid!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 623,
      "author": "Dan Rhodes",
      "email": "littleman_1988@msn.com",
      "date": "2005-04-19 22:46:45",
      "content": "<p>I think this new hurricane is freakin awesome.look at the turn rad. on that rig. no more backing into trees on a small trail.if i had the money i’d buy it…well if i had the money i’d buy alota things. but any way this jeep is <span class=\"caps\">BRILLIANT</span>.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 624,
      "author": "bob",
      "email": "bob@aol.com",
      "date": "2005-04-19 23:03:30",
      "content": "<p><span class=\"caps\">MAKE MORE</span></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 625,
      "author": "kasey",
      "email": "icanthearyou13@hotmail.com",
      "date": "2005-04-29 00:34:25",
      "content": "<p>I think this jeep is the coolest car and i cant even drive. I saw it in the 4X4 magazine, I think it should be a production vehicle</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 626,
      "author": "thomas",
      "email": "stingtom@yahoo.com",
      "date": "2005-06-09 04:58:01",
      "content": "<p>this looks like a good off road jeep but gas prices will cause people to think that two engins is a little to much</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 627,
      "author": "Musharraf Ahmad",
      "email": "anwar368@hotmail.com",
      "date": "2005-06-13 20:58:11",
      "content": "<p><span class=\"caps\">I LOVE 4X4</span>=I Lives in <span class=\"caps\">GERMANY</span>. I want to bring any 4X4 to pakistan but custum duty is to much. <span class=\"caps\">I LOVE</span> this jeep.This is  My mashoka.</p>\n\n\t<p><span class=\"caps\">MUSHARRAF</span></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 628,
      "author": "Imad",
      "email": "ohiw@iouher.com",
      "date": "2005-06-17 23:45:54",
      "content": "<p>If no one else is gonna say it, let me be the first but the first two guys to comment really gotta be smoking some good stuff. How on God’s green earth can anyone compare a concept Jeep Hurricane with not one, but <span class=\"caps\">TWO </span>Hemi V8s and 740lbs of stump pulling torque, to a Mahindra Scorpio? That is one agonising question.</p>\n\n\t<p>Second, seems like 14.3 inches of ground clearance suddenly became a whole lot less than perfect for our happy-to-settle-for-28” tires-and-6”-of-ground-clearance crowd.</p>\n\n\t<p>Curb your criticism until one reaches our shores. People are already getting their panties in a bunch over the ho hum H2 city slicker wannabe Hummer. GM would have been better off calling it the Pim’ Mo’beel Boulevard Cruisah, complete with fuzzy dice, gold chains, leopard and zebra print upholstery, furry steering wheel cover, drapes, and a complementary stick, hat and overcoat to go as well.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 629,
      "author": "bigdave",
      "email": "drive_420fast@hotmial.com",
      "date": "2005-07-08 01:17:56",
      "content": "<p>the first two people whom wrote coments about this new consept jeep obviously have no clue wut they are talkin about.  this feep is f***in awsom!!   if i had this jeep i would never go home. 740 lb-ft of torque<img src=\"!\" alt=\"\" border=\"0\" />! with 670hp<img src=\"!\" alt=\"\" border=\"0\" />  Im saving my pennies now.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 630,
      "author": "Ghostryder",
      "email": "bjkoho@msn.com",
      "date": "2005-08-02 01:51:08",
      "content": "<p>I’m with bigdave, the tardo’s that made the first two comments need to stick to their Geo Metros. Being a 2k Jeep owner and loving it, I have to say the Hurricane is <span class=\"caps\">BAAAAAAAAAAAAD</span> and I gotta have one<img src=\"!\" alt=\"\" border=\"0\" />! (Course unfortunately it will never get produced.) I’ve got a full articulation 4” lift on my Jeep, and have the same wheel travel as this thing does. So Kareem, yes it is quite fit for offroad.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 631,
      "author": "aman",
      "email": "aman_sagoo1@rediffmail.com",
      "date": "2005-11-05 13:33:15",
      "content": "<p>well very hot  jeep for  hot people like me.well in my life i ould  hav this</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 632,
      "author": "chris",
      "email": "chris_scanlan@hotmail.com",
      "date": "2006-01-07 23:12:32",
      "content": "<p>i think this is an awsome car i would love to purchase one once i am 18 but i would love to now what the price is going to be.I think it would be a great idea for off road driving</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 633,
      "author": "Omar Husain",
      "email": "omar91@sbcglobal.net",
      "date": "2006-01-24 06:18:51",
      "content": "<p>are you going to get the jeep hurricane. It will look good with the rest of your and my mamoon’s jeeps.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 635,
      "author": "Omar Husain",
      "email": "omar91@sbcglobal.net",
      "date": "2006-02-02 07:56:29",
      "content": "<p>Yeah, this jeep better go into production otherwise i will <span class=\"caps\">SUE</span>.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 636,
      "author": "Ev3n",
      "email": "heaven_out@hotmail.com",
      "date": "2006-02-21 12:18:27",
      "content": "<p>strong and realy nice !! verry cool and utility for many work for patrol <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 637,
      "author": "Puma",
      "email": "adamanbomb11@yahoo.com",
      "date": "2006-04-01 06:00:49",
      "content": "<p>This is the baddest off roader i have ever seen, o except for in halo where the wart hog has a very close resemblence to the jeep hurricane.  all you gotta do is but a 58 mm chain gun on the back and uve got a wart hog.  or as i like to call it a puma.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 638,
      "author": "Tas",
      "email": "tasleem4ever@yahoo.com",
      "date": "2006-05-20 03:45:58",
      "content": "<p>Amazing… but this is only concept… is it impleted so far or only a concept so far?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 639,
      "author": "Johnny boy",
      "email": "john_mc80@yahoo.com",
      "date": "2006-07-13 23:59:16",
      "content": "<p>This jeep will be the best 4×4 ever. Just to let everyone know I work at a Toy store and Power wheels the company that let me have my first jeep when I was only 4, is going to make a Jeep Hurricane for the little ones. I was told by the vendor of Power Wheels that it’s going to be the biggest vehicle that they have ever made.  Now to me that sounds like this bad A$$ of a jeep will go into production at some point. If not you will see me out in one of the little power wheels one.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 640,
      "author": "colt lane",
      "email": "lcolt@hotmail.com",
      "date": "2006-08-10 02:52:05",
      "content": "<p>make this vechical the jeep hurricane wich is a concept right now and make it a production vechical and I promise you that you will sell a lot the public in the tri cities area in kennewick pasco and richland washington zip cods 99336 99337 99301 99302 all of these people are highly interested and would buy if you would actually make this vechical a production one. I know for sure that if you make it they will buy it , there are so many enthousists whom would purchase this vechical not only becuase of it’s looks or as a daily driver but also as a toy purchase for them to play in on the weekends out offroading etc. looks great and fun to drive, you should be looking at what kinds of options this is going to have for the after markett such as grill gards bumper gards etc bras’ and how about a top cover mad out of some light weight special material to be designed as a rain gard or a roof if your catching my drift in case you get out there and it rains on you. not many care about that but there is the population that would like to stay out of the rain and keep the inside of the vechical clean and dry. thankyou for taking the time to read my concern that your not going to make this vechical wich would be very dissapointing and would dituritt a population of people from buying jeep around here after teasing them with this hurricane concept that  really needs to become a production vechical imediatly! thankyou again</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 641,
      "author": "Omar",
      "email": "omar_comsoft@hotmail.com",
      "date": "2006-09-06 20:47:30",
      "content": "<p>hi</p>\n\n\t<p>i wanna study the designs of the jeep hurricane, so if some one can give me any mechinical drawings (regarding engines n other parts of the vehicle)  and some written information of The Jeep Hurricane, i ll b most thankful n greatful to him. I love studyin latest technologies in the world of 4WD’s  n carz  or u can say any latest vehicle  coz i have made these machines my passion n my life. I hope u people can understand wat i mean so please if some one can send me this material i ll b most thankful n greatful to him.</p>\n\n\t<p>My name n address are given below, please E-mail me n send me this material via post.</p>\n\n\t<p>Name:      Omar Ishaq Bhat</p>\n\n\t<p>Address:   341-A Nursing Ghar</p>\n\n\t<p>Street:      Balgarden</p>\n\n\t<p>City:         Srinagar</p>\n\n\t<p>State:        Jammu & Kashmir</p>\n\n\t<p>Pin:          190001</p>\n\n\t<p>Country:    India</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 642,
      "author": "mehboob",
      "email": "mik7786@rediffmail.com",
      "date": "2006-09-07 12:41:48",
      "content": "<p>the best 4X4Xfar really. i hope it gets into mass production before some one else copies the concept and builds it.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 643,
      "author": "Butch",
      "email": "rcl@gci.net",
      "date": "2006-09-28 16:28:27",
      "content": "<p>Living in Alaska is demanding on trucks and cars!</p>\n\n\t<p>Jeep is the only way to go! would love to play in that hurricane in the deep snow up here in the wastelands of Alaska.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 644,
      "author": "mohamad siraj bin shamsor iqrammuddin",
      "email": "blackhoax@hotmail.com",
      "date": "2006-10-13 18:53:59",
      "content": "<p>jeep hurricane concept are the beautiful car,and he look like very stronger,and very sporty concept car.its is my first time i see concept car like that.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 645,
      "author": "Michael",
      "email": "amostherapy@aol.com",
      "date": "2006-10-15 17:04:39",
      "content": "<p><span class=\"caps\">I WANT ONE</span>.  <span class=\"caps\">NOW</span>.  <span class=\"caps\">ANYTHING WITH WHEELS THAT CAN DO THAT</span>, AND <span class=\"caps\">PULL REAL HEAVY STUFF</span>…  <span class=\"caps\">UNREAL</span>.  <span class=\"caps\">NOW WHILE WE</span>’RE <span class=\"caps\">WISHING</span>… <span class=\"caps\">FUEL CEL</span>?  <span class=\"caps\">WON</span>’T <span class=\"caps\">HOLD MY BREATH</span>.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 646,
      "author": "Hasnain rizvi",
      "email": "royalemotorssales@gmail.com",
      "date": "2007-06-04 09:54:44",
      "content": "<p>need make and price how much units available more actule picture required 4 africa markit</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}