{
  "post_id": 7,
  "comment_count": 13,
  "comments": [
    {
      "id": 16,
      "author": "Aleem",
      "email": "aleem@hotmail.com",
      "date": "2003-07-08 19:45:10",
      "content": "\t<p><span class=\"caps\">KO </span>- very nice piece on the trip .. u becoming a writer?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 17,
      "author": "Aleem",
      "email": "aleem@hotmail.com",
      "date": "2003-07-09 09:36:38",
      "content": "\t<p>Kaleem bhai, sorry for the earlier comment &#8211; when i read the first para I wrongly thought it was by Khalid (KO) !!</p>\n\n\t<p>You, indeed, are a gifted writer</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 18,
      "author": "Jim Nibblett",
      "email": "nibblett@juno.com",
      "date": "2003-08-07 02:15:53",
      "content": "\t<p>Are the pictures at the bottom of this site of the Hingol River?  Where can I go to get more pictures of the Hingol, especially around where it cuts through the Makran Mountain Range?  Thank you in advance.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 19,
      "author": "taimoor khan",
      "email": "khanu_taimoor@hotmail.com",
      "date": "2003-12-20 20:22:05",
      "content": "\t<p>Sir! It is a great site indeed but there is a lack of pictures available.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 20,
      "author": "Marsha Khan",
      "email": "marshadipaolo@cox.net",
      "date": "2004-03-04 21:48:33",
      "content": "\t<p>Hi, I&#8217;m trying to find out if Dr Mansur Ahmad is the same young man who used to be my pen pal in the 70&#8217;s. I&#8217;m from Trinidad and was from Lahore, Pakistan.</p>\n\n\t<p>Please contact me if you have any info about him.</p>\n\n\t<p>Thanks,</p>\n\n\t<p>Marsha</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 21,
      "author": "rehana",
      "email": "bbiggles@hotmail.com",
      "date": "2004-03-28 04:58:51",
      "content": "\t<p>dr. mansoor,</p>\n\n\t<p>wife, susan????   i was a patient and a friend in karachi&#8230;.how are you all doing??? i want to do the babusar pass&#8230;what do you recommend&#8230;rehana</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 22,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2004-08-17 12:07:18",
      "content": "\t<p>Really very nicley written travelogue of Gwadar. Well done. Also a very good way to promote tourism of Pakistan on international scale. I was glued to the monitor screen, till I completed the whole piece of literature. Any ways I also own a CJ-7. Keep it up.</p>\n\n\t<p>Umar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 23,
      "author": "ghias bhatti",
      "email": "rbhatti@msn.com",
      "date": "2004-08-25 08:37:44",
      "content": "\t<p>Great writing. You guys are living the stuff of dreams. I know Hamid Omer from boarding days in Aitchison. How do I get in touch with him..Love..Bhatti</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 24,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2004-10-20 14:46:09",
      "content": "\t<p>Gawadar 2001: Nicely written over-view, also a little bit about the team members is interesting.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 25,
      "author": "Urooj Saifi",
      "email": "uroojsaifi@yahoo.com",
      "date": "2005-04-06 14:14:27",
      "content": "\t<p>Hi,</p>\n\n\t<p>Great piece. I am planning a trip on the Coastal Highway all the way to Gwadar. Please advise on places to stay enroute as I do not have connections with the IG, Coast Guards or the army. Anyone who has done the trip please respond.</p>\n\n\t<p>Thanks.</p>\n\n\t<p>Urooj</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 26,
      "author": "Imad",
      "email": "no@no.com",
      "date": "2005-04-08 15:44:13",
      "content": "\t<p>Gwadar is only an 8 hour drive from here depending on your speed. You</p>\n\n\t<p>can easily get there in one day as long as you leave Karachi in the</p>\n\n\t<p>morning and can hold a steady 110-120 kmh on the Coastal Highway.</p>\n\n\t<p>Therefore, no need to worry about places to stay enroute. I don&#8217;t know</p>\n\n\t<p>much about places to stay in Gwadar itself but someone else should</p>\n\n\t<p>chime in on that. You might want to give yourself more time for the</p>\n\n\t<p>drive though because there are lots of interesting landscape features</p>\n\n\t<p>to photograph on the way.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 27,
      "author": "Faiz Ahmad",
      "email": "sfa2005@gmail.com",
      "date": "2005-08-21 06:20:20",
      "content": "\t<p>Dear Kalim:</p>\n\n\t<p>Many thanks for writing such a nice article with beautiful photographs. It reminded me of the beautiful time I had spent along the Makran Coast while working on various projects for the harbour construction. still remember the nice Baluchis(made lot of good friends in Basol,Ormara, Pasni and Gwadar).Not forgetting the tastiest Jambo shrimps of Khor Kalmat and giant lobsters of Ormara. Scared about the encounter with Cheetah while working along the Ormara and Basol areas,didnt find any though.I also remembered the Zigri people and there unusal way of practise.</p>\n\n\t<p>The passion of Off Road brought me to the foot hills of Canadian Rockies and that is the place where we live now .Its very beautiful and scenic and the best thing is the reach of those area from our place, as you can go to any place within one to five hours drive.</p>\n\n\t<p>From Canada with Love</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 28,
      "author": "Kaiser Hameed Khan",
      "email": "khameedk@hotmail.com",
      "date": "2009-12-10 15:30:16",
      "content": "\t<p>Dear Kalim Omar Sir,</p>\n\n\t<p>I went to Burn Hall in 1961 and left after Senior Cambridge in 1974 to join the Army like some of old Hallians. Retired from the Army in 2003. Now settled for the time being in Islamabad. I have read some of your articles and feel proud to be associated with you through Burn Hall.If you permit I want to enter your name in the Allumini of Burn Hall in the Wikipedia page of Burn HAll. I will require some particulars like when you joined/ left. what you are presently doing and  some of your achievements.It will be a matter of pride for all the Old Students of Burn Hall. It will be wonderful if you could send details of your class fellows as well. By the way Sir Khan taught History to us as well. We had Miss Minto, Father Scanlon, Father Thysen and Father Nyzen.</p>\n\n\t<p>Yours Sincerely</p>\n\n\t<p>Col&#174; Kaiser Hameed Khan</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}