{
  "post_id": 59,
  "comment_count": 10,
  "comments": [
    {
      "id": 710,
      "author": "Syed Hamza Hassan",
      "email": "hamza.shah@ieee.org",
      "date": "2005-07-27 21:22:10",
      "content": "\t<p>Please allow me to have a constructive disagreement with you! Being a &#8216;hardcore diesel nut&#8217;, currently stationed in Germany (a diesel paradise) and having done part-time study-research in this subject, I do have many reservations about your claim and will briefly specify.</p>\n\n\t<p>Taking the example of the legendary Mercedes <span class=\"caps\">OM614 </span>&#038; <span class=\"caps\">OM617</span> engines, they were designed to have a higher than normal redline of ca. 5100RPM, and last literally a <span class=\"caps\">MILLION MILES</span>, or half of that figure in the German taxis. I also possess an old 300TD merc, 235000KM strong, and no blow-by to be seen at all!</p>\n\n\t<p>Old diesels here cost 3-4 times as much compared to the petrol counterparts, because they last much longer.</p>\n\n\t<p>The new merc <span class=\"caps\">CDI</span> motors do not fail this reputation, are <span class=\"caps\">MUCH</span> more powerful, less noisy, more efficient, fulfil the <span class=\"caps\">EURO</span>-IV norm and designed to last just as long as seen in the taxis etc. It is also important that the engine keeps its emission profile, otherwise it is not allowed on the roads, therefore they not only last long, but remain strong and clean.  It&#8217;s very hard to find a car, newer than 2001, having less than 200,000KMs on the clock, and are normally coated by &#8216;Dekra&#8217; as having 50% life ahead of them! (Understatement as they are an insurance and product lifespan testing company)</p>\n\n\t<p>The same is true for the legendary landcruiser 1H motor, having a <span class=\"caps\">NORMAL</span> overhaul interval of 500,000KMs.</p>\n\n\t<p>Question: What goes wrong in Pakistan??</p>\n\n\t<p>Answer: Everything!!</p>\n\n\t<p>1st major culprit is the Diesel Fuel! Here in Europe, diesel contains 0.03% sulphur content, compared <span class=\"caps\">HUGE HUGE 1</span>% in Pakistan. Sulphur destroys inappropriate engine oil (appropriate being Oil with a higher <span class=\"caps\">TBN</span>!). All oils in Pakistan are not at all appropriate for 1% sulphur! Eg. in the documentation of CH-4 oil types, most of them can bear only 0.1% of sulphur. Therefore the solution is to use a proper oil and change very early, (Pakistani oil change standard of 1500-3500KM is Very early indeed, because here, oil in the oldest of the engines lasts typically 10,000KMs, in diesels of course!)</p>\n\n\t<p>Policy makers are at fault, because they let the people import incompatible categories of diesel, and oils!</p>\n\n\t<p>Marine Diesel Fuel contains 3% Sulphur, and the marine diesel engine oil has the guts to deal with the additional sulphur to preserve performance through the normal oil change interval!</p>\n\n\t<p>Oil filters from the local manufacturers are useless, as they choose to use the filtering medium with no prior scientific knowledge, plus the bypass valves in these filters are either to tight (leading to filter medium rupture), or too loose (bypassing dirty oil). The correct genuine oil filters are overly expensive for use (nothing is optimised <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /> !</p>\n\n\t<p>Then comes the dust in the fuel, oil and mainly in the air! We are a dusty country but do not follow the procedures  according to the conditions. Again, the correct air filters are overly expensive. There is so much hype of manufacturing the new cars, but no (physically and economically) proper service parts for the old ones!!</p>\n\n\t<p>I have four more reasons but would not write much more due to the inappropriate place.</p>\n\n\t<p>Therefore even a very well maintained machine in Pakistan seldom lasts longer than 150000 KMs which is a pity. The Europeans press much more out of their engines, but each parameter is well optimised therefore the diesels just won&#8217;t die <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\t<p>I hope to have a long technical discussion someday someplace and thank you for considering my reservations!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 711,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-08-09 11:48:12",
      "content": "<p>Hamza, I totally agree with your points – a well maintained diesel should last close to a million miles – many australians forums have people posting that their toyota diesel engines have reached well over 500,000 km with no loss in power or fuel economy!</p>\n\n\t<p><span class=\"caps\">CRD</span>’s should also last very long – except that they are far less tolerable of bad fuel and no maintainece than regular diesels – which is why I posted above that they are not very suitable for Pakistani conditions.</p>\n\n\t<p>There is no proper service for new cars here – I have asked practically all the local  dealers (Honda/Toyota/Suziki) what they do when <span class=\"caps\">EFI</span> engined cars come in for tuneup – whether they hook them up to a computer and moniter the engine parameters and tune the engine accordingly etc. They always look at me like I’m from Mars or something when I mention turning <span class=\"caps\">EFI</span> engines. Turned out all they do is change the oils and filters – they only deal with the electronics when something goes wrong with the engine. Even then, all they do is replace sensors randomly until it starts working again!</p>\n\n\t<p>Engine oils need to be designed for the locally available diesel – since the oils here are imported from abroad and generally are the same formulations being used in Europe and Asia, so I doubt they account for the higher levels of sulpher in Pakistani diesel.</p>\n\n\t<p>Even with regular maintanence, Pakistani diesel engines just don’t last even half as long as they should.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 712,
      "author": "Syed Hamza Hassan",
      "email": "hamza.shah@ieee.org",
      "date": "2005-08-09 13:49:42",
      "content": "<p>You are very right Khalid.</p>\n\n\t<p>I am basically from Lahore, and there about two years ago, I tried to reach a Toyota Indus “higher-up” to ask about the new oil that Toyota-Pakistan had introduced for use in its own cars.</p>\n\n\t<p>They had launched an aad campaign saying that this oil was specially choosen for use in Toyota, and in Pakistan. But upon finding out that it had the same grading as the other oils available in the market, I felt very angry because I don’t think that the public should be manipulated as if they are donkeys! I therefore reached this guy and asked him some questions, he was very patient, I must say, but could not give one satisfactory answer also thinking that I was some special ‘dude’ from mars <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\t<p>I had also telephoned the oil companies present in Pakistan (Shell and <span class=\"caps\">PSO</span> at that time) to ask them how they choose their oils and products for Paksitan. Their technicall staff did not also have any idea of what I was talking about.</p>\n\n\t<p>Shell was totally non-cooperative hanging-up on me, but <span class=\"caps\">PSO</span> seems to have a surprisingly and comparitively better coustomer service policy.</p>\n\n\t<p>They found a document about the specifications of the fuel that they were selling and e-mailed it to me (presently also available at their website, looks like a copy from the time of Lawerence of Arabia, photocopied by none other than himself:) and said that they could  not do anything about it as it was government policy to sell this grade of fuel.  When I ‘pleaded’ about altleast selling the rite oil for the fuel sold, they had no idea but said that my ‘plea’ would be taken further.</p>\n\n\t<p>I hope that the people would become aware, and ask for the quality products (cars, engines, services and parts e.t.c) so that they are not able to make money out of the ‘uneconomical’ and ‘expensive to run’ junk sold in Pakistan.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 713,
      "author": "Yaseen",
      "email": "yaseen@gmail.com",
      "date": "2005-08-09 15:10:21",
      "content": "<p>Guys,</p>\n\n\t<p>This is a good subject for discussion and is likely to have many more interesting comments, so lets move this to the forums section.</p>\n\n\t<p>Don’t stop writing.</p>\n\n\t<p>Cheers</p>\n\n\t<p>Yaseen</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 714,
      "author": "Irfan Akram",
      "email": "irfan_akram@yahoo.com",
      "date": "2006-09-10 23:30:41",
      "content": "<p>Guys you have opened up my eyes! Syed Hamza Asad it was a real constructive disagreement by you. Once again it amazes me that how ignorant are we so called “educated” crowd about the <a href=\"http://www.apnigari.com/\" rel=\"nofollow\">cars</a>we keep. Keep on discussing guys, people need to know more in this country!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 715,
      "author": "muhammad junaid",
      "email": "muhammadjunaid1987@yahoo.com",
      "date": "2007-01-21 01:35:30",
      "content": "<p>Basically diesel engines are more powerful and more sufficent but not economical .They are more suitable for long rotue s and in countries having low tempreture .but i have seen that most of the modren countries have stop usin diesel engine in passenger car and even in vans b/c of smoke . i personally like diesel engines as compared from cng’s b/c drive of diesel is more energetic and airconditioner also works better. but its true  that diesel engine have less life as compared to petrol engines in crowded cities and hot countries . but engies which were coming  in japnese  recondition car were still a better from pakistan assembelled cars . its my personal experice that i purchased a fresh reconditioned corrolla 1986 2.0d in 91 which was already 60000km driven  and it last for 170,000 km then i overhauled  it  and bielive it its a  pleasure drive its best for long route .I purchase indus diesel 2.0d in 1997 0 meter and it was company maintained but it last for 110000 km .Diesel engines assembled in japan are better than of pakistan or china 0r korea</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 716,
      "author": "gerard van beusekom",
      "email": "gerardvb@ethionet.et",
      "date": "2007-05-19 13:17:39",
      "content": "<p>I agree on sulphur content <span class=\"caps\">TBN</span> story.</p>\n\n\t<p>What would be a save <span class=\"caps\">TBN</span> at a diesel sulphur content of 1%</p>\n\n\t<p>(interval recommended by vehicle manufacturer is 10.000 km, however in Ethiopia the norm is to change oil every 5000 km, and I think rightly so).</p>\n\n\t<p>Is there a save additive available, that could be applied to the oil we buy in the market, in order to increase the <span class=\"caps\">TBN</span> to save levels.</p>\n\n\t<p>Thanking you,</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 717,
      "author": "chris oyemi",
      "email": "christoy@mtnnigeria.net",
      "date": "2007-06-11 21:30:59",
      "content": "<p>Hi All,</p>\n\n\t<p>Though this is about my first time of visiting this site, I believe the knowledge  impact derivable through this means cannot be over-emphasised.</p>\n\n\t<p>I will appreciate if any of you guys can assist with the following:</p>\n – How many kinds of diesel type are there?\n – What are their burning rates like?\n\n\t<p>I will appreciate feedback in the above regard.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Chris Oyemi</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 718,
      "author": "Ahmed Nayyer",
      "email": "ahmednayyer@yahoo.com",
      "date": "2007-12-27 17:00:30",
      "content": "<p>I cannot give views/statements on modern diesel engines, since I am not into modern engines, be them gasoline or diesel. I never worked on modern engines and they hardly ever required me to.</p>\n\n\t<p>We should not be complacent and move ahead with technology, but technology in general and automotive, has progressed from a primitive level to the one where it stands today, its imperative to understand those levels first.</p>\n\n\t<p>I do agree with Khalid Omar, the more power you extract out of a given engine displacement, the less mileage it will serve, however I cannot say that a modern diesel engine will not last as long as a diesel engine from earlier days, its more safer to say that modern engines are more delicate and complex.</p>\n\n\t<p>The Mercedes-Benz <span class=\"caps\">OM615</span>.940/.941 – 616.912 and 617.912/.951/.952 are very reliable engines with such an exceptional high mileage as four hundred thousand miles and beyond, this is because Mercedes-Benz made huge investments when these engines were being developed, resulting in improved foundry for engines and cylinder heads, as well as the quality of machining and tooling, high pressure diecasting and better materials.</p>\n\n\t<p>Mercedes-Benz was in a vision to develop vehicles that would serve for atleast three decades in those years.</p>\n\n\t<p>But even these engines can not serve you more than 450,000 miles, a million miles is simply out of question.</p>\n\n\t<p>Some people really get confused with the 1975 <span class=\"caps\">W115 240D </span>Taxi covering 4.6 million miles, it must be noted that in a perido of 23 years, the greek taxi owner rotated two spare engines in with the car’s original motor a total of 11 times. Each engine averaged 418181 miles, driven by a commercial driver. End of story.</p>\n\n\t<p>Again, as Khalid Omar writes about power per block size, Mercedes-Benz engines for vehicles (except for race/performance applications) deliver less than thier actual displacement can easily manage otherwise, this results in low wear index, promoting high mileage and reliability. This statement comes from experience as my family has a history of keeping Mercedes-Benz vehicles.</p>\n\n\t<p>I must add here, as the post is heading more towards engine mileage than comparing them, that, to a great extent, engine mileage is under the direct control of a driver. You need consistency and patience in driving. These are two qualities only seen in the drivers of the very first order.</p>\n\n\t<p>Pakistan is not the only country with dust, pollution and corruption in the world. Its a developing country. Motoring aside, the nation at large needs food, living space and education.</p>\n\n\t<p>People are not organized with their work and life over here, are less educated, they don’t have disciplined minds, they have less money to spend. People have problems to solve that are none of their concern altogether.</p>\n\n\t<p>Thanks for the research, on diesel fuel and the oils, its highly informative.</p>\n\n\t<p>Apart from technology, society also affects automobile, its service and life, I want to divert the readers’ attention in this direction.</p>\n\n\t<p>People seldom manage a vehicle with service history over here.</p>\n\n\t<p>Few people here have the means to drive their own personal car. In a common household, a car is always shared. This plays a vital role in reducing the vehicle’s serving life.</p>\n\n\t<p>There is a lack of automotive technical support and service providing companies. The 3S companies provide support for the only vehicles that they have sold.</p>\n\n\t<p>Although the following might look deviated, rather odd under “Comparing Diesel Types” I must write down as it is very constructive.</p>\n\n\t<p>I have spent much time on Pakistan and finding solutions to its problems, how to get this nation on track, in short.</p>\n\n\t<p>Pakistan’s Nation needs to restore and build its morale, needs to empower its culture, recall its heritage, we need to promote our languages, our colors, our architecture, we need to study arts and humanities, refrain from creating saturation of science and technolgy, this causes probelms as we don’t have platforms to deploy and harness such knowledge, a student of such ends up comparing local scenario with developed nations.</p>\n\n\t<p>From more than five decades, the students of engineering and technology universities are unable to develop Pakistan’s own indigenous automobile, why? because they lack the vision and the spirit to do such feat. Hamid Omar Sb did that, we at Team-NAYYER did that. None of us is a formal engineer. None, I repeat.</p>\n\n\t<p>Hence, only patriotism, the love for art, culture, heritage and history combined can flame such vision, technology arrives itself, after such.</p>\n\n\t<p>We should do things that build nations and countries, stop over criticizing ourselves, throw away hopeless attitude towards doing things, stop ridiculing our country’s name, its founders and people that served us.</p>\n\n\t<p>The only way to predict future is to create it, come with us, be a part of it.</p>\n\n\t<p>Nothing will go wrong in Pakistan. We can construct a day like that.</p>\n\n\t<p>Oh young Muslim, have you ever thought?</p>\n\n\t<p>What a galaxy it was!</p>\n\n\t<p>of which you are a broken star?</p>\n – Ahmed Nayyer\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 719,
      "author": "admiralboner",
      "email": "admiralboner@yaho.com.au",
      "date": "2009-04-29 17:00:38",
      "content": "<p>well it would also depend on driving style. the more right foot the more fuel in the oil whether it’s the latest Bluetec Benz  banger or old Toyo 2H. A heavy right foot is a real killer.   Being German I can understand the concept of     ‘Diesel’.  It is not really about longevity of the motor but rather the the productivity.  Being specifically designed as a commercial unit to power industry in the first instance [and not as a passenger vehicle power plant] where the almighty capitalist dollar rules longevity would be a hindrance . As models with greater wealth creating potential would supercede current models in short periods.  Longevity is basically an extra by product which in certain cases of good maintenance can make the motor last quite a long while.  Take trucks as an example. Big companies use these as a tool and nothing more. They serve their time and get upgraded regularly and it is only the average person who can’t afford to do this that tries to milk every kilometer out of their wagon that they can get. this is a good thing in the end but I can’t stress the fact that frequent maintenance is the key and that means oil changes more frequently.   And that gets me down to the last bit. buy an hour meter and go by that not kilometers traveled.</p>\n\n\t<p>Finally I must say that nothing is better than that superior German feeling of driving a car with a silver star on the bonnet.    I get that feeling from just being German. fancy that.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 720,
      "author": "Zaheer Iqbal Naru",
      "email": "xaheer@gmail.com",
      "date": "2010-02-12 20:53:06",
      "content": "<p>I have seen Mercedes Actros 3831 6×4 Primemovers (OM501LA) completing 500,000 kms using Mobil Delvac 1 with an oil change interval of 30,000 kms (Shahnawaz Motors recommendations; though i still believe that it should be not more than 20,000 kms). These trucks are still running well in my company, a utility company named <span class=\"caps\">SNGPL</span>.</p>\n\n\t<p>Another breed is Volvo, <span class=\"caps\">FL10</span>’s and <span class=\"caps\">F10</span>’s with <span class=\"caps\">TD102F</span> engines with crankshafts still on standard dimensions after completion of 1.0 million kms.</p>\n\n\t<p>Diesels are truly wonderful.</p>\n\n\t<p>The latest is a <span class=\"caps\">DEUTZ</span> water Cooled <span class=\"caps\">BF4L2013</span> powering a <span class=\"caps\">KAMAT</span> pump, employing Common Rail Diesel technology with <span class=\"caps\">BOSCH</span> instrumentation. Injectors fire 3-4 times per power stroke.</p>\n\n\t<p>Another instance is Nissan <span class=\"caps\">URVAN</span> with <span class=\"caps\">ZD30DD</span> engine coupled with <span class=\"caps\">BOSCH VP44 </span>Electronic Fuel Pump. Even Gandhara Nissan dealers in Lahore donot have necessary tools to check electronic malfunctions of the said Fuel Injection Pump which costs 387k in <span class=\"caps\">PKR</span>.</p>\n\n\t<p>cause: contaminated fuel</p>\n\n\t<p>remedy: replace the pump at a cost of 387k <span class=\"caps\">PKR</span>. it is to be noted that the earlier pump developed a malfunction after completion less than 50,000 kms.</p>\n\n\t<p>I have also dealt in procurement of Lubricants for the construction fleet of <span class=\"caps\">SNGPL</span>. rule of thumb is to go for <span class=\"caps\">TBN 11</span>. but i was surprised to get offers from Haroon Oil, Master Oil, <span class=\"caps\">KENLUBES</span> for engine oils having <span class=\"caps\">TBN</span>’s and Vistocity Indeces averaging more than 11 and 130 respectively. they have all managed to get registeration / test certificates from <span class=\"caps\">HDIP</span> certifying that all of their products meet <span class=\"caps\">API CH</span>-4 classifications.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}
