{
  "post_id": 517,
  "comment_count": 24,
  "comments": [
    {
      "id": 1486,
      "author": "Adeel Bashir",
      "email": "el-nino-style@live.com",
      "date": "2011-08-08 03:33:01",
      "content": "Hello sir, \n          i saw you complete vdo, its been fantastic trip.im from karachi,we have a plan for hunt.3rd of september we are going to achieve that target. we hope will going toward a lot of fun. \n\nthank you sir\n\nADEEL",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1531,
      "author": "Kesrising M. Jadav",
      "email": "kesrisingjadav@yahoo.com",
      "date": "2011-09-19 14:36:42",
      "content": "Thank you sir.best imformation of my kuldevi Hinglajmaa .....very good................",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1541,
      "author": "Pilgrimage to Mata Hinglaj (Hingol), Balochistan [1 of 5] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2011-12-29 13:04:38",
      "content": "[...] note from Offroad Club of Karachi: A few years ago, longer than I’d like to think about now, we met Jay Shah, who had [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1542,
      "author": "Pilgrimage to Mata Hinglaj (Hingol), Balochistan [2 of 5] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2011-12-29 13:39:18",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1543,
      "author": "Pilgrimage to Mata Hinglaj (Hingol), Balochistan [3 of 5] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2011-12-29 14:43:55",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1544,
      "author": "Pilgrimage to Mata Hinglaj (Hingol), Balochistan [4 of 5] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2011-12-29 15:07:22",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1545,
      "author": "Pilgrimage to Mata Hinglaj (Hingol), Balochistan [5 of 5] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2011-12-29 15:21:55",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1546,
      "author": "I too want to go on Hinglaj Yatra [1 of 2] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2012-01-03 13:34:53",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1547,
      "author": "I too want to go on Hinglaj Yatra [2 of 2] &laquo; Wonders of Pakistan",
      "email": null,
      "date": "2012-01-03 13:38:31",
      "content": "[...] Source, Title Image [...]",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1572,
      "author": "Mahera Omar",
      "email": "mahera.omar@gmail.com",
      "date": "2013-01-14 13:25:30",
      "content": "http://wp.me/p1FTSu-dM\n\n A 360 degree view inside Hinglaj Mata in Baluchistan",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1576,
      "author": "ASHOK",
      "email": "cdpoaska@yahoo.in",
      "date": "2013-03-10 12:11:03",
      "content": "I WANT TO VISIT GODDESS HINGULAJ.I AM FROM INDIA.A GROUP OF MY FRIENDS ARE INTERESTED  TO VISIT THE HOLY PLACE.PL.GUIDE ALL ABOUT THE JOURNEY i,e. THE VISA,PASSPORT,TRAVELLING TIPS ETC.\n\n                                         THANK \"u\"",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1606,
      "author": "Prabhakar",
      "email": "patil_goa@yahoo.co.in",
      "date": "2013-06-06 21:29:41",
      "content": "I want to do Mata Hinagalaj Yatra......................",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1615,
      "author": "V.S.RAVI KIRAN",
      "email": "raki_s@rediffmail.com",
      "date": "2013-07-29 20:15:45",
      "content": "I am astounded 2 c the courtesy of Mr &amp; Mrs.Hameed and their team and all involved  towards humanity, hats off 2 them, may all religion gods shower happiness and many more on them and on their future generations 2 come by doing this kind of good deeds.I pray to all gods to give consciousness to the minds of political leaders and government of both the nations and I also urge 2 the people of India and Pakistan not 2 take serious about the interpretations, speaches and deeds of political leaders and media of both the countries.Try 2 maintain good relationship with humanity irrespective of caste, crede etc.,The mind, egoism and inner conscience of a person is the main culprit of what they have done in the past and doing now, resulting in negative ambience between both the countries.The people of both the countries are good but the environment created by the negative elements for their own gain purportedly led to this kind of situation.Now, what is it impossible to bring back the atmosphere, just like before 1947 and also I request the experts of software companies like google etc to identify and block the negative information about any kind of religion in the websites.I also urge to the people of this universe to respect and foresee in a positive way of every religion and their traditions.Never make a joke of any religion or other gods.Try 2 taste the sweetness of other religions.\n\"MAY GOD BLESS ALL\"",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1669,
      "author": "mita",
      "email": "shahmita900@gmail.com",
      "date": "2014-02-20 15:21:22",
      "content": "only by the grace of Guru and God almighty this kind of yatra is possible only for a person full of faith and total surrender to his Guru. Let us all try to have that quality .",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1980,
      "author": "Rehan Afzal",
      "email": "me@rehan.com.pk",
      "date": "2015-02-26 10:38:57",
      "content": "Please note that Lasbela, the District of Balochistan, where Hinglaj is located, is one of the most peaceful and safest places in Pakistan, with practically zero crime rate. \n\nThe Road to Hinglaj has now been recently upgraded and it hardly takes 2 hours after you leave Karachi. Karachi being a megapolis might take an hour or two to get out of !\n\nThat said, it is a beautiful and scenic area; the Buzzi Pass in the Hingol National Park is the Grand Canyon of Pakistan and the Hingol River offers great vistas.\n\nDo visit this place if you want an out-of-this-world experience.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 1981,
      "author": "Rehan Afzal",
      "email": "me@rehan.com.pk",
      "date": "2015-02-26 10:47:48",
      "content": "Please note that the Word Nani derives from Inana, the Mesopotamian goddess also known as Ishtar. \n\nThe cult of Inana was prevalent in Balochistan in prehistoric times, as can be seen by Nani being worshipped much North in the Bolan Pass and far away on the Balochistan seaboard.\n\nHowever it was suppressed by Durga and Mahadev over time but resurfaced after being duly Islamised sometime in the past couple of hundred years — perhaps even later for we do not hear of Nani in history. \n\nSurely if such a saintly woman had been known, she would have featured in the annals of the great Chakar Khan Rind or the Brahui rulers of Kalat who controlled these territories.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2008,
      "author": "apurba karmakar",
      "email": "apurba_1956@yahoo.com",
      "date": "2015-06-07 00:14:08",
      "content": "nice to know the travelogue on Marutirtha Hinglaj. Can you please help me to have a darshan of Her. It is my lifetime wish and prayer to see Her. Kindly send me details of how I can visit  Mata Hingalji to apurba_1956@yahoo.com. I will be ever thankful to you-apurba karmakar, kolkata, India.",
      "parent_id": 1980,
      "approved": true
    },
    {
      "id": 2011,
      "author": "Rehan Afzal",
      "email": "me@rehan.com.pk",
      "date": "2015-06-15 10:17:58",
      "content": "You need to get a Visa to visit Hinglaj. You would come to Karachi and then take a ride to Hinglaj. Please check on Google as there are services that help the Yatra. I am based in Islamabad, so can't really help you personally, though I would have loved to.",
      "parent_id": 2008,
      "approved": true
    },
    {
      "id": 2032,
      "author": "Parminder Singh Chahal",
      "email": "indiabroadband@gmail.com",
      "date": "2015-09-30 10:07:10",
      "content": "I always thought of Pakistan as being a big dump and nothing else. Your pictures have changed my perception and I would love to visit one day. You are also an excellent engaging writer, gifted to a great extent.\n\nIf Pakistani tight arse politicians made it any easier for us Indians to come to Pakistan for tourism then I am sure your country would see a massive influx of tourists who won't even have to spend a lot to get there as opposed to those coming from other countries that do not share a border. I must add that Indian middle class is growing by leaps and bounds with plenty of disposable incomes that have only gone up in recent times. Pakistan could have a piece of the cake as well but people there mostly seem to be interested only in religion and trying to make each other's lives difficult.\n\nI hope better sense prevails and both Indians and Pakistanis would one day be able to venture in each other countries with ease. It would be mutually beneficial. Right now Chinese chow mein seems to be the favorite dish of Pakistani Premier :) Hope he comes back to butter chicken one of these days... India has good butter chicken.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2050,
      "author": "Jay Shah",
      "email": "jayanu@gmail.com",
      "date": "2016-01-01 13:11:33",
      "content": "&gt;&gt; You are also an excellent engaging writer, gifted to a great extent.\nI wish it was true. IN reality I was a \"Nimmit - an instrument - the keyboard handler\" and my Guru Pujya Annaji was writing this. \n\nOn the first day of the new year 2016, we all should collectively pray for the two countries to come closer and remove hostilities, channel the funds in mutual growth and good will and become a SE powerhouse in the world. Anything is possible with Faith as this article shows. Collective Faith is far more powerful.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2077,
      "author": "Anil Kumar Jagdhari",
      "email": "akjagdhari@yahoo.com",
      "date": "2016-05-10 00:20:30",
      "content": "Wonderful lucid writeup. I did darshan from my computer chair.I echo Mita's comment dated February 20, 2014 that only by the grace of Guru and God almighty this kind of yatra is possible only for a person full of faith and total surrender to his Guru. Let us all try to have that quality. Well said Mita. Thanks Jay.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2104,
      "author": "Pranay Pathak",
      "email": "pranaypathak4@gmail.com",
      "date": "2016-08-08 12:23:02",
      "content": "What a great informative article about the sacred shrine. Really Jay sir without Guru no person is complete and the Omar's and rest all the beautiful people u got along ur trip. So lucky u. Soon I'm planning this pilgrimage but I was also misguided by many people for going here. But this article has helped a lot for reaching here.",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2191,
      "author": "Sweta Shah",
      "email": "swetashah10@gmail.com",
      "date": "2017-03-21 09:34:03",
      "content": "Very well written and apt article uncle :) Seriously, thank you for penning this down for us all to have Darshan and feel the experience from our homes. I feel blessed..!",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2224,
      "author": "Muhammad Bashir Osman",
      "email": "bashir.uxman@yahoo.com",
      "date": "2018-05-07 19:04:19",
      "content": "Dear Mr. Shah,\n\nI do endorse and favor all those thoughts that you have opined about betterment of relations between our two countries.  \n\nTravel to Hingol Temple have become more convenient what it was before and I understand that you will feel more cozy and being in your own people when you visit to we Pakistanis.\n\nRegards, \nBashir Osman",
      "parent_id": 2050,
      "approved": true
    }
  ]
}