{
  "post_id": 24,
  "comment_count": 6,
  "comments": [
    {
      "id": 263,
      "author": "Amir hussain",
      "email": "hkaamir@yahoo.com",
      "date": "2004-08-12 10:34:38",
      "content": "<p>Nice reading about your Ziarat trip. Soon gonna make it myself Insha Allah, alas only by bus. Nice website <span class=\"caps\">BTW</span>.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 264,
      "author": "Benjamin Loveday",
      "email": "onehungadocs@yahoo.co.nz",
      "date": "2004-10-24 06:11:56",
      "content": "<p>It was wonderful reading about your journey from Karachi to Ziarat.  My family used to holiday in Ziarat every year for several years (we lived in Karachi).  We usually took the train from Karachi to Quetta, and then bus to Ziarat.  One year we drove our long wheel base Landrover (with Nissan engine) up instead.   What a journey, driving through the 55 degree heat in mid June! At the end of our holiday we had to drive through the night to get back to Karachi for the funeral of a friend of ours.   One day I will return to Pakistan, and hopefully make it back to Ziarat.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 265,
      "author": "Shenaz Bano",
      "email": "sheraz-bano@ind.homeoffice.gsi.gov.uk",
      "date": "2005-01-22 18:47:08",
      "content": "<p>I am based in London & travelled to Pakistan several times but never been to Quetta/Ziatat. After reading about your Journey i am tempted to got whenever i am in Pakistan next.It’s nice to read positive comments. A lot of people who have never been to Pakistan make negative comments they don’t know what a beautiful country it is.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 266,
      "author": "Naveed Akhtar",
      "email": "naveed_fm@hotmail.com",
      "date": "2006-08-23 16:41:01",
      "content": "<p>Nissan Vehicle are very fine nissan is friend of transporter & driver</p>\n\n\t<p>Iwant to Manule books nissan heavy vehicle <span class=\"caps\">PLZ</span> send me</p>\n\n\t<p>Best regards</p>\n\n\t<p>Naveed Akhtar</p>\n\n\t<p>Parco Gate No 1 Qasba gujrat</p>\n\n\t<p>Distt Muzafar Garh</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 267,
      "author": "Zahid Shafiq",
      "email": "zshafiq@mba1982.hbs.edu",
      "date": "2007-07-17 11:38:08",
      "content": "<p>Excellently evocative article. I am contemplating a drive from Karachi to Quetta, but no absolutely nothing abt the road, about cars, about where to go and what to do. Since you are also from Karachi, I would very much appreciate yr contacting me by email, so that we may exchange notes on this.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 2001,
      "author": "Rashid Javed hashmi",
      "email": "rashid@yongesteelesfordlincoln.com",
      "date": "2015-04-28 23:32:21",
      "content": "Dr.Mansur Ahmad,you are an amazing gentleman and quite a inspiration to me.You and fellow travellers have got my attention for a while now.I love reading about your travels and so tempted to come and join you.Happy Travels.rashid",
      "parent_id": 0,
      "approved": true
    }
  ]
}