{
  "post_id": 17,
  "comment_count": 10,
  "comments": [
    {
      "id": 202,
      "author": "Khawaja Mohammad Ali",
      "email": "malikhawaja@hotmail.com",
      "date": "2003-10-10 12:17:26",
      "content": "\t<p>Dear Salman Ali:</p>\n\n\t<p>Read all whatever you wrote. It was quite impressive, specially the last change of the ownership&#8230;.was difficult for the poor guy to decide the lesser evil of the two.</p>\n\n\t<p>May Allah be with you always.</p>\n\n\t<p>tak&#8230;cheeesh&#8230;..cheeray&#8230;..</p>\n\n\t<p>Rgds</p>\n\n\t<p>Khawaja Mohammad Ali</p>\n\n\t<p>Cell: 0333-2104291</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 203,
      "author": "Taimur Mirza",
      "email": "tmirza@fascom.com",
      "date": "2003-10-11 15:59:30",
      "content": "\t<p>Salman the custom built bumper is there but the 8274 is missing?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 204,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2003-10-11 17:17:49",
      "content": "\t<p>The top half of the winch had fallen off halfway into the trip. If you look closely you can see the spool is still there. I think Salman had forgotten to tighten the bolts clockwise, coupled with one of those pesky boulders hidden behind smaller rocks.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 205,
      "author": "Imad",
      "email": "ewqd@pier.com",
      "date": "2003-10-13 02:23:35",
      "content": "\t<p>You are all wrong. I removed the winch for this trip because the Jeep was already reeling from severe cooling system problems (long story here, deserves its own page), and having that huge winch blocking the grill and radiator wasn&#8217;t exactly helping the problem. Nearly all the other vehicles were already equipped with a winch and I deemed it unnecessary to lug it along all the way to Ziarat.</p>\n\n\t<p>KO, the top half of the winch came undone 2 years before the Ziarat trip while on the way to Khunjerab. The gearbox just flopped open and it magically stopped rattling. Since the winch always rattles, I knew something wasn&#8217;t right and I think you also told us right then that the winch was about to spill its guts all over the countryside. Amazingly enough, no gears fell out; we even recovered all the bolts that fell off the housing.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 206,
      "author": "J.G.",
      "email": "atbolt@hotmail.com",
      "date": "2003-12-13 23:18:04",
      "content": "\t<p>Salman,  I&#8217;m very sorry to hear about your serious accident in your jeep.  My prayers go out to the deceased&#8212;including your hawk.  Let me know if there is anything I can do.</p>\n\n\t<p>JG</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 207,
      "author": "nadeem",
      "email": "karachi_momo@yahoo.com",
      "date": "2006-04-21 17:13:45",
      "content": "\t<p>salman sahab ap sa falconry ka bara ma malomat karni ha batha ya kasa momkin ha</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 208,
      "author": "Shahnawaz Khan",
      "email": "shanidon@gmail.com",
      "date": "2007-02-20 21:10:48",
      "content": "\t<p>bro can u help me with makeing a website like this one. i promised my boyz i wud make one but now need ur help. call me.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 209,
      "author": "Asfar Ajaz",
      "email": "oneasbt@hotmail.com",
      "date": "2007-07-11 13:43:24",
      "content": "\t<p>Salman u r the best teacher in the shape of a friend and a brother, i wish u best wishes and sucess in ur life and all the happiness to you and your family.</p>\n\n\t<p>asfar</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 210,
      "author": "Vinay Khatri",
      "email": "ask2vinay@gmail.com",
      "date": "2007-11-06 20:25:35",
      "content": "\t<p>You all are adventur persons. I must appreciate your efforts for making the trips and documenting it on internet.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 211,
      "author": "j s pande",
      "email": "jspande74@yahoo.com",
      "date": "2010-03-16 12:43:04",
      "content": "\t<p>pl tell me if the toyota dyna 5 speed gearbox always has provision for attaching a 4&#215;4 transfer case?does it have a plate for the purpose? am thinking of matching it with a toyota land cruiser 2.8 litre tranfser case . the vehicle has a 4 litre 4 cylinder hino diesel engine.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}