{
  "post_id": 37,
  "comment_count": 12,
  "comments": [
    {
      "id": 462,
      "author": "Harpreet Shergill",
      "email": "autoassign@yahoo.com",
      "date": "2005-11-05 15:17:21",
      "content": "<p>I love to see this effort with wooden material and pumpset engine. Those were golden days when nobody cared for what is on the road. But nowadays, you do a little tinkering with your vehicle and you land up with the traffic police net and virtually getting the vehicle impounded for violating Motor vehicle acts. However, Still We do get into such improvisations at my farm in Western U.P. where traffic Police is still comfortable with Jugaroo or Petter rehra etc ferrying foodgrains and cattle ( Jeep Chassis with a petter engine and wooden body ). We made a small cart with Bajaj 150 cc petrol engine/ wheels and Angle chassis made by our small time welder. The cart is effecetively utilised for ferrying pumpsets, Fertilizers, seeds and other farm inputs. Subcontinental Govts. must allow rural areas to come up with such simple and cheap machinaries. This would eventually lift the engineering standards and skills of these areas.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 463,
      "author": "AbbasJin",
      "email": "jinkazama4u@hotmail.com",
      "date": "2005-11-10 17:39:00",
      "content": "<p>Nice effort, I guess the designer was quite ahead of his time back then, since most of us cant think of building anything like this even today. Well done.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 464,
      "author": "Anis.Khan",
      "email": "anis.ali.khan@gmail.com",
      "date": "2005-11-15 19:54:51",
      "content": "<p>That’s amazing to see! Definitely a piece of Karachi history! What became of the original? It would be fun to refurbish it and have a historic moto gp! On another note, I agree with the one of the previous comments, that grassroots efforts drive true innovation, we see it all throughout history : )</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 465,
      "author": "Fahad",
      "email": "koolage_guy@hotmail.com",
      "date": "2006-10-23 09:14:59",
      "content": "<p>your bike is koool ! i Love it …….</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 466,
      "author": "Fahad",
      "email": "koolage_guy@hotmail.com",
      "date": "2006-10-23 09:17:50",
      "content": "<p>hi again .. can you plz tell me how’d connected the engine with the rear wheel . i mean abt the drive train you made</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 467,
      "author": "Hamid Omar",
      "email": "Omars@cyber.net.pk",
      "date": "2006-10-24 04:56:32",
      "content": "<p>The motorcycle was made from a plan published in the “Popular Mechanics” in the nineteen sixtees! It was inspired from that and the fact that fact that I had the “pump” engine! The wooden based motor cycle was made in Lahore – not Karachi – the the litttle red car (also posted on the website) was also made in Lahore – which was used by me in Karachi for two years (while I was studyind at <span class=\"caps\">IBA</span> for my <span class=\"caps\">MBA</span>)!</p>\n\n\t<p>As in most of the motor cycles – the engine was connected to the rear drive wheel by a steel chain. The engine had a centrifugal driven clutch but no gear box! It reached a speed of about 30MPH!</p>\n\n\t<p>After some months, I used the engine of the motorcycle to build the little red car – that was the end of the motor byke!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 468,
      "author": "naveen",
      "email": "naveenrashid@gmail.com",
      "date": "2007-02-07 07:58:43",
      "content": "<p>oohhhhh <img src=\"!\" alt=\"\" border=\"0\" /></p>\n\n\t<p>awsome …ummm.. awsome …ummm <strong>history</strong>!!</p>\n\n\t<p>cool !! <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 469,
      "author": "naveen",
      "email": "naveenrashid@gmail.com",
      "date": "2007-02-07 07:59:48",
      "content": "<p>oohhhhh <img src=\"!\" alt=\"\" border=\"0\" /></p>\n\n\t<p>awsome …ummm.. awsome …ummm <strong>history</strong>!!</p>\n\n\t<p>cool !! <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 470,
      "author": "Basharat Ali",
      "email": "kohinoorpumps@yahoo.com",
      "date": "2007-07-12 22:52:13",
      "content": "<p>We must appreciate. A nice and creative effort.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 471,
      "author": "Waqar Ahmed",
      "email": "waqar@yahoo.com",
      "date": "2008-09-03 12:19:21",
      "content": "<p><span class=\"caps\">WOW</span>…. does this Bike Still Exist… thats marvellous…looks cool in the pic shown above!!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 472,
      "author": "Nadeem",
      "email": "notarar@gmail.com",
      "date": "2008-12-13 13:25:47",
      "content": "<p>I am happy to see the technical innovation being documented and appreciated . I would like to know more about hybrid vehicles in Indian Punjab, where such vehicles seem to have come up first. Please do share some more information on the subject.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 473,
      "author": "kpsenthil nathan",
      "email": "kpsenthilnathan@yahoo.com",
      "date": "2009-07-14 12:24:48",
      "content": "<p>i wish to my pakisthan brothers and sisters and friends. mr haied omar  was a great  person. he got a lot grace from the lord. byke is very smart .</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}