{
  "post_id": 13,
  "comment_count": 123,
  "comments": [
    {
      "id": 40,
      "author": "Imad",
      "email": "ewdgui@ugfw.com",
      "date": "2003-10-08 07:29:46",
      "content": "<p>Actually, there is no documented record of anyone shoehorning a <span class=\"caps\">V12</span> in a CJ-7. The biggest engine I have read about in a CJ-7 is a 454 <span class=\"caps\">CID</span> big block chevy. Some people have been known to install 500hp 488 <span class=\"caps\">CID </span>Dodge Viper <span class=\"caps\">V10</span> engines in their Wranglers. However, as far as <span class=\"caps\">V12</span> engines are concerned, Detroit doesn’t have a <span class=\"caps\">V12</span>, even in their cars running at Indy, although Cadillac has developed a <span class=\"caps\">V16</span>!! Only big name exotics such as Ferrari, Lamborghini and Jaguar manufacture <span class=\"caps\">V12</span> engines. While the cost of the first two is prohibitive, Mopar fans would rather commit suicide before dropping in an engine out of a Ford owned company. Besides, big block chevies are second only to Dodge’s monster <span class=\"caps\">V10</span> as far as stock power output is concerned. With only a few modifications, the chevy can easily surpass the <span class=\"caps\">V10</span> in terms of power output, reliability, and cost effectiveness. It’s also a smaller package with less bells and whistles to worry about.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 41,
      "author": "Imad",
      "email": "ewdgui@ugfw.com",
      "date": "2003-10-08 07:33:58",
      "content": "<p>Also, I forgot to mention, the big block chevy is a V8. <span class=\"caps\">A 502 CID </span>Ramjet big block ready to go with <span class=\"caps\">ECM</span> and wiring harness, basically everything, costs under $8000, while the Viper’s <span class=\"caps\">V10</span> costs $30,000<img src=\"!\" alt=\"\" border=\"0\" /></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 42,
      "author": "Imad",
      "email": "ewdgui@ugfw.com",
      "date": "2003-10-09 02:32:45",
      "content": "<p>In the last few years, it is the Grand Cherokee, not the Cherokee, which has taken top honours at 4×4 of The Year. The Grand Cherokee bests the Cherokee’s weight marginally due to its slightly larger dimensions but it has a far superior suspension and available 5.3 litre V8 option. Combined with the abundance of amenities on the interior, these features helped the Grand Cherokee claim first place. Also, the Grand Cherokee is so superior to the rest of the competition that with the Cherokee no longer in production, second place at 4×4 of The Year will be a very distant second place indeed.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 43,
      "author": "Lalajee",
      "email": "lalajee@yahoo.com",
      "date": "2003-10-10 15:00:33",
      "content": "<p>Imad baeta, yeh amrica ka khaya piya bol ria hae, haqeqat yeh hae ke yahan par petrol ka char cylinder dunya ka sab se behtar anjan hota hae, uske baad deisel ka anjan, samajh gaye.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 44,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2003-10-10 17:06:31",
      "content": "<p>There are almost no Grand Cherokee’s in Pakistan, hence their absence on the list. And all this talk of V-8’s and mopars and chevy’s and <span class=\"caps\">CID</span>’s is just not cricket. Powerful here means turbo-diesel 1KZ-TE.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 45,
      "author": "Imad",
      "email": "dyg@pijwerf.com",
      "date": "2003-10-10 22:28:59",
      "content": "<p>Hehe, funny… I was merely setting some facts straight, and I’ll say it again… show me a CJ-7 with a <span class=\"caps\">V12</span> and I’ll show you a monkey with five a…. Of course, thanks to our govt’s screwed up policies, smoke belching, lung clogging diesels are the way to go.</p>\n\n\t<p>Yes KO, I know there are only a handful of Grand Cherokees in Pakistan. However, that doesn’t mean they don’t exist.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 46,
      "author": "asaboor",
      "email": "abdsaboor@yahoo.com",
      "date": "2003-10-13 00:07:35",
      "content": "<p>Quite interesting and informative</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 47,
      "author": "Jason Critides",
      "email": "jcritides@hotmail.com",
      "date": "2003-10-20 04:53:23",
      "content": "<p>Hello.</p>\n\n\t<p>I was looking through your site, and find it very interesting.</p>\n\n\t<p>I myself live on the Isthmus of Panama, where it is mostly tropical jungle and savannah.  I happen to drive an <span class=\"caps\">M151A2</span>.  In these parts the <span class=\"caps\">M151</span> is considered the best off-road vehicle, superior to the CJs, wranglers, and japanese type jeeps.  In the mud the <span class=\"caps\">M151</span> goes places the others can’t.  I can’t say for sure about comparisons with the m38a1, since we don’t have any that I know of down here.(they look an awful lot like the CJs, so I would think it a better jungle offroad performer) I’m wondering if your assement of offroad capacity is based on the terrain in your area? I’m assuming arid and rocky.  As to rollover problems – these happened not in the bush, but on the street – turning the vehicle too sharply at too much speed.  I find my m151a2 far more stable than say my toyota hilux 4Wd truck</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 48,
      "author": "Imad",
      "email": "ewdgui@ugfw.com",
      "date": "2003-10-22 07:30:32",
      "content": "<p>If I am not mistaken, the <span class=\"caps\">M151A2</span> replaced the <span class=\"caps\">M151A1</span>. The suspension was redesigned (lower A-arms changed to pivot front to back) to prevent rollover accidents that were claiming more lives than the frontlines. The original <span class=\"caps\">M151</span> was deadly in any kind of highspeed turn, whether on the trail or on the road. Off-camber situations further increased its tendency to flop over. In fact, the History Channel covered all incarnations of military Jeeps on Modern Marvels, in which they showed how the <span class=\"caps\">M151</span>’s lower A-arms folded up under the vehicle when the suspension was unloaded on one side in a highspeed turn. The redesigned vehicle proved to be a far better performer and the US military stuck with it until the inception of the Humvee in the 1980s, while other armies in the world are still using it to this day. It is interesting to note that although these vehicles are somewhat abundant in most of the world, there are virtually none in operable condition in America. The Dept of Transport deemed them unsafe for civilian use, so the Dept of Defense either salvaged surplus vehicles for spares, or destroyed the rear suspension before selling them off as scrap. Once again, one man’s trash becomes another man’s treasure :^).</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 49,
      "author": "Saad",
      "email": "slqureshi@hotmail.com",
      "date": "2003-10-22 10:08:02",
      "content": "<p>Very interesting comparison.</p>\n\n\t<p>Wondering, why Land Rover and Range Rovers not included. Not that I own one, but there are many around, atleast more than Unimogs.</p>\n\n\t<p>Also a new player in the field is <span class=\"caps\">M715</span>, being resently auctioned by army. Have seen one?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 50,
      "author": "Imad",
      "email": "ewdgui@ugfw.com",
      "date": "2003-10-24 06:37:15",
      "content": "<p>Being a 1 1/4 ton pickup, the <span class=\"caps\">M715</span> faces the same problem as the Dodge Power Wagon – the original petrol engine is a real gas guzzler and there in no appropriate diesel replacement for these behemoths. The Power Wagons I’m referring to are the later models originally purchased for the 1971 war and then put away in storage afterwards. These trucks enjoyed a brief period of popularity when the military auctioned them off. They became quite popular as commercial vehicles, with people swapping out the original 7.4 litre V8 and 3-speed auto transmission for a Toyota 3B engine and 5 speed Coaster gearbox. This combination works fine in commercial use where you just want to get from point A to point B with least amount of money. This doesn’t apply to offroading for pleasure. Truth be told, the 3B’s 93hp doesn’t have a chance of moving a 1 1/4 ton pickup as quickly as we would like. A good power to weight ratio is the key off the road. Precisely, more is better. Granted, the 3B powered Coasters that did 120kmh on the highway, but it also took them nearly forever to hit that speed, not to mention the engine is running at redline at that speed with the Coaster’s <span class=\"caps\">LOW</span> gearing. So the moral of the story is that while one might see the occasional <span class=\"caps\">M715</span> or Power Wagon on the trail, it’ll take a reasonably priced but powerful diesel to really make them popular. For a better explanation, refer to my article on engine selection in the tech section. I for one would love to build up an <span class=\"caps\">M715 </span>- there’s something visceral and brutal about those trucks.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 51,
      "author": "Saad",
      "email": "slqureshi@hotmail.com",
      "date": "2003-11-05 13:57:20",
      "content": "<p>You are right about low powered diesels <span class=\"caps\">M715</span>. A friend of mine has a Toyota 3L fitted in his <span class=\"caps\">M715</span>. Even on road it seems underpowered. Someone advised to put in it a Mazda 3.5 litre from Mazda truck.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 52,
      "author": "Haris Zuberi",
      "email": "haris_saad@hotmail.com",
      "date": "2004-01-07 01:02:47",
      "content": "<p>Hi! I just came across this site and was extremely delighted to know there are online jeep lovers out there in karachi. I’m madly in love with the Willys <span class=\"caps\">MB 1942</span>-44 and have done extensive research on the legend during the past few months. It’s absolutely great to know i might be able to get some information from experts here. Since i have no idea about the markets in karachi, i’ve been wondering what the chances are to get hold of a Willys <span class=\"caps\">MB 1942</span>-44 in good condition and how much it would cost? you mentioned in the Willys analysis about some mechanic “Daud” from Lyari. Is he a specialist? and would it be possible to contact him to buy a Willys from him?</p>\n\n\t<p>I hope you’d have ansewrs to my questions.</p>\n\n\t<p>Thanks!</p>\n\n\t<p>Haris Zuberi.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 53,
      "author": "simon",
      "email": "rubberduck_801@hotmail.com",
      "date": "2004-01-12 03:13:19",
      "content": "<p>nice to see that the pakistani 4×4 brotherhood is alive and kickin’. I live in nova scotia canada and we use a lot of bronco 2’s to offroad with . There’s no mention at all of this handy little trail bruiser in your site. Aren’t they available in Pakistan or do they just suck for the local conditions?Mail me back . p.s. its snowing outside right now and i’m off to do some donuts in the local shopping mall parking lot.!!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 54,
      "author": "simon",
      "email": "rubberduck_801@hotmail.com",
      "date": "2004-01-13 06:14:59",
      "content": "<p>this is my second posting as I have had a chance to go over your site a little more extensively….wow… the scenery in Pakistan is absolutely breath-taking!! I just hope that I’ll someday have chance to visit/4×4 in person. Also, I am extremely impressed by your ingenuity and the level of your expertise under what appear to be some very trying conditions (sourcing parts, the petrol/diesel problem, the physical environment, etc). Keep up the good work!! Also my email address is rubberduck_801@hotmail.com I would welcome any communication in order to learn more about Pakistan and 4×4ing there. Ican reciprocate with info from Canada. Again, your site kicks ass!!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 55,
      "author": "Major Baleegh Ur Rehman",
      "email": "syedbaleegh@yahoo.com",
      "date": "2004-01-19 05:04:26",
      "content": "<p>Well different people have different ideas, but as regard my case is concerned, i must say that Toyota Land Cruiser 1999 model, 4×4, 4.2 liters diesel engine is the best off road vehicle yet any company has made so far. I have driven for more than 60,000 kms in the vast and arid desert of Human-e-Mashkel, Nokkundi, Taftan and all on the off road, for almost more than a year , and i must say that, its the best off road vehicle ever built. Further more i have the experience of travelling in the mountains as well as in the river basins, its ground clearence is perfect and its engine power and torque are just be the best. On my tenure of more than a year, in Mashkel, I tell you that at many occassions I encountered the norcotics smugglers and they all prefer and use the same Toyota Land Cruiser 4500 <span class=\"caps\">EFI</span>, petrol engine for their smugglings. Well they have the resources in millions, but as regard i am concerned as iI was posted as Wing Commander 84 Wing in Mashkel and we were alloated these diesel Land Cruisers by the <span class=\"caps\">HQ FC </span>Balochistan, as they have the capability to match up with the petrol ones in Mashkel and its surroundings, as for me if some one ask, the best off road vehicle in Pakistan is Toyota Land Cruiser 1999, model. Thats why in Pakistan Army 90% of jeeps are of the same vintage.</p>\n\n\t<p>Major Baleegh Ur Rehman AO, TC, Loralai.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 56,
      "author": "Niaz Khan",
      "email": "fnk2727@hotmail.com",
      "date": "2004-02-20 14:59:39",
      "content": "<p>Hi guys, it was great experience to visit this site and very exiting one too. I had a Toyota Landcruiser some years ago. Am great lover of offroaders. As in article above the Willys MB is a true legend. Want ot have one, can anybody inform me about the source – as mentioned above in the article – Pak Army is disposing off these vehicles – can I have the source information – where/whome should one contact for participating in these auctions – and about private markets/people dealing in these types of supplies spcially in Karachi as also mentioned in the article about some mechanic “Daud” from Lyari. How can one contact him on phone / his postal address. What is the price range.I hope that some friend will reply to my quries. I am also interested in having CJ or Jeep Vagoneer. Please do reply on fnk2727@hotmail.com. Thanks.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 57,
      "author": "Aslam Najef",
      "email": "najefaslam@hotmail.com",
      "date": "2004-03-15 22:27:36",
      "content": "<p>Hi.</p>\n\n\t<p>Seen lot of good condition “kekra” in kashmir’s hilly terian rather in good condition.They are splendid.A chinese miltry model also can be seen around.</p>\n\n\t<p>I am looking for real original and in nice condition “Wllly” if someone there can help me out and contact me on my E-mail</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 58,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2004-03-17 09:33:42",
      "content": "<p>There are a number of orignal <span class=\"caps\">M38</span>’s for sale at Ghani Mills.. someone bought 130 from an army auction and I think 50 odd are still left.</p>\n\n\t<p>For directions – Its somewhere on the outskirts of Karachi – will have to find out.</p>\n\n\t<p>I do not think there is any willys/m38 in nice condition for sale though – they all need serious work. Chinese Jeeps are being manufactured in Pakistan now. The less said about them the better.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 59,
      "author": "Pal Negyesi",
      "email": "npaul@hu.inter.net",
      "date": "2004-04-19 21:11:24",
      "content": "<p>Hi!</p>\n\n\t<p>Does anyone have the contact address, ph and fax number of Adam Motor Co, maker of the Zabardast Jeep?</p>\n\n\t<p>Also Land Rover supplied 456 Defender kits to Pakistan in 2003. I take these were all army use. Am I right?</p>\n\n\t<p>Regards,</p>\n\n\t<p>Pal</p>\n\n\t<p>Editor, Autoindex</p>\n\n\t<p>www.autoindex.org</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 60,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2004-04-20 15:07:09",
      "content": "<p>Landrover here has said they have supplied approx 500 Pakistani assembled landrovers to the army so far. They have a long term contract to supply assembled landrovers to the army, so they have imported more kits. They also plan to start assembling Defenders for civilian use in the near future. I’ll email you the contact details for Adam Motor Co.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 61,
      "author": "George Avramidis",
      "email": "gaa@panafonet.gr",
      "date": "2004-05-08 20:16:33",
      "content": "<p>Interested on Jeeps, I collect sales literature of them. Have material on <span class=\"caps\">POTOHAR</span>, GHINZHAL, <span class=\"caps\">NAYA DAUR</span>. I look for any literature or info on <span class=\"caps\">NISPAK</span> 4×4 as built in Pakistan years ago and the address of the importer of Chinese Jeeps sold as <span class=\"caps\">ADAM ZABARDAST</span>.</p>\n\n\t<p>Can anybody assist. I prefare a direct e-mail at : gaa@panafonet.gr</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 62,
      "author": "Salman",
      "email": "yamaha_rd350@hotmail.com",
      "date": "2004-07-08 16:06:57",
      "content": "<p>I was thinkin about gettin a <span class=\"caps\">M151</span>-A2.  I want to keep it as original as possible. Therefore it will remain as left hand drive, with original drive train and rims etc.  But we all know that an un-efficient 2.4 Detriot Gasoline engine is hardly affordable in Pakistan.  I plan on experimenting with a Toyota 3C (2.2 turbo-D) engine mated to the original <span class=\"caps\">M151</span> grear box. I understand I will need a gizmo (gadget) to drop the diesel engine’s idle 1,100 rpms down to a petrol engines idle of 850 rpm before i can shift into first gear.  other then that the engine may work.  Guys, please provide your comments/ advice.</p>\n\n\t<p>Thanks,</p>\n\n\t<p>Salman</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 63,
      "author": "J. Umer",
      "email": "Jawedu@magic.net.pk",
      "date": "2004-07-10 12:30:06",
      "content": "<p>I like your comments about various 4×4 s I own a 2003 Toyota 3 litre with the new common rail <span class=\"caps\">D4D</span> engine.</p>\n\n\t<p>I find it very comfortable and you have to travel/hunt in the northern punjab in the rainy seasons to find the mud and slush on the banks of river chenab and ravi, My Hi lux  is automatic but it never gets stuck unless I fail to engage the 4×4 in time.</p>\n\n\t<p>I have over 35 years of off roading in jeeps of saveral types but I have never been in a more comfortable and responsive vehicle.</p>\n\n\t<p>Best regards</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 64,
      "author": "bikram singh sandhu",
      "email": "brutus_marcus@yahoo.com",
      "date": "2004-08-04 16:10:23",
      "content": "<p>Hi guys,</p>\n\n\t<p>I am bikram from India.Since the teis between our countries are becoming stronger day by day,I would also like to extend a hand of friendship to you.I had been thinking that since the pakistan army had been using american jeeps.I am really a fan of the <span class=\"caps\">M38</span>-A1 and the <span class=\"caps\">M151</span>-A2.The indian army is using the <span class=\"caps\">M606</span> aka the willys cj3b and the unbeatably nissan jonga aka the 1952 <span class=\"caps\">NISSAN</span> <acronym title=\"it has a 4 l 6 cyl petrol motor 3 speed ,for more information go to NissanPatrolClubAlbuquerque.com\">PATROL</acronym>. If any one of you guys would be kind enough to enchange one of these jeeps in desposol army condition(but with full parts) with the same condition nissan jonga or the m606,please let me know.We could drive down to the wagah border in amritsar and enchange the jeeps.If anyone of you is seriously interested please e-mail me.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 65,
      "author": "Saad",
      "email": "slqureshi@hotmail.com",
      "date": "2004-08-05 12:34:32",
      "content": "<p>Hi Bikram,</p>\n\n\t<p>Welcome on board.</p>\n\n\t<p>I am afraid that this kind of exchange may not be possible without import/export permissions in both countries.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 66,
      "author": "kamran",
      "email": "KAMRAN1924@YAHOO.COM",
      "date": "2004-08-17 20:01:52",
      "content": "<p>please tell me that land rover defender for pakistan army will be pakistan assembled only or pakistan army may import assemble vehical direct from uk</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 67,
      "author": "kamran",
      "email": "kamran1924@yahoo.com",
      "date": "2004-09-12 09:35:16",
      "content": "<p>does any body know about how much pakistan army got land rover defenders from uk in 2004.and whether pakistan is assembling from ckd kits.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 68,
      "author": "stefan slomczynski",
      "email": "consultants@ssengineer.fsnet.co.uk",
      "date": "2004-09-19 15:52:12",
      "content": "<p>Can anyone Help? I am looking to buy 3xjeeps <span class=\"caps\">M38</span> 0r <span class=\"caps\">M38A1</span>,to ship to England for a project,they need to be in reasonable condition ,needing light retoration etc.[Prefer just released from Army condition]. Does anyone have Ghani Mills tel/fax no? Or any other details of other dealers,or indeed info on wether the Army is still selling these older jeeps.  Thanks. Stefan slom. England.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 69,
      "author": "naseer",
      "email": "nasseer2002@yahoo.com",
      "date": "2004-09-20 18:17:58",
      "content": "<p>salaaams to everyone from the UK, which is my home nowadays.</p>\n\n\t<p>Very nice to see some 4×4 activity in Pakistan. i live near jhelum and dina in Punjab. I am interested in buying <span class=\"caps\">M38A1</span> or similar jeep (diesel if possible) can anyone point me in the right direction.</p>\n\n\t<p>Is there any enthusiasts near dina?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 70,
      "author": "Azmat Hayat",
      "email": "admirer_666@yahoo.co.uk",
      "date": "2004-09-25 19:12:08",
      "content": "<p>Hello Friends,</p>\n\n\t<p>I visited a closed Steel Re-rolling mill (INSAFF <span class=\"caps\">STEEL MILL </span>- If I’m not forgetting it’s name)near Rawat, just 3-4kms ahead on the left of where Islamabad Highway joins G.T Road. There were about 50-60 <span class=\"caps\">M38 A1</span>’s in good condition. Needed little denting and were being sold for Pk Rs 85,000/- a piece. Don’t have any clue if they are still available or not.</p>\n\n\t<p>Best Regards,</p>\n\n\t<p>Azmat Hayat.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 71,
      "author": "stefan slomczynski",
      "email": "consultants@ssengineer.fsnet.co.uk",
      "date": "2004-09-28 01:33:38",
      "content": "<p>Thanks to all people who have replyed to me.I am interested in M38jeeps only,[not <span class=\"caps\">M38A1</span> sorry- i made a mistake]And only in quantity of 3 or more,best from a dealer i guess,or straight from the Army if possible? anyone have any ideas?</p>\n\n\t<p>Stefan,England.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 72,
      "author": "Omer Khalid",
      "email": "khautos@cyber.net.pk",
      "date": "2004-11-18 00:09:09",
      "content": "<p>slaam . I am a <span class=\"caps\">LAND ROVER</span> enthusiast without out owning the jeep : )though looking for one high and low. The reason i am an enthusiast is cause we have been importing <span class=\"caps\">LAND ROVER SPARE PARTS</span> from UK for the past 25 plus years and are agents of the largest maunfacturer of <span class=\"caps\">LAND ROVER</span> parts in the world.</p>\n\n\t<p>Came across this site and found not much on Land Rover it was suprising as LAnd Rovers are cosidered a top of the line off roaders. But i guess as mentioned in the article on this site   ” <span class=\"caps\">LAND ROVER DEFENDER</span>”  that not many are seen in action off road in Pakistan . I guess in Pakistan the Arab Shaikhs are doing all the serious off roading on <span class=\"caps\">DEFENDERS</span>.</p>\n\n\t<p>The reason for seeing so mant detoriated Rovers in pakistan is there high cost of maintanence.The parts are expensive compared to other jeeps and the mechanics are not available and they end up having loads of <acronym title=\" make do\">JUGARS</acronym>.</p>\n\n\t<p>I believe that Rovers pretty soon or going to make a show in Pakistan soon as now they are being manufactured here .  But the information we have is that the ckd kit imported are not UK origin but some 3rd country  that is yet to be confirmed. if any one know has any info about it please do inform me it would be appreciated.</p>\n\n\t<p>The first 5000 <span class=\"caps\">LAND ROVER DRFENDERS</span> the pakistan army recieved are definatly of UK origin . These defenders were originaly made for <span class=\"caps\">USA</span> but were diverted to Pakistan.</p>\n\n\t<p>If any one needs to find out anything about <span class=\"caps\">LAND ROVER</span> please feel free o contact me .  Would be very happy to be of any help .</p>\n\n\t<p>Omer Khalid</p>\n\n\t<p>email:shkomer@hotmail.comCell No:  0303-6230690</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 73,
      "author": "fahim",
      "email": "fahim@go4i.com",
      "date": "2004-11-22 18:55:50",
      "content": "<p>you have forgot to mention that pajero is now available with a proper 3s dealership.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 74,
      "author": "jn",
      "email": "itsallgood929@hotmail.com",
      "date": "2004-11-22 19:49:57",
      "content": "<p>hi, i’m doing some research into pre-partition india circa 1943. what would have been the most likely type of jeep used by a middle-class family living in or near a hill station.  Would the <span class=\"caps\">M38</span>/Willys Jeep been available to the layperson in india at that time? if not, what others were being sold at the time?</p>\n\n\t<p>thanks.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 75,
      "author": "Motorlink Technologies International",
      "email": "motorlinkinternational@hotmail.com",
      "date": "2004-12-07 12:32:01",
      "content": "<p>We are the first Pakistani company perfected a system to design and fabricate custom built 4×4 jeeps, Special purpose vehicles and sport cars according to the customers specifications in such a price on other can offer for detail  contact 0333- 3029585 Email address motorlinkinternational@hotmail.com postal address B-181, sector 11/A. north Karachi-75850. Karachi (Pakistan)</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 76,
      "author": "Willie",
      "email": "willienugent@eircom.net",
      "date": "2004-12-29 20:34:53",
      "content": "<p>Hi, Irish Army had <span class=\"caps\">CJ3B</span>, but all long gone. Any chance of picking up one in reasonable condition in Pakistan or India. Would have to be reasonable priced to afford shipping to Ireland. Willie.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 77,
      "author": "Syed Rizwan Mashadi",
      "email": "mashadi70@hotmail.com",
      "date": "2005-01-26 15:11:08",
      "content": "<p>I feel really glad to read very technical and informative comments on 4×4 jeeps, as i  own a Land Rover Defender Jeep and also the only Authorised dealer for Land Rover Genuine Parts in Pakistan, i have noticed that the Land Rover owners in Pakistan are very much satisfied with its performance as off road vehicle, its suspension, 4 wheel disc brakes, 4 wheel coil springs, turbo charger and intercooler system are its special characterstics, Now the mantainence cost has even dropped bcoz many individuals have also got the Defenders and its parts are now easily available. As per my knowledge the other 4×4 jeeps which are in under use here e.g Willys, M38a1, M151a2 and toyota jeep are not remained as much efficient due the alterations made by the local machanics, their drive is not reliable specially in northern araes, all of my Customers in this area always prefer Land Rover jeep on any other 4×4 due to its dependabilty.</p>\n\n\t<p>Any one requiring any assistance or technical support can contact me on askariauto@yahoo.com</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 78,
      "author": "Skorpion",
      "email": "sonnyboy007@hotmail.com",
      "date": "2005-03-12 03:11:29",
      "content": "<p>HI,</p>\n\n\t<p>I am actually impressed at this guys, knowledge and interest in this guys detailing about the 4×4’s. I come from an Indian Army Major’s Family and we used the similar stuff. Though i surprised not to find mention of the Nissan Jonga of ‘52, a neat 6-cylinder petrol guzzler. Now being decommissoned by the IA. Can anyone give me a link to whats a nice restored Jonga could look like so i can get some suggestions, when i get my army disposed one?</p>\n\n\t<p>Imad, I am glad there is more to than the politics projected by our govts. I see. Your place looks a lil like mine. <img src='http://komac.local/wp-includes/images/smilies/icon_wink.gif' alt=';)' class='wp-smiley' /></p>\n\n\t<p>Skorpion</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 79,
      "author": "Shuja",
      "email": "Mahesarshuja@hotmail.com",
      "date": "2005-03-14 16:52:59",
      "content": "<p>Its nice to see  your site but you shoud put up some more pics here…… I belong to sindh and we have a jeep club too , i myself am an artist and i have degsined few jeeps with parado and surf styles with heated seats and fully automatic transmitions, build with four wheel coil springs. you will be able to see them soon on my web sites</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 80,
      "author": "Adam Motor",
      "email": "adammotor@cyber.net.pk",
      "date": "2005-03-16 03:55:30",
      "content": "<p>Zabardast is now out and costs Rs. 893,000 ($14,883)</p>\n\n\t<p>Here’s the contact details for Adam motor company:</p>\n\n\t<p>Address:   <span class=\"caps\">DSU</span>-11, Pakistan Steel, Downstream Industrial Estate, Bin Qasim, Karachi, Pakistan.</p>\n\n\t<p>Phone(+92-21) 4750755 – 61</p>\n\n\t<p>Fax (+92-21) 4750781</p>\n\n\t<p>Email adammotor@cyber.net.pk</p>\n\n\t<p>Website: <a href=\"http://adammotor.netfirms.com/\" rel=\"nofollow\">http://adammotor.netfirms.com/</a></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 81,
      "author": "umar farooq",
      "email": "farooq@brain.net.pk",
      "date": "2005-03-25 21:56:41",
      "content": "<p>Nice article. I have Jeep CJ-7 in a quite good conidtion and I love driving it. I shall like to exchange notes about the parts availability and related jeep up-keep items.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 82,
      "author": "Major Baleegh Ur rehman",
      "email": "majbaleegh@yahoo.com",
      "date": "2005-03-31 04:24:08",
      "content": "<p>All read about different vehicles, but i tell you the best off roader is the old time favorite is Toyota Land Cruiser 1999, 4.2 litre diesel or the 4.5 litre <span class=\"caps\">EFI</span> petrol vehicle. Its off road travelling is the best at high speeds like above 120 kmph. If any one is interested in buying old vintage of these vehicles he must contact <span class=\"caps\">COD </span>- Central Ordinance Depot – Rawalpindi. Aution on six montly basis is held there for the old vintage of Pak Army vehicles especially jeeps of all vintages. But i must say here if want to enjoy the off road drive go for Toyota Land cruiser 1999 model. Its price tag these days will be around 1 million Pak Rupees and can easily be purchased from Quetta. More over this vehicle is worth its price. If any one of you visit the area plus of Quetta towards the Iranian border these vehicles are sold there without papers worth 200,000.00 Pak Rupees only too. Have a nice day.</p>\n\n\t<p>Major Baleegh Ur Rehman, AO, TC, Loralai-Balochistan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 83,
      "author": "Khizar",
      "email": "khizar88@hotmail.com",
      "date": "2005-04-03 19:30:36",
      "content": "<p>HI</p>\n\n\t<p>In my opinion Adam Zabadast Jeep is the best for off-road purpose because it got 3rd position in the Freedom Rally 2004 in Gawadar. It is built very strongy. It is powerfull and it has many other features which other jeeps in it price range donot have.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 84,
      "author": "AWAIS",
      "email": "awaisanwar007@hotmail.com",
      "date": "2005-04-14 02:51:50",
      "content": "<p>hi anyone</p>\n\n\t<p>to me the best jeep is m715 the ultimate all terrain beast.</p>\n\n\t<p>In reply to jeep willi requirment i saw abt 250-300 m38 jeeps standing in army condition near thokar niaz baig Lahore.</p>\n\n\t<p>i am also a auto freak and love building or converting vehicles to go beyond the original specs so of my works r as follows</p>\n\n\t<p>full replica of 98 model lexus cygnus land cruiser on a frame of 1976 landcruiser,only chassis code can tell the difference.</p>\n\n\t<p>i also have converted jeep cj7 to coil spring just like a 1989 tj,</p>\n\n\t<p>and also converted 1985 chevorlet capric classic car to 4×4 with coil spring at each end over rigid axels with ground clearence of 11 inchs fitted with 30×12/50 meats.</p>\n\n\t<p>also extended the cabins of a 1993 crown to 7 feat and toyota corolla 1997 to 4 feet.</p>\n\n\t<p>also converted  suzuki baleno single air jet manifoiled to 2 way air manifoiled to boost in extra power.</p>\n\n\t<p>if u want any tips and tricks regarding auto’s just email me at the given address i will try my best to help u.</p>\n\n\t<p>until than AH</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 85,
      "author": "Imad",
      "email": "dodo@dodo.com",
      "date": "2005-04-16 00:45:23",
      "content": "<p>Awais,</p>\n\n\t<p>Good work on your custom vehicles! We’d like to see some pics posted</p>\n\n\t<p>in the forums. I also started a tips & tricks thread in the forums a</p>\n\n\t<p>while ago. Feel free to add your tips and tricks for working on autos</p>\n\n\t<p>in there.</p>\n\n\t<p>I’m especially interested in your coil sprung <span class=\"caps\">CJ7</span>. How does it ride</p>\n\n\t<p>and handle compared to the original leaf spring suspension? Which</p>\n\n\t<p>vehicle’s suspension components did you use for the <span class=\"caps\">CJ7</span>? Please post</p>\n\n\t<p>some pictures of this jeep.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 86,
      "author": "Ram Damodar",
      "email": "ram.damodar@gmail.com",
      "date": "2005-04-29 14:21:45",
      "content": "<p>This is the first time I have visited your site, <span class=\"caps\">EXCELLENT</span>, I wish we had one even half as good here in India, We too have a lot of jeeps of all vintages and models, some very well restored, I shall send some pics as soon as I can find the time and a digital camera. Your comments on the Pajero are most apt, they really are useless off road, but very comfortable on tarmac.</p>\n\n\t<p>Ram Damodar, Bangalore, India.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 87,
      "author": "Henry T",
      "email": "henrytaylor@lineone.net",
      "date": "2005-05-11 01:42:10",
      "content": "<p>Hello, great site!</p>\n\n\t<p>I have a <span class=\"caps\">M38A1</span> which I am wanting to put a diesel engine into. Does anyone know of similar projects and if so, what engine was used.</p>\n\n\t<p>I would like to have more power but I would be reluctant to have to change the axles etc. Any advice would be appreciated.</p>\n\n\t<p>Regards, H</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 88,
      "author": "MOhammad Asim",
      "email": "yesyesasim@hotmail.com",
      "date": "2005-05-15 16:03:52",
      "content": "<p>hi, good to see you and it’s very informative site, i love jeeps if you have some, i am intruted in cj-5 or cj-7 looking farward for your early reply</p>\n\n\t<p>(0333-2248661)</p>\n\n\t<p>thanks and  regards</p>\n\n\t<p>Asim</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 90,
      "author": "Sheheryar",
      "email": "sheheryarshah@yahoo.co.uk",
      "date": "2005-07-18 22:02:43",
      "content": "<p>Well, very informative article indeed. I got my hand ful with lotta things which I dont know as such. <span class=\"caps\">BTW I</span> wanna know abt the offroading capabilities of Nissan Patrol and Nissan’s Double Cab.</p>\n\n\t<p>Thnx.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 91,
      "author": "lee Alessi",
      "email": "ltalessi@mac.com",
      "date": "2005-07-27 10:04:26",
      "content": "<p>ive got a decently built m715 with a cummins 4bt. at 105hp its <span class=\"caps\">QUITE</span> capable. good site!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 92,
      "author": "SHAHID VIRK",
      "email": "shahidvirk@hotmail.com",
      "date": "2005-07-30 00:32:38",
      "content": "<p>Hi salam,</p>\n\n\t<p>I must say that it�s a very well presented and informative site, your reviews really helped me to make a decision on Toyota 4×4, & I know which one to buy now….</p>\n\n\t<p>Keep it up�</p>\n\n\t<p>*Can anyone give me some info on custom duty/tax on imported vehicles in Pakistan? Thanks</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 93,
      "author": "humayun mir",
      "email": "humayunm@hotmail.com",
      "date": "2005-08-02 10:44:06",
      "content": "<p>Very informative and interesting site along with great information , please keep this up. I am a 4X4 enthusiast , & I can safely say I have been to all parts of our dear homeland from quetta to khunjrab pass & have seen  and driven almost all of the terrains.My experiences have withToyota Land cruisers , pajero turbo wagons and I have still have 1983-1984 Isuzu Trooper.Although this vehicle hasnt been a success in Pakistan because of absence of dealerships and parts , but I can authentically say it has outperformed almost all the 4×4s in its class.I think I have the best maintained Isuzu of the model in the whole country , I would love to see if you guys can dig some information and add it on your site.For starters this vehicle never heats up in terrains with heavy loads and its off road performance has been great , one source is the 1998-1999 top gear in which it was declared the best in its class , ( other vehicles were Shogun,Nissan pathfinder , discovery etc)</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 94,
      "author": "Kashan",
      "email": "kaz79@hotmail.com",
      "date": "2005-08-17 01:38:46",
      "content": "<p>Hi,</p>\n\n\t<p>I was looking for auction cars in our country and came across this wonderfull 4×4 site entailing 4×4 culture here in our country. Its good to know that there are so many off road enthusiats here too. I own two Ford 1939 model jeeps. I am an offroad enthusiats myself. I use a toyota 2.2 ltr engine coupled with toyota 5 speed(double top) gear box and original special 4×4 gear in my jeeps. It gets me through any terrain i have encountered, whether it be the desert or a rock studded terrain. I totally agree with u guys that Pajero is the worst offroad car. Its more into luxury than it is into offroading. <span class=\"caps\">BUT</span> i have used one for quite some time and feel that it does get the job done (at the cost of some suspension replacement afterwards <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':-)' class='wp-smiley' /> . I am looking for a 84 Toyota Hilux 4×4 chassis. Anyone kind enough plz do let me know.</p>\n\n\t<p>Thanks</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 95,
      "author": "Syed Rizwan Mashadi",
      "email": "askariauto@yahoo.com",
      "date": "2005-08-17 14:19:23",
      "content": "<p>HI guys,</p>\n\n\t<p>Hope you people are enjoing your 4×4 rides. I am enjoying My Defender 90, Its really best Off Road driven Jeep. Now its parts availabilty is also not a problem, dealership network of SIgma Motors has been extended upto all main cities of Pakistan.</p>\n\n\t<p>People who want to go cross country should get their own LAnd Rover Defender, Few 2nd hand defenders are also available in market, auctioned by Aga Khan Foundation Gilgit. These are of 88 to 96 models and prices are between 5-10 lacks.</p>\n\n\t<p>Take Care all of you</p>\n\n\t<p>Rizwan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 96,
      "author": "Faisal",
      "email": "pulsethief@yahoo.com",
      "date": "2005-08-31 18:10:10",
      "content": "<p>its very nice to see so many info about the off road vehicles.keep the good work up.but the author has not mentioned anything about <span class=\"caps\">RANGE ROVERS</span>, and the mitsubishi <span class=\"caps\">L200</span> nor anything about Warrior.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 97,
      "author": "stefan slomczynski",
      "email": "consultants@ssengineer.fsnet.co.uk",
      "date": "2005-10-04 03:29:02",
      "content": "<p>Does anyone knowhow to contact the Central Ordinance depot at Rawalpindi  ?</p>\n\n\t<p>i am still looking for old jeeps willys <span class=\"caps\">MB </span>,Cj2a,M38. (not <span class=\"caps\">M38A1</span>) Does the army still sell some of these/ if so what prices and condition? thanks Stefan S.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 98,
      "author": "Sony",
      "email": "sonyseth1@yahoo.com",
      "date": "2005-10-15 12:58:16",
      "content": "<p>Nice details KO. But u have missed a 4×4 that used to be manufactured in Pakistan back in late 70s n early 80s by now defunct “Naya Daur Motors”. The “Wagoneer”<img src=\"!\" alt=\"\" border=\"0\" /><img src=\"!\" alt=\"\" border=\"0\" />!. I have seen a number of them in Pakistan. In fact they were extensively used by <span class=\"caps\">GOP</span> in 80s.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 99,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-10-15 13:20:59",
      "content": "<p>Sony: My uncle had a Jeep Wagoneer in the 80’s, and there were quite a few around then. I had been in it quite a few times when I was young, but had completely forgotten about it! Sadly, very few of them are still around.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 100,
      "author": "Lance",
      "email": "lancy@gerrys.net",
      "date": "2005-10-18 13:20:08",
      "content": "<p>Hi, this is the first time that I am writing to this site, but I used to own a <span class=\"caps\">M38AI</span> and sold it some time ago. I want a vehicle that is bigger and heavier (even if it is in bad condition). I was thinking of buying a wagoneer. I live in karachi and love driving upcountry a lot with my wife. Now I have a 6 month old baby and figured a wagoneer would have a lot of space for him to play around in at the back of the vehicle while we are driving and for his sleeping. I wold liketo know if anyone knows of any wagoneer that is being sold. I dont mind one that is a little screwed up as I do intend to work on it and customize it and make it up the way I want it. Please do let me know if anyone comes across one. Thanks.</p>\n\n\t<p>Also want to know what would be the best desiel engine to put into this vehicle.</p>\n\n\t<p>ps. Also not looking for one that is to exp.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 101,
      "author": "KIT FLORENDO",
      "email": "florendo5@hotmail.com",
      "date": "2005-10-27 06:04:54",
      "content": "<p>Is there anyone interested in building a replica Willys Jeep from a supplied stainless steel body on chassis OR, if your import regulations allow, a complete ready-to-drive car, 4WD if you wish. I can send you <span class=\"caps\">LOTS</span> of digital photos and descriptions.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 102,
      "author": "rupert pollock",
      "email": "rupertpollock@hotmail.com",
      "date": "2005-11-06 19:02:48",
      "content": "<p>I live in Ireland,and have watched with horror the terrible human trajedy caused by the earthquake.Please God things get better soon.</p>\n\n\t<p>Icouldnt help noticing the number of BJ-40 landcruisers helping the relief effort.Some are in remarkably good shape.</p>\n\n\t<p>Are they still made under licence In Pakistan?</p>\n\n\t<p>I have 2 BJ-40 jeeps which i use on my farm.One has done over 400000 miles,not working at the moment.The other 200000 miles ,engine running beautifully,but unfortuneately is rusting away.Rust is a big problem here.</p>\n\n\t<p>Could someone help me find parts or even one in good working order.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 103,
      "author": "Imad",
      "email": "imad@nospam.com",
      "date": "2005-11-07 09:40:19",
      "content": "<p>Thank you for the kind thoughts. The scale of the destruction is beyond words.</p>\n\n\t<p><span class=\"caps\">BJ40</span> cruisers were manufactured in Pakistan at some point in the the late 60s or early 70s. However, most of the vehicles you saw are actually decommissioned military issue FJ40s. They have been restored at least once, and almost all of them have been converted over to diesel using original B series engines. Since it’s a direct bolt in swap, it’s very tough even for the trained eye to tell a converted FJ from a factory BJ. FJ40s were also supplied to utility companies and public works departments, and many of them have found their way into civilian hands too. That being said, original BJ40s are also plentiful here. Cruisers, especially older ones, are considered prized possessions in this part of the world, so most of them are kept pretty well maintained.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 104,
      "author": "Smeena Bajwa",
      "email": "ina_ghuman@rediffmail.com",
      "date": "2005-11-21 14:28:13",
      "content": "<p>Well ! its time that someone talked about the <span class=\"caps\">PAJERO J TOP</span>, the soft top version with 18 inch wheels. Its off road capabilities r far better than what they have been judged for.</p>\n\n\t<p>Cheers !</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 105,
      "author": "Umer",
      "email": "Umerua@yahoo.com",
      "date": "2005-11-22 13:04:14",
      "content": "<p>Hi,</p>\n\n\t<p>First of all I am very thanksful to you to introduced Jeeps of karachi on net. I am very glad to visit your site, the matter is that  I am also working with Jeeps like <span class=\"caps\">M38 </span>Cjs 7 and Landcruiser Army models, I will be very thankful to you that you reply me and I also sent you my <span class=\"caps\">JEEP M170</span> photos to you on net ,</p>\n\n\t<p>with best wishies Umer Farooq</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 106,
      "author": "Hamza Usman",
      "email": "ahmadnhamza@cyber.net.pk",
      "date": "2005-12-04 02:24:45",
      "content": "<p>Hey!</p>\n\n\t<p>Ive bought the defender from sigma..and ive got this much to say…whoever reckons it breaks down is off his rocker..no offense..let me elaborate</p>\n\n\t<p>first of all.the first reason why the army rejected the defenders about 10=20 years ago was due to a fault in the turbo..being <span class=\"caps\">JALHIL</span> and not fully comprehending the beauty of the engine they convientle forgot land rovers thumb rule…NEVER <span class=\"caps\">EVER SWITCH OFF A DEFENDER THAT HAS BEEN DRIVER FOR MORE THAN 10 MINS BEFORE LETTING IT IDLE FOR ABOUT 2</span>-3 MINs..apparently the turbo kept the oils inside its turbine fins which would eventually jam..</p>\n\n\t<p>secondly…seeing that one can still see them running is a credit to their durability..it is a fact that more than 80 percent of the worlds army’s use defenders..why? because they are bloody good at wat they do…take u anywhere in any environment anyime….ppl who have seen the camel trophy will know what i am talking aout</p>\n\n\t<p>all in all ..s.eeing that the defender is here…i think u guys should post an article on it..giving it 11 out of 10</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 107,
      "author": "Hamza Usman",
      "email": "ahmadnhamza@cyber.net.pk",
      "date": "2005-12-04 17:50:09",
      "content": "<p>hey!</p>\n\n\t<p>well i guess your right about the points you put forward.</p>\n\n\t<p>as far as the jeep being underpowered..i reckon u only feel that once ur on the road..i agree with the good will part..the jeep is a bit pricey at its 23 lac price tag…on another note though..we went on a trip o bohtanis farm and we decided to deviate from the normal route that the guide took us on..in our group we had a willy’s, vigo and a 95 land cruiser..both which proved highly efficent on other tracks but they refused to go over the sort of terrain i took my defender on..</p>\n\n\t<p>in the end i guess its personal choice and i believe i could never do justice to my defenders off roading capabilities because its meant for a completely different different purpose than going over sand dunes in phase 8 etc..</p>\n\n\t<p>people can get heaps more comfortable jeeps spendin the same amount of money so the defender at the end of the day is just reserved for a die hard land rover fan…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 108,
      "author": "Yaseen",
      "email": "yaseen@gmail.com",
      "date": "2005-12-06 12:15:22",
      "content": "<p>Dear Hamza,</p>\n\n\t<p>We have never doubted the offroading and or mechanical abilities of the Land Rover. It is indeed a very capable vehicle and can indeed keep up with most and perhaps even outdo quite a few off road vehicles.</p>\n\n\t<p>However, the Land Rover has certain characteristics that keep one from endearing it.</p>\n\n\t<ul>\n\t\t<li>It is not very comfortable to begin with, very stiff suspension;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The shape leaves much to be desired;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>With that Turbo diesel it is under powered;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>For the price it is more about goodwill than value;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The lot that has made its way to the general public of Pakistan via Sigma motors was meant for a left hand drive nation. I happened to drive one of the earlier delivered vehicles. The gear lever was so far away from the driver’s seat that it seemed like it had been designed for a langur and not a human;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The driver’s seat is shoved all the way into the support pillar; it cramps anyone who is broader than Fido dido;</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The air conditioner controls are too close to the driver’s leg thereby adding to the cramped feeling.</li>\n\t</ul>\n\n\t<p>So after taking the pros and cons into consideration, I’d either spend much less and rebuild a Jeep or then perhaps buy a Hilux, Prado or something along those lines as Toyota <span class=\"caps\">SUVS</span> are as tough as they come and they are more luxurious than a Defender can dream to be. Not to mention it’ll look better too. Land Rover has left the Defender a bit too raw to digest for 2005. Jeep on the other hand has not only retained its rough and tough reputation but has also improved its user friendliness over the years.</p>\n\n\t<p>I am not totally disregarding Land Rover, the <span class=\"caps\">LR3</span> is in a class of its own.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 109,
      "author": "Imad",
      "email": "imad@gmail.com",
      "date": "2005-12-06 12:17:47",
      "content": "<p>I thought the problems Yaseen mentioned above were limited only to Defenders sold by Sigma Motors in Pakistan but after speaking with people who have driven Defenders in the UK, it appears that it’s actually quite common for Defenders to be so blatantly unergonomic.</p>\n\n\t<p>My observations:</p>\n\n\t<ul>\n\t\t<li>The seats are flat, minimally padded, and jammed into the B-pillars. There’s a whole lot of wasted space in the middle where a console supposedly resides. Why couldn’t they have simply located the front seats further inboard and made the console slightly narrower? I certainly don’t think LR designers thought someone would be stowing their small children away in there – it’s just poor design.</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The steering wheel is off center. It would be properly aligned if the seats were moved about 3-4” inboard.</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>The less said about the gear shifter, the better – you need a passenger to ride with you at all times in the front seat to change gears. That stick is meant for him, not you the driver.</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>Beauty may be in the eye of the beholder, but damn this thing looks like it was put in a time machine. The exposed rivet and spot weld design is once again just poor design. I understand it was originally meant to be a cheap farm machine but at its current price the Defender is far from that. The least LR could do is clean up the exterior a <span class=\"caps\">LITTLE</span> bit. They also need to understand that long, flat unreinforced panels develop waves in just a matter of days on the road, let alone uneven off-road tracks. Have you ever seen a reflection in a Defender’s doors or any other side panels? You’ll know what I’m talking about once you do.</li>\n\t</ul>\n\n\t<p>No one other than a die-hard LR romantic would buy one of these things. And it’s not just me saying that – just look up the resale value Defenders have here. That said, I will give the Defender credit where it’s due:</p>\n\n\t<ul>\n\t\t<li>The Turbocharged and intercooled engine is a step in the right direction. Now they just need to punch out the displacement to 3.4L or thereabouts.</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>Massive 4-wheel disc brakes that will stop even the 110 in a hurry.</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>Beefy solid live axles a’la Land Cruiser. No <span class=\"caps\">IFS</span> crap</li>\n\t</ul>\n\n\t<ul>\n\t\t<li>Coil spring suspension at all four corners.</li>\n\t</ul>\n\n\t<p>In a nutshell, the Defender is mechanically sound, but lousy otherwise. For the same price I’d get a Land Cruiser <span class=\"caps\">ANYDAY</span>, even if it’s older.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 110,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-12-06 12:24:25",
      "content": "<p>Imad, the 2.8L intercooled turbo diesel is still underpowered – even the plain 2.4 Hilux engine feels more powerful. Yaseen the mechanical soundness of the defender is a running joke in Africa and Australia.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 112,
      "author": "Hamza Usman",
      "email": "ahmadnhamza@cyber.net.pk",
      "date": "2005-12-10 15:20:28",
      "content": "<p>Your fimiliar with the rough track that takes you around to the farm.one that resembles a road in the side of a mountain….we took it down from there and the defender pulled through and out on top of the jagged rocks…the willy’s got through with the driver cursing on whose idea was it to bring the jeeps down.then after we pulled thru the willys didnt have enuff power to pull it across the rocks…but i reckon it was more reluctance on the owners part to push the jeep…</p>\n\n\t<p>anyways as always id like to end the post glorifying the defender beyond any other off roader..i realized that when ur in a defender u dont need comfort..my father was talking to a british land rover specialist who had put in some years designing the series 3..he said that if u note the passanger seat does not have a handle to hold onto..this is because its designed ( its suspension etc and seating) so that the passanger does not need to hold on to anything..and its true…ive tried it out <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /> …on another note…i find the defender quite comfortable…i mean it would be stark in comparison to a prado or land cruiser owner…ive been in a willy;s and i find the seating and back position wreacking havoc with me..ill grant that sitting at the back in the defender is a pain in the butt <img src='http://komac.local/wp-includes/images/smilies/icon_razz.gif' alt=':P' class='wp-smiley' /> …</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 113,
      "author": "Hamza",
      "email": "ahmadnhamza@cyber.net.pk",
      "date": "2005-12-11 17:56:32",
      "content": "<p>I would recommend that you get in touch with sigma motors and ask them…they have a test course (a rigorous one) where they test all the jeeps that come in..im assuming they have good drivers..so yeh..</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 114,
      "author": "IRFAN KHATTAK",
      "email": "irfankhattak@yahoo.co.uk",
      "date": "2005-12-20 19:57:53",
      "content": "<p><span class=\"caps\">UNIMOG</span>:</p>\n\n\t<p>I own a Unimog. It is 2.4 Diesel. Normally aspirated. As mentioned, the engine feels a bit underpowered on the road. Once you unleash the beast in Off Road, I mean <span class=\"caps\">OTR</span>, Off-The-Road situtation, it is practically unstoppable. the feel is like no other off-roader in the world.</p>\n\n\t<p>We have a small and unknown type club in Abbottabad by the name of OffRoaders Unlimited.</p>\n\n\t<p>I will be interested in off-road discussions and if could be of any assistance would greatly appreciate to be contacted via my email above.</p>\n\n\t<p>Irfan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 115,
      "author": "Mustakim",
      "email": "ibn_qamar@yahoo.com",
      "date": "2006-01-18 11:15:22",
      "content": "<p>More excitement coming from ssangyong rexton offroad availibility,anyone can tell me any involvement of this model with pakistani army..</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 116,
      "author": "Omar Husain",
      "email": "oamr91@sbcglobal.net",
      "date": "2006-01-19 05:22:09",
      "content": "<p>No offense, but i think only jeeps are great for offroading. toyota sucks. Misubishi sucks. (KO’s cousin)</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 117,
      "author": "Kashan",
      "email": "kashan_zuberi@ahoo.com",
      "date": "2006-02-02 01:11:04",
      "content": "<p>Hi,</p>\n\n\t<p>Anyone know where i could get a 86 softop Land Cruiser??? Is Pak Army auctioning?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 118,
      "author": "ray",
      "email": "rayoh_au@yahoo.com.au",
      "date": "2006-02-13 11:59:04",
      "content": "<p>i have a 1958 nissan patrol 4w65 and need information on engine specifications particularly valve clearances. also any information on parts or workshop manuals would be appreciated. any info gladly received</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 119,
      "author": "M. Awais",
      "email": "mawa83b_aib@yahoo.com",
      "date": "2006-02-13 23:57:53",
      "content": "<p>AoA, I was wondering about Toyota Hilux Surf <span class=\"caps\">SSR</span>-G with X-REAS Suspensions, and Part time / Multi mode 4WD (Transfer with Torsen center <span class=\"caps\">LSD </span>+ Automatic Disconecting Differential [ADD]) and Rear <span class=\"caps\">LSD</span>; how much would it cost, and who are dealing it, coz toyota-indus in isb doesn’t deal with surfs.</p>\n\n\t<p>About Toyota’s Part-time Multimode 4WD Transfer, does it have 2 speed Hi/Lo Range gears? Is this thing equiped in Toyota <span class=\"caps\">LC </span>Prado along with Torsen Center <span class=\"caps\">LSD </span>& <span class=\"caps\">ADD</span>.</p>\n\n\t<p>Thirdly I have seen Ssangyong Stavic <span class=\"caps\">SV270 </span>Xdi on isb streets, the one with <span class=\"caps\">AWD </span>System seems impressive as it equiped with Hi/lo range tranfer case. Wonder if this <span class=\"caps\">MPV</span> would be suitable (obiviously not for extreme offroad) on medium off-road tracks and long on-road drives in pakistan? Any ideas about its price and dealers in isb?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 120,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-02-14 17:44:04",
      "content": "<p>M. Awais, pricing questions would be best answered by a car dealer. My guess is that it would cost anywhere from 25 to 40 lakhs for a used version. The 2003 Surf (and onwards) is based on the Landcruiser 120 series chassis and has a Hi/Lo transfer case. It is far, far superior in terms of drive quality and refinement to the old one. The 2002 and older models are based on the old Toyota Hilux, which is one of the toughest objects known to man.</p>\n\n\t<p>Yes, the Stavic should be suitable for long drives. Keep in mind that a long drive in Pakistan will take you over terrain which would be considered offroad in South Korea. It is a bit large for offroad use.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 121,
      "author": "Jamil Ahmed",
      "email": "jamilahmed00@gmail.com",
      "date": "2006-03-08 20:38:30",
      "content": "<p><span class=\"caps\">A O A</span>, nice articles mention here, i’m asking about availablity of spare parts of Land Rover series II, espacilly restoration available here in pakistan.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 122,
      "author": "Usman Khalid",
      "email": "usmankhalid84@hotmail.com",
      "date": "2006-03-28 13:34:30",
      "content": "<p>Asalam o Alikum..</p>\n\n\t<p>umm.. i wanted to know.. if i can get a jeep in condition for <span class=\"caps\">PK </span>Rs. 80,000-100,000.. i am interested in buying a <span class=\"caps\">M38</span> or a jeep like that.. but in good condition.. so if any of you wants to sale his/her jeep.. please contact me.. i am from karachi.. and i would like it more if the jeep you offer would be of karachi number too.. you can contact me on my cell number too.. its 0300 9264150 or you can email me on usmankhalid84@hotmail.com. Thanks.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 123,
      "author": "Laiq Ali Hasan",
      "email": "laiqalih@yahoo.com",
      "date": "2006-04-06 17:03:02",
      "content": "<p>Hi,</p>\n\n\t<p>I am running  m715 with 13bt desiel toyota engine with all stock gear and axels and power is all what u won’t when off roading with or with load. My machine was an active part of earthquake relief effort and we took the machine to some limits e.g. 65 degree climbs(allayi). I never used my 1st gear in 4wd low.</p>\n\n\t<p>Believe me a 13 bt is a perfect match for this machine with original drivetrain.</p>\n\n\t<p>top spped at motorway is 110 km per hour which is all good for me(because u also have to stop this machine). If require more power go for 15bft toyota engine now getting avaliable. never go for six cylinders they are revers this baby requires tourque at real low rpm.</p>\n\n\t<p>orginal tornado 6 cylinder   produces    120horse power    210lb. torque at 3500rpm</p>\n\n\t<p>13bt     120 horse power 210lb torque at   2800 rpm</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 124,
      "author": "Syed Mustafa Amjed",
      "email": "mustafaamjed@yahoo.com",
      "date": "2006-04-14 13:56:51",
      "content": "<p>Hi,</p>\n\n\t<p>Great site. I am looking for a second hand Land Rover Defender or a Jeep in good condition, preferably with a Karachi number plate. Any one selling??</p>\n\n\t<p>Thanks</p>\n\n\t<p>My cell number is 0321 2395641.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 125,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-04-14 14:03:00",
      "content": "<p>Pleast post over at the <a href=\"http://offroadpakistan.com/forums\" title=\"\" rel=\"nofollow\">forums</a>.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 126,
      "author": "Hanif Qureshi",
      "email": "haniffq@yahoo.com",
      "date": "2006-04-16 12:45:37",
      "content": "<p>Salaam,</p>\n\n\t<p>Great site, I own a Discovery 300TDI and a Defender 300TDI, hey not here in Pakistan, but in Africa.</p>\n\n\t<p>I am looking for Injector nozzles for the <span class=\"caps\">TDI</span> anyone out there who can guide me to the right place ? I am In Karachi</p>\n\n\t<p>Thanks</p>\n\n\t<p>Hanif</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 127,
      "author": "Khuram Mahmud",
      "email": "akakhurram@hotmail.com",
      "date": "2006-04-19 18:39:56",
      "content": "<p>Dear off-road pals,</p>\n\n\t<p>I wish people in lahore would share the same passion for off-road as all of you have displayed here. While thoroughly going through this website i noticed that there aren’t many good thoughts about UK assembeled land rovers. the author mentioned that they couldn’t last here in Pakistan. I guess i can make his day by saying that there is one that he doesn’t know about:</p>\n\n\t<p>I own a 1963 Series <span class=\"caps\">II A</span>, Land Rover. Not only on-road but off-road capabilities as well.</p>\n\n\t<p>regards,</p>\n\n\t<p>Khurram</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 128,
      "author": "AWAis",
      "email": "awaisanwar007@hotmail.com",
      "date": "2006-04-21 05:43:43",
      "content": "<p>aoa jeepers</p>\n\n\t<p>khuram u live in lahore and u dont even know the passionate 4×4 clubs of lahore?go to landcruiser motors at lahore hotel they will inform u whenever a event is coming.yaar i once rode with them for some 4×4 fun and beleive me they go beyond the capabilties of the vehicals.they have designed many 4×4 tryout parks in lahore or just outside lahore which test all the nuts and bolts of the vehicals.</p>\n\n\t<p>anyway folks i have a landcruiser 1986 five door for sale registered 1996 lahore # with B3 engine for only 500k.perfect for swaping the upper top with any cruiser top u like from 1986 to 1997.for further info plz contact via email</p>\n\n\t<p>AH</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 129,
      "author": "AWAis",
      "email": "awaisanwar007@hotmail.com",
      "date": "2006-04-21 05:45:37",
      "content": "<p>awaisanwar007@hotmail.com</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 131,
      "author": "Aamir Basrai",
      "email": "aamir.basrai@pmapakistan.com",
      "date": "2006-05-29 12:05:09",
      "content": "<p>Dear Khalid,</p>\n\n\t<p>I need help of pro’s like u, for purchasing a Jeep!, as i have no experience at all!, i go to Hingol 3-4 times a year for fishing, but am dependent on freinds who have 4wd;’s, so want my own, & every week go to mubarak village & other fishing places, so basically want one for all my fishing needs, how about <span class=\"caps\">M38</span>, with all the specs the one above has?…how much wud that cost?</p>\n\n\t<p>Will be looking fwd to haring from you</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 132,
      "author": "Andrew Grebneff",
      "email": "andrew.grebneff@stonebow.otago.ac.nz",
      "date": "2006-06-04 18:39:26",
      "content": "<p>Saw your forum while Googling for 3C-Ts. Someone mentioned the Toyota 3C-T as a good engine. Don’t you believe it… turbodiesels are notorious for cracking heads. My Estima just did this for the second time, and I have searched for other 3C-Ts here in New Zealand with no luck… <span class=\"caps\">ALL</span> have cracked their heads. The problem is retained heat generated by the exhaust-driven supercharger… I’d say a turbodiesel withthe turbo stripped off and a Lysholm-type supercharger fitted instead would avoid the problem. An intercooler will not cure the turbo-heat problem, as it won’t cool the inlet charge sufficiently.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 133,
      "author": "Henry Dray",
      "email": "henrydray@ozemail.com.au",
      "date": "2006-07-29 15:04:08",
      "content": "<p>I’m working on a film and need to hire 2 landcruisers (70’s models) … will pay well and return in same condition as found. Any repairs needed I will pay for them.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 134,
      "author": "Baleegh Ur Rehman",
      "email": "majbaleegh@yahoo.com",
      "date": "2006-08-14 02:08:06",
      "content": "<p>Any body interested in buying vehicles being auctioned by Pak Army must contact Central Ordnance Depot – <span class=\"caps\">COD </span>- Rawalpindi, auctions are held after six months in the fiscal year. Any body interested in getting off road vehicle can contact Headquaters Frontier Corps (Quetta) – auctions are held thrice a year starting from Jan each year.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 136,
      "author": "fahadali",
      "email": "fahadali4wd@yahoo.com",
      "date": "2006-08-20 18:10:50",
      "content": "<p>sorry my message was stuck so it was posted three times by error.</p>\n\n\t<p>waiting for way out to paste pictures.Plz reply on your earliest.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Fahad</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 137,
      "author": "Bilal Ghori",
      "email": "bilal_ghori@hotmail.com",
      "date": "2006-08-23 19:07:17",
      "content": "<p>Hey,</p>\n\n\t<p>I have become a big fan of this web site and love to browse through it. We have a Toyota Land Cruiser II but its a 5 door one. Me and my brother were seriously thinking of buying a Defender or a Willys or a CJ-7.  Anyways i wanted to know if you guys could help me find a Willys or CJ-7 in good condition. Also tell me about the jeep rebuilders at Lyari.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 138,
      "author": "fahad",
      "email": "fahadali4wd@gmail.com",
      "date": "2006-08-24 02:55:49",
      "content": "<p>Khalid/Imad,</p>\n\n\t<p>I have posted u the Pictures of that above mentioned Amazing Jeep Austin.I will apprciate if the said pics will be updated on the web site so other viewers can enjoy them as well.I am also sending you the pics of Latest tour of Babusir Pass.Plz update them as well.</p>\n\n\t<p>Jeeper Once,Jeeper forever.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Fahad</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 139,
      "author": "Sarmad",
      "email": "sarmad.qureshi@yahoo.com",
      "date": "2006-08-28 00:18:39",
      "content": "<p>No matter what anyone says. Land Rover has been tested to the limits to being the best 4×4 in the world, repeatidly. Ever wonder why <span class=\"caps\">CAMEL TROPHY</span> only uses Land Rovers.</p>\n\n\t<p>Variants of Land Rovers are Defender 90, Defender 110, Discovery, <span class=\"caps\">LR3 </span>& the Freelander.</p>\n\n\t<p>Range Rovers are the luxurious models.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 140,
      "author": "Abid Omar",
      "email": "abidomar@gmail.com",
      "date": "2006-08-28 01:49:03",
      "content": "<p>Sarmad, the Camel Trophy is a Land Rover sponsored event, thus you only see Land Rovers theres. And that too only the <span class=\"caps\">LR </span>Discovery.</p>\n\n\t<p>But you may have noticed that in the recent decades Toyota Land Cruisers have replaced the LR’s purpose.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 141,
      "author": "fahad ali",
      "email": "fahadali4wd@yahoo.com",
      "date": "2006-09-08 16:31:02",
      "content": "<p>Guyz there will be grand jeep show in Isb.Hosted by Isb Jeep club.Rally will start at 11:00 am on sunday 10-9-2006 at Isb <span class=\"caps\">ZOO</span> an will finish at Pir Sohawa (Margalla Hills).All jeepers are invited at lunch by Uncle Saleem Secatary Isb Jeep Club.After lunch there will be some hard core Four wheeling………………………so be there.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Fahad</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 142,
      "author": "Imran",
      "email": "dr.i.ahmed@gmail.com",
      "date": "2006-09-08 16:40:40",
      "content": "<p>Khalid Omar, Impatiently looking forward to your review of the Adam Boltoro. You have a wonderful site, keep up the good work! I have been driving 4×4s in the U.K. but I am now looking forward to serious off roading in Pakistan. Is the Mitsubishi <span class=\"caps\">L200</span> not selling in Pakistan?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 143,
      "author": "DR AIJAZ SHAIKH",
      "email": "sollya_2000@yahoo.com",
      "date": "2006-09-16 03:50:21",
      "content": "<p>salam sir your web site is really great, well i like jeeps ,but i dont have one . interested to purchase adams zabardast  is it really perfect jeep?what is a cast?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 144,
      "author": "Owais Nasir",
      "email": "owaisnasir@hotmail.com",
      "date": "2006-10-06 08:05:00",
      "content": "<p>Good to know that there is a group of this sort in Karachi. I have a 4700cc Land Cruiser in Dubai & go to the dunes every Friday. Just wanted to know whether if it is possible to bring my 4X4 from Dubai to Karachi during my Summer vacation & take it back to Dubai when I return back from Pakistan?</p>\n\n\t<p>My e-mail is owaisnasir@hotmail.com</p>\n\n\t<p>Regards,</p>\n\n\t<p>Owais Nasir (+971 50 7854150)</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 145,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2006-10-06 15:00:04",
      "content": "<blockquote>Good to know that there is a group of this sort in Karachi. I have a 4700cc Land Cruiser in Dubai & go to the dunes every Friday. Just wanted to know whether if it is possible to bring my 4X4 from Dubai to Karachi during my Summer vacation & take it back to Dubai when I return back from Pakistan?</blockquote>\n\n\t<p>Yes, it is – check with the local Pakistan embassy for details.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 147,
      "author": "Asif Ahmed Siddiqui",
      "email": "asif_siddiqui70@yahoo.com",
      "date": "2006-11-22 17:05:59",
      "content": "<p>Dear Mr. Khalid Omar</p>\n\n\t<p>I have been associate with the oil exploration industry, <span class=\"caps\">BP </span>Pakistan had Import  Defender in 20 No. in late 90”s. These Land rovers served 5 to 6 years and no more in use, they are ready to auction and stocked in Khaskheli oil field (some 15 km from Golarchi due to low profile appearance these classic vehicle are not very much appreciated. All of them are good physical condition accept some of these which are cannibalize to serve others. If you  are interested you can find it out from H.O of <span class=\"caps\">BP </span>Pakistan at Bharia Complex</p>\n\n\t<p>Asif</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 148,
      "author": "mustafa",
      "email": "mustafaamjed@yahoo.com",
      "date": "2006-11-22 17:32:10",
      "content": "<p>I have been looking for a Defender. Can you give me a price idea?</p>\n\n\t<p>Regards</p>\n\n\t<p>Mustafa</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 149,
      "author": "Asif Ahmed Siddiqui",
      "email": "asif_siddiqui70@yahoo.com",
      "date": "2006-11-23 16:31:37",
      "content": "<p>I dont have any idea regarding the price, but I had picked up a 4×4 Hilux model 1993 in 2000 with no major repair what I had to replace all tyres, all types of  belts (timing and fan etc. a little niptuk with the diffrential and I had won that pickup in Rs 360,000.00. these cars are documently depleted but carriying enough juice for us.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 150,
      "author": "Asif Ahmed Siddiqui",
      "email": "asif_siddiqui70@yahoo.com",
      "date": "2006-11-23 16:34:54",
      "content": "<p>one more thing these vehicles are equiped with US made roll bar and Igloo Coolers</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 151,
      "author": "Ritesh Magar",
      "email": "ritesh@sprintprints.co.in",
      "date": "2006-12-12 23:43:12",
      "content": "<p>Hi,</p>\n\n\t<p>The one thing i would say about 4×4 offroaders club Karachi is  just awesome.I am from India,i own a <span class=\"caps\">CJ7 1975</span> model. Can you help in getting a few</p>\n\n\t<p>spares.I am restoring my Jeep.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Ritesh Magar</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 152,
      "author": "Shoaib",
      "email": "shoaibmm@yahoo.com",
      "date": "2007-01-09 16:20:50",
      "content": "<p>Hi everybody I just new to this forum. Planing to buy Toyota Harrier 4 <span class=\"caps\">WD 1999</span> model, Guide me please</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 153,
      "author": "Nouman",
      "email": "nouman_zia@hotmail.com",
      "date": "2007-01-18 01:19:18",
      "content": "<p>what abt mini peajro?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 154,
      "author": "fuma",
      "email": "dr.fuma@gmail.com",
      "date": "2007-03-04 10:04:50",
      "content": "<p>Hello to all off roaders!</p>\n\n\t<p>I’m planning to buy a Toyota Landcruiser model:1984.</p>\n\n\t<p>Can anyone guide me to this?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 155,
      "author": "Asad Aijaz",
      "email": "aijaz.asadi@gmail.com",
      "date": "2007-03-12 23:16:51",
      "content": "<p>Well for the jimny i can say its good for offroading and good for highways too the car reaches 140 with no trouble at all and u can get the best out of it while offroading. I read somewhere that its the best in Mini <span class=\"caps\">SUV</span> and after that comes Dihatsu Terrios. Well its also available in 1.5 Disel engine hope that we can get that in Pakistan. Below are some pics:</p>\n\n\t<p><a href=\"http://www.jimny.se/pictures.html\" rel=\"nofollow\">http://www.jimny.se/pictures.html</a></p>\n\n\t<p>www.jimny.se</p>\n\n\t<p><a href=\"http://bbs.zuwharrie.com/content/topic,51943.msg554033.html#msg554033\" rel=\"nofollow\">http://bbs.zuwharrie.com/content/topic,51943.msg554033.html#msg554033</a></p>\n\n\t<p><a href=\"http://www.4wd1.com/suzuki_jimny.htm\" rel=\"nofollow\">http://www.4wd1.com/suzuki_jimny.htm</a></p>\n\n\t<p><a href=\"http://www.4x4world.co.uk/206-suzuki-monsta-jimny-4x4-world\" rel=\"nofollow\">http://www.4×4world.co.uk/206-suzuki-monsta-jimny-4×4-world</a></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 156,
      "author": "asghar khan",
      "email": "kanderkas@hotmail.com",
      "date": "2007-03-15 03:13:38",
      "content": "<p>hi all</p>\n\n\t<p>wonder why there is no mention of the mercedes GD jeeps on this site. i have owned and driven one in the north and north-western parts of the country for many years now and find it an excellent machine…..comfortable and powerful. I would like to communicate with GD lovers/owners and exchange info on maintenance and parts availibility. Mine is a 1981 model, three door vehicle. Old is gold….especially if offroading is the main purpose…..no heartburn and lots of fun.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 158,
      "author": "Aamir Hameed",
      "email": "aamirhameed@pepl.com.pk",
      "date": "2007-04-11 11:21:38",
      "content": "<p>Our Company interested to purchaase 4×4 double cabin pickups model 2004 & 2005. Please provide us prices and all terms and conditions.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 159,
      "author": "Babar",
      "email": "bali272002@yahoo.com",
      "date": "2007-04-23 21:40:23",
      "content": "<p>I am interested in buying <span class=\"caps\">RAV4</span> model 2004.  Please advise me if this is a car worth buying for onroad driving.   What is the situation with spare parts.  I shall be grateful for your sincere advice.rgds Babar</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 160,
      "author": "irshad lodhi",
      "email": "austingypsy@yahoo.com",
      "date": "2007-05-06 00:15:31",
      "content": "<p>asslam o alekum i have <span class=\"caps\">AUSTINGYPSY</span> 4×4 with full off road access i test in off road i found very good in snow mud etc</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 161,
      "author": "pali khan",
      "email": "sak_tareen@hotmail.com",
      "date": "2007-07-20 21:53:11",
      "content": "<p>i have a landcruiser 1993 , 4200cc turbo diesel , ps , pw , pm , sunroof , fridge , cdetc , want to sell it , any1 interested ?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 162,
      "author": "AWAIS",
      "email": "msnver@hotmail.com",
      "date": "2007-07-22 05:43:21",
      "content": "<p>hi everyone,</p>\n\n\t<p>i have a 1986 toyota landcruiser bj60 and i want to put landcruiser bj80 series(1990 or above) body on its frame but dont know where such conversion took place.i know guyz in peshawar and quetta do this kind of conversion but i need some reliable source recomended by u guyz,so if any of u blokes know anybody who can do these kind of converion in good price plz drop an email at msnver@hotmail.com with their contact numbers or addresses i will be very thankfull.</p>\n\n\t<p>by the way i m in lahore.</p>\n\n\t<p>Thanx in advance</p>\n\n\t<p>AH</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 163,
      "author": "sajidd",
      "email": "sajidd@Hotmail.com",
      "date": "2007-07-24 00:46:34",
      "content": "<p>Pli Khan, are you in Karachi?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 164,
      "author": "zameer",
      "email": "zameer_14@gotmail.com",
      "date": "2007-08-01 19:12:49",
      "content": "<p>hello i jus came here to buy a jeep not to post a comment plz if u people search for a jeep for me and it should be a little bit n a good condition</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 165,
      "author": "mahmood asad khan",
      "email": "khanszabist@hotmail.com",
      "date": "2007-10-04 23:20:04",
      "content": "<p>I want to know about the complete manufacturing features of range rover vehicles and their prices. please tell me can we have these jeeps on instalments</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 166,
      "author": "valium 10 poem",
      "email": "ropikolok@mail.ru",
      "date": "2007-10-05 19:11:48",
      "content": "<p>Hi all!</p>\n\n\t<p>like your logo. It very impressive, many thanks. Good resources here. Thanks!</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 167,
      "author": "Hussain Zaidi",
      "email": "htz25@yahoo.com",
      "date": "2007-10-10 11:24:10",
      "content": "<p>It was great to find so much information on 4X4 vehicles. I wished to clarify a point on Suzuki Jinmys. Although Pakistan Suzuki is importing Suzuki Jimny and claims to have all the parts avaiable but when one needs them these are not there. I had a Jimny 1999, similar in shape to the new imported ones but it was not impossible to get its spare parts from Suzuki as they did not have anything in stock. I waited for almost one year and finally disposed off the vehicle.</p>\n\n\t<p>I am still interested in getting a 1.3 Manual Jimny, these vehicles are very expansive in Lahore, I would appreciate if some one can guide me on the correct price of 2006 Suzuki Jimny 1.3 manual in excellent condition.</p>\n\n\t<p>Also there are a few wranglers available in the market these days. Please post a few guiding tips on these vehicles as well. Specially their off road capacity.</p>\n\n\t<p>Regards,</p>\n\n\t<p>Hussain</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 168,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2007-10-11 21:52:24",
      "content": "<p>Hassan, once I drive a Jimny offroad will add it the listing.</p>\n\n\t<p>I don’t know much about the Jeep wranglers available in the market either, except for the fact that they are good offroaders (and gas guzzlers!)</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}