{
  "post_id": 62,
  "comment_count": 6,
  "comments": [
    {
      "id": 734,
      "author": "Imad",
      "email": "oufh@ihwerf.com",
      "date": "2005-06-15 18:34:31",
      "content": "\t<p>I have driven with permanently locked drive flanges and also free wheel hubs, and the only thing I miss about drive flanges is the ability to pop into 4 hi without slowing down. Less drivetrain noise, less wear on that long, whippy CJ front driveshaft and u-joints, better acceleration, fewer torn oil pans on rogue speed bumps&#8230; what&#8217;s not to like about them? Yes, I am talking about FWHs in the real world of jeeps parts that wear out faster than you can replace them and of mechanics who re-cut your Toyota oil pan so that a spinning front u-joint goes through it like a hot knife through butter. Until I get a brand new driveshaft with spanking new u-joints, pinion bearings, oil seals, the works, I&#8217;ll just stick with FWHs.</p>\n\n\t<p>FWHs are the bane of inexperienced drivers, who get stuck not knowing that 4 lo won&#8217;t do any good if the hubs aren&#8217;t locked, or those who never lock their hubs till the day they really need than and find out the damn things are jammed uo. Such people need not put themselves in such situations. It&#8217;s not so inconvenient to get out and lock your hubs before hitting the rough stuff. It&#8217;ll also give you a chance to spot anything wrong with the vehicle before you go ballistic on it.</p>\n\n\t<p>I think the real argument is manual locking hubs vs. automatic hubs. Jeep and Ford came up with dreaded vacuum activated hubs in the late 80s, which failed more often than not. Now Japanese carmakers have jumped on the bandwagon too with their equally complicated, albeit more reliable, electric designs.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 735,
      "author": "KO",
      "email": "khalid.omar@gmail.com",
      "date": "2005-06-18 16:14:39",
      "content": "\t<p>In 2 wheel drive, only the rear drivetrain is under stress &#8211; so even if the front hubs are permemantly locked the front axles, driveshafts etc. will last much longer than the rear parts. I&#8217;ve replaced the rear driveshaft and crosses, but the front ones are still going strong. If you find that the front drivetrain components are wearing out as the same rate as the rear, than there is something wrong with the drivetrain geometry.</p>\n\n\t<p>fewer torn oil pans on rogue speed bumps</p>\n\n\t<p>Your front u-joint shouldn&#8217;t come into contact with the oil pan in the first place. Shape the oil pan upwards, put bumpstops for the front axle etc.</p>\n\n\t<p>FWHs are the bane of inexperienced drivers</p>\n\n\t<p>True, I seen quite a few people hopelessly stuck because they had no idea they had to &#8216;lock&#8217; their front hubs.</p>\n\n\t<p>Autolocking hubs are a pain &#8211; I&#8217;ve seen them fail first hand in a Kia, a Ford Bronco and a Toyota Landcruiser.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 736,
      "author": "Imad",
      "email": "idug@oihf.com",
      "date": "2005-07-08 00:28:04",
      "content": "\t<p>FWHs evoke extremely polarized opinions. Those who&#8217;ve never had problems running drive flanges will surely see no virtue in running FWHs, but those who had to deal with the things I mentioned above would much rather get out and lock the hubs.</p>\n\n\t<p>You&#8217;d think twice about dismissing FWHs if you still had jeep hardware under your jeep. Your jeep has Daihatsu axles which have a much less intrusive profile than jeep axles. That helps keep the driveshaft yokes at a safe distance from the oil pan. By the same token, the front drivehaft is also made from larger diameter tubing and a longer slip yoke, all for a much less whippy shaft than the wimpy jeep original. Japanese diffs are also remarkably smooth, worlds more refined than 1950s American diffs.</p>\n\n\t<p>I drove our old Willy&#8217;s with drive flanges for ages, and later on with FWHs. There was a night and day difference with unlocked hubs. It ran a lot quieter and acceleration was much better too. Then we got the <span class=\"caps\">CJ7</span> with all Landcruiser drivetrain, and in this vehicle you couldn&#8217;t tell if the hubs were locked or not. It was just as smooth and quiet either way, thanks to the beefy driveshafts and silky smooth diff operation.</p>\n\n\t<p>As for oilpan-busting-u-joints, Toyota engines have pesky oil pickup tubes hanging out of the block limiting how much you can trim off the oil pan. You can&#8217;t go overboard hacking up the oil pan because it naturally won&#8217;t fit back on. Or you might think you &#8216;ve notched it deep enough, but then a bump will come along, compress your bumpstops you like never thought possible, and punch a nice little pin hole to slowly but surely bleed the engine dry (</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 737,
      "author": "Emil",
      "email": "emil@bungeeco.com",
      "date": "2007-05-04 08:11:59",
      "content": "\t<p>I just bought a 1963 Willys,how do i lock the hubs on the front wheels to use it in 4X4 they look different,any body can help please email me at emil@ bungeeco.com.</p>\n\n\t<p>Thank you</p>\n\n\t<p>Emil</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 738,
      "author": "admiralboner",
      "email": "admiralboner@yaho.com.au",
      "date": "2009-04-29 16:35:48",
      "content": "\t<p>Nothing could be better that the Aisin Free wheel hubs. Personally I don&#8217;t like full time 4WD as Found in the Prado or newer cruisers. I notice the difference when driving with the hubs locked in my <span class=\"caps\">LJ78</span> as it is harder to steer and a bit slower and uses way more fuel.  If you use the right gear oil the internal diff parts should stay coated and don&#8217;t need the occasional once a week drive in 4WD. You shouldn&#8217;t be locking the hubs, engaging 4WD and and pretending you&#8217;re driving a Ferrari anyway although a lot of people do and that&#8217;s where most have problems. Period.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 739,
      "author": "kevin",
      "email": "bsbb@fsmail.net",
      "date": "2010-01-28 16:35:47",
      "content": "\t<p>I have a ford maverick gls 1997. i dont seem to be getting traction in 4 wheel drive . it is fitted with automatic <span class=\"caps\">FWH</span> are there any tips for me to lock these wheels up because i cannot even drive up a small hill with new snow tyres on driving me crazy , i must be overlooking something.</p>\n\n\t<p>please help</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}