{
  "post_id": 51,
  "comment_count": 28,
  "comments": [
    {
      "id": 647,
      "author": "Miles",
      "email": "mileshc@yahoo.com",
      "date": "2005-04-29 02:53:59",
      "content": "\t<p>I have been following the Diesel bike developments &#038; scene for some years now.</p>\n\n\t<p>I have to agree this is for me a most excellent transport solution, coupled with Bio-Diesel it makes really good common sense.</p>\n\n\t<p>You can grow your fuel or re-cycle it from local sources &#038; thus it&#8217;s <span class=\"caps\">CO2</span> neutral, brilliant!</p>\n\n\t<p>I have found this web site interesting as it catalogues many if not most of the current &#038; past diesel bikes, <a href=\"http://www.peace65.freeserve.co.uk/Pictures/diesel.htm\" rel=\"nofollow\"><a href=\"http://www.peace65.freeserve.co.uk/Pictures/diesel.htm\" rel=\"nofollow\">http://www.peace65.freeserve.co.uk/Pictures/diesel.htm</a></a></p>\n\n\t<p>I dream if not for the <span class=\"caps\">KLR</span> based bike, one equipped with the Mercedes Smart Diesel engine, 80Kgs including semi-automatic gearbox, now then where is the telphone directory, I must see if the local vehicle breakers have any crashed diesel Smart&#8217;s</p>\n\n\t<p>Cheers.</p>\n\n\t<p>Miles, somewhere near Rochdale, England.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 648,
      "author": "trevor",
      "email": "trevorballard61@hotmail.com",
      "date": "2005-05-06 13:01:50",
      "content": "\t<p>Hi there, when in India in 1997 I saw diesel motorcycles.Memory tells me they were single cylinder machines.Any ideas on what they are?  Very interested in diesel machinery. Have not seen anything of the like in Australia. See ya Trevor Qld Aust.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 649,
      "author": "nick",
      "email": "nicktrcat@eircom.net",
      "date": "2005-06-14 01:57:12",
      "content": "\t<p>Hi, Has anyone thought of using a boxer twin(BMW) complete motorcycle less engine? A small diesel like the Iseki mower engine would bolt straight onto the gearbox using a simple adaptor plate. Add a turbo and Nitrous Oxide for added fun factor! Nick.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 650,
      "author": "Alvin Lastrilla",
      "email": "vino@pldtdsl.net",
      "date": "2005-06-17 10:03:11",
      "content": "\t<p>I have today a product that would increase your mileage from 10% &#8211; 30% and a fuel efficiency by 12%.The product under went  rigorous testing by the <span class=\"caps\">USDOE</span>, by Japan, BP, New Zealand and Australia. It is now being exported to Japan. Anyone might be interested to market the product in India or Paskistan. Saves fuel and expel better air.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 652,
      "author": "Usman Ahmad",
      "email": "cool_one2k@yahoo.com",
      "date": "2005-07-27 02:13:44",
      "content": "\t<p>I&#8217;ve seen an Indian bike in <span class=\"caps\">BBC</span>&#8217;s &#8216;Top Gear&#8217; which used diesel. It was way back in mid to late 90&#8217;s. If i remember correctly it was a &#8220;Rajdoot&#8221; 350cc bike. This is the first time i heard about a diesel bike since then.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 653,
      "author": "George",
      "email": "Gedrog@hotmail.com",
      "date": "2005-08-14 17:47:54",
      "content": "\t<p>I really want to see the <span class=\"caps\">M1030</span> bike become comercialy available. I am tired of seeing it only for military use. I wanna travel through the sahara desert whithout worrying about fuel disapear for weeks and come back without worrying about the fuelbill. Comon lets get this thing to the public.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 654,
      "author": "Uday Nayar",
      "email": "udaynayar@gmail.com",
      "date": "2005-08-24 22:22:46",
      "content": "\t<p>heck we&#8217;ve been making diesel motorcycles in india for some time now infact we make quiet a few diesel powered contraptions one of which is the famed jugad our farmers figured out as far back as the late 80&#8217;s that a lombardini diesel pumpset engine could be shoe horned into an enfield 350 frame using the same transmission as on the enfield Enfield was only manufacturing what was proven by our farmes but they stopped as the old lombardini 325 engine is not very emmission friendly especially by indian standards but i guess you could build one any time if you had an old enfield 350 and a lambordini3 25 lying around the Germans have used the same idea but with stronger Hatz diesels to the same end too bad they dont have a supercharger figured out yet Imagine a supercharger for a 10BHP engine</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 655,
      "author": "Anthony Garguilo",
      "email": "ajg34667@msn.com",
      "date": "2005-09-11 07:14:18",
      "content": "\t<p>I would buy a middle weight diesel powered motorcycle if available in the United States.  I know Royal Enfield builds small diesel motorcycles for Europe, why not the <span class=\"caps\">USA</span>?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 656,
      "author": "Ian",
      "email": "dieselbike@blueyonder.co.uk",
      "date": "2005-09-30 20:37:08",
      "content": "\t<p>Why are people so interested in Royal Enfield (Madras motor co) ?</p>\n\n\t<p>I don&#8217;t want to put enfields down or anything, but their hardly outstanding are they!</p>\n\n\t<p>If you want a real stonking diesel then take a gander at this:</p>\n\n\t<p><a href=\"http://www.neander-motors.com/motorbike/en/index.php\" rel=\"nofollow\"><a href=\"http://www.neander-motors.com/motorbike/en/index.php\" rel=\"nofollow\"><a href=\"http://www.neander-motors.com/motorbike/en/index.php\" rel=\"nofollow\">http://www.neander-motors.com/motorbike/en/index.php</a></a></a></p>\n\n\t<p>If I can get enough cash together, it will be mine! Oh yes!! Oh yes!! It will be mine!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 657,
      "author": "Marvin McConoughey",
      "email": "marvin@proaxis.com",
      "date": "2005-11-03 08:19:37",
      "content": "\t<p>Yanmar makes an aluminum block v-twin water cooled diesel engine that has potential as a motorcycle engine.  It weighs about 150 pounds with radiator.  It puts out about 20 HP which is enough for daily transportation. With a turbocharger it should be possible to get 30 HP or more. Displacement is 750 cc.  Although it is a modern utility engine, it does use the less efficienct precombustion chamber design.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 658,
      "author": "Harpreet Shergill",
      "email": "autoassign@yahoo.com",
      "date": "2005-11-05 14:51:14",
      "content": "\t<p>Here in India, especially southern Punjab Milk vendors prefer Diesal Bikes. Enfield Bullet has pioneered into Diesel bullets with Lombardini single cylinder engines ( 3.25 cc ). However the real company to come up with an idea was Suraj motorcycles with a Bullet chassis and greaves engines. The end product was a reliable machine but the company was so small to market the bike and compete effectevely hence vanished. The Bullet Diesal Tauras gives a whopping 65 kms per litre average and boasts of a massive torque required to carry big milk cans. But the real performers are after market improvisations by fitting a Crompton Grreaves 3.5. Engine borrowing it from an Auto rickshaw.</p>\n\n\t<p>Indeed, we need a two cylinder diesal to counter  heavy viberations emmitted by a single cylinder. Also, diesal leakages foul the engine surroundings. We expect the local mechanics to get two cylinder diesals( virtual halves from <span class=\"caps\">TATA </span>Indica Diesel car engine ) from <span class=\"caps\">TATA </span>Ace mini truckwhich is hitting the market in late 2005.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 659,
      "author": "Charles",
      "email": "amm@haan.de",
      "date": "2005-11-28 21:38:07",
      "content": "\t<p>I wanted to try it out and have built my own Enfield Diesel bike, using a Yanmar <span class=\"caps\">L100</span> clone engine (Kama <span class=\"caps\">KM186</span>), which I got new for 360 bucks on ebay. Its a single-cylinder 406cc engine with counterbalance shaft, electric starter, etc.. and puts out about 10hp. I rode the bike 2100 km up to now, and it performs great. Top speed of my bike is 105 km/h (about 64 mp/h) with the engine revving about 3600 rpm. I run the bike on biodiesel (RME).</p>\n\n\t<p>The bike runs very smooth with very low vibration. I have heard that the Lombardini engines (esp. the 435) do vibrate heavily. My engine runs smooth as silk. I also have a gasoline Enfield Bullet 500, and the vibration of the gasoline engine is as low as that of my Yanmar/Kama Diesel.</p>\n\n\t<p>The same engine is also available by Changfa. Later I found out that my engine is not an original Kama, but a Kama-clone. So its a clone of a clone, but built-quality is very well, and it just runs great.</p>\n\n\t<p>You may take a look at my website for some pics:</p>\n\n\t<p><a href=\"http://www.altmann.haan.de/riding_on_salad_oil/\" rel=\"nofollow\"><a href=\"http://www.altmann.haan.de/riding_on_salad_oil/\" rel=\"nofollow\"><a href=\"http://www.altmann.haan.de/riding_on_salad_oil/\" rel=\"nofollow\">http://www.altmann.haan.de/riding_on_salad_oil/</a></a></a></p>\n\n\t<p>Charles <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /></p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 660,
      "author": "Henk Verleg",
      "email": "hverleg@wanadoo.nl",
      "date": "2006-01-31 22:52:00",
      "content": "\t<p>It&#8217;s just by coincident I drop on this site.</p>\n\n\t<p>I to am planning to build a diesel motorbike. based on a Dnepr and a Hatz 3W35 engine.</p>\n\n\t<p>I have changed the gearingwheels so the speed wil be improved.</p>\n\n\t<p>80Km/h at 2200 rpm will do. Topspeed will be at 130-135 km/h.</p>\n\n\t<p>I am waiting at the engine. The engine isn&#8217;t yet on the Dutch market but it will be in e couple off months.</p>\n\n\t<p>Kind regards</p>\n\n\t<p>Henk</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 661,
      "author": "Marvin McConoughey",
      "email": "marvin@proaxis.com",
      "date": "2006-02-06 23:54:52",
      "content": "\t<p>I wrote earlier about the Chinese clone of the Yanmar watercooled 750cc v-twin engine.  Another Chinese company now has a different version of the engine.  This time, it is aircooled rather than watercooled, and has 812 cc instead of 750cc.  The weight is about the same, but the engine might be easier to install in a motorcycle.    The Hatz three cylinder aluminum engine also sounds as if it would be a smooth and powerful choice.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 662,
      "author": "dale baker",
      "email": "dbaker@aagideas.com",
      "date": "2006-03-17 02:07:40",
      "content": "\t<p>i rode a diesel motoguzzi(aka the slugg) for a month in ireland in 1983 125 miles per gallon, only filled it one time 5.6 gallons. battery looked like it would start heavy equipment!</p>\n\n\t<p>slow but steady and always started quickly with lots of noise and lots of vibrations! harmonics! front wheel plused like it was alive while idleing?</p>\n\n\t<p>ps: all sheep have the right of way and the dead one was always the most favorite ,one of the best producer and cost 200.euro&#8217;s by todays standards</p>\n\n\t<p>dr. dale</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 663,
      "author": "Ace",
      "email": "aaacesinthehole@hotmail.com",
      "date": "2006-03-25 21:45:14",
      "content": "\t<p>Hey every one. I,m not a diesel man, <span class=\"caps\">YET</span>. Have had plans and desire to build a diesel motor cycle. Have built many other bikes in the past. Whats been stalling me is trying to find horse power to wieght ratio, air cooled engine. Seems like the water cooled get heavy fast. looking 4 something that is 25 hp or more,&#8212;1200cc or larger.  Something close to -150lbs. Dependability, vibration, fuel consumtion and <span class=\"caps\">RPM</span> are also factors. 3lbs per horse would be great but not likley, probably more like 6 lbs  to the horse power. Would lots of feed back to draw from. aaacesinthehole@hotmail.com</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 664,
      "author": "Ace",
      "email": "aaacesinthehole@hotmail.com",
      "date": "2006-03-25 21:47:39",
      "content": "\t<p>Hey every one. I,m not a diesel man, <span class=\"caps\">YET</span>. Have had plans and desire to build a diesel motor cycle. Have built many other bikes, hot rods etc. in the past. Whats been stalling me is trying to find horse power to wieght ratio, air cooled engine. Seems like the water cooled get heavy fast. looking 4 something that is 25 hp or more,&#8212;1200cc or larger.  Something close to -150lbs. Dependability, vibration, fuel consumtion and <span class=\"caps\">RPM</span> are also factors. 3lbs per horse would be great but not likley, probably more like 6 lbs  to the horse power. Would like lots of feed back to draw from.  Thanks (ACE)aaacesinthehole@hotmail.com</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 665,
      "author": "Rob",
      "email": "muledad72@yahoo.com",
      "date": "2006-03-31 07:16:55",
      "content": "\t<p>There is a new type diesel motorcycle out by the Germans, the company name is</p>\n\n\t<p>neander-motors.com.</p>\n\n\t<p>The new motor design is very empressive itself.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 666,
      "author": "k",
      "email": "kjhbry@yahoo.com",
      "date": "2006-08-23 05:09:20",
      "content": "\t<p>lets get it on bio diesel mototrcycles will defently cut fuel oil prices and may prove real fun even if thay wont win any races but for touring the country I cant think of a better way.  If any one knows of any manufactories who have desines that were not mention in this blog pin me at kjhbry@yahoo.  I am in usa.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 667,
      "author": "Ace",
      "email": "aaacesinthehole@hotmail.com",
      "date": "2006-08-23 09:44:41",
      "content": "\t<p>I have a 3 cyl. isuzu-about 1124cc, It&#8217;s going in a 1970 strectched harley frame, w/a 4 speed, wide glide. This is one cool bad looking chopper w/a turbo. This is my proto type experimental version.  This is being called  the (Road Whore Deezel Motor Physco). If this works as well as I think, the next one will be 1600cc w/a turbo &#038; a 6 speed &#038; totally over the top.Ace</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 668,
      "author": "Ecorider",
      "email": "sales@ecorider.com",
      "date": "2006-10-06 16:41:11",
      "content": "\t<p>You will be interested to know that there is a Diesel bike in production in the UK. The Ecorider is a unique 2 wheeled machine, designed and manufactured in Scotland. The Ecorider is a real breakthrough in off road access and mobility : towing capabilities, a narrow profile, wide tyres, easy operation, safety and a sensible price tag make this a truly remarkable workhorse.</p>\n\n\t<p>It is fuelled by Diesel or Biodiesel, and this sturdy and economical workhorse delivers and incredible 120 miles to the gallon and is unbelievably inexpensive to run. It is classed as a light agricultural vehicle and so can operate on red-diesel which is about half the price of normal white diesel.</p>\n\n\t<p>Its <span class=\"caps\">CO2</span> emissions of just 62g/km, it produces 83% less <span class=\"caps\">CO2</span> than an average quad.</p>\n\n\t<p>Unlike other diesel bikes that have been produced in the past the bike has a lot of torque, it is geared down and so tackles steep terrain superbly and has good acceleration.</p>\n\n\t<p>For more information visit www.ecorider.com or call +44 (0)1667 459988</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 669,
      "author": "Ron",
      "email": "R.Froger@chello.nl",
      "date": "2006-10-08 04:27:02",
      "content": "\t<p>Who has allready build a diesel moped. If not. Who know somebody who is starting with it.</p>\n\n\t<p>Looking for a small diesel engine</p>\n\n\t<p>A very small cvt</p>\n\n\t<p>A small clucth</p>\n\n\t<p>Let me know if you have ideas</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 670,
      "author": "Peter Yronwode",
      "email": "pyronwode@mchsi.com",
      "date": "2007-03-25 10:04:58",
      "content": "\t<p>Please tell me more about the Chinese clone of the Yanmar V-twin Diesel mentioned by Marvin McConoughey on February 6, 2006 .  I have been unable to locate a Yanmar at a reasonable price.  My goal is to fit it in a Moto Guzzi chassis using the Guzzi driveline</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 671,
      "author": "Marvin McConoughey",
      "email": "marvin@proaxis.com",
      "date": "2007-03-25 22:09:09",
      "content": "\t<p>The Punsun  brand Chinese V-twin diesel is aircooled, rather than being watercooled as the Yanmar diesel.  The engines were for sale on Ebay until a few days ago at the fixed price of $1295 US$, plus shipping.  Fuel tank and muffler cost extra.  The Chinese diesel would be the better choice because it will not require a radiator.  Some information is here:  <a href=\"http://cgi.ebay.com/ws.eBayISAPI.dll?ViewItem&#038;item=230103504202\" rel=\"nofollow\"><a href=\"http://cgi.ebay.com/ws.eBayISAPI.dll?ViewItem&#038;item=230103504202\" rel=\"nofollow\"><a href=\"http://cgi.ebay.com/ws.eBayISAPI.dll?ViewItem&#038;item=230103504202\" rel=\"nofollow\">http://cgi.ebay.com/ws.eBayISAPI.dll?ViewItem&#038;item=230103504202</a></a></a></p>\n\n\t<p>An Internet search will find more on the Punsun engine, but I am not sure that it is in mass production or, rather, is simply being offered as prototype.  A British web site alleged that the engines are test bed engines.  I cannot find much information on the Punsun factory, how many engines they produce each year, or who sells it commercially.  The engine seems to be based on the cylinder and cylinder head design of the 406CC Yanmar one cylinder aircooled engine.  The engine probably puts out no more than 18-19 horsepower, despite claims of 20-22 horsepower.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 672,
      "author": "Marvin McConoughey",
      "email": "marvin@proaxis.com",
      "date": "2007-04-13 07:50:08",
      "content": "\t<p>A lower horsepower diesel motorcycle could be constructed using the Russian one cylinder air cooled diesel engine, model number <span class=\"caps\">TMZ 450D</span>/520D.  The two numbers may refer to cylinder displacement variations.  The web site is    It is a modern design, and has various accessories available.  If anyone has experience with the engine, I would appreciate knowing of it.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 673,
      "author": "BJSmith",
      "email": "smithaus@execpc.com",
      "date": "2007-05-09 23:57:43",
      "content": "\t<p>Enjoying this site. Has anyone seen or endeavored to create or modify</p>\n\n\t<p>a <span class=\"caps\">V2 </span>Harley Davidson engine for diesel operation. Easy to be inspired</p>\n\n\t<p>but the devil is engineering the basic engine into a direct injection, high</p>\n\n\t<p>compression, tame valve timing, machine. The cylinders could be sleeved</p>\n\n\t<p>smaller, a diesel piston could be taken from something else to dictate the</p>\n\n\t<p>smaller bore. the heads would need to be redesigned or billet made (or</p>\n\n\t<p>bare castings reworked and new chamber dimensions with center injector).</p>\n\n\t<p>Cam box would need the master pump or Bosch mini-K unit. Etc, etc.</p>\n\n\t<p>Im thinking a 1340 cc could be reduced to about 1 liter to handle the new found</p>\n\n\t<p>torque. Lets make a kit?</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 674,
      "author": "Marvin McConoughey",
      "email": "marvin@proaxis.com",
      "date": "2007-07-20 19:24:14",
      "content": "\t<p>The Australian firm Hydrapneu is now an official distributor of Punsun V2-twin diesel engines.  Website is  The firm claims that 25-30 <span class=\"caps\">HP </span>Punsun diesel engines are forthcoming.  No further details are provided.</p>\n\n\t<p><span class=\"caps\">BJ </span>Smith has a useful proposal on converting the Harley Davidson to diesel operation.  It would require an excellent machine shop, but technically is feasible.  One would need to reduce bore size to a level that would limit peak cylinder pressures to not much greater than the engine now experiences in its gasoline mode.  The proposed liter figure seems reasonable. With a small turbocharger, horsepower might be nearly as much as now, and with better torque.</p>\n\n\t<p>Pakistan, with its reputation for technical versatility and skilled machine shops, seems an excellent place in which to create a diesel motorcycle.  Someday I hope to visit Pakistan.</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 675,
      "author": "l blazek",
      "email": "simoneramone@aol.con",
      "date": "2009-06-27 22:06:22",
      "content": "\t<p>anyone made adapter kits to make a dnepr diesel possible?noticed the comment on makeing a diesel out of a harley engine; would be easier to put a v twin engine like a yamar in a harley frame. the cheap way to go there would be to get a wrecke yamar tractor,take out the part u need and sell the leftovers,becaoiuse the engine costs as much as the tractor!</p>\n\n\n ",
      "parent_id": 0,
      "approved": true
    }
  ]
}