{
  "post_id": 21,
  "comment_count": 32,
  "comments": [
    {
      "id": 228,
      "author": "Taimur Mirza",
      "email": "fabric@super.net.pk",
      "date": "2003-10-18 15:48:15",
      "content": "<p>Wealth of info for prospective Jeep re-builders Imad, you need to find out the weights of all the engines you have mentioned in your article and also give a list of the engine weight and the transmission weight of the original stock petrol engines along with the R&P ratios compared with the proposed ratios for the diesels that one intends to install along with the gear box. The gear boxes also have different output ratios for different tyre sizes. Diesels are much heavier engines and without installation of a restraining bar holding the chasis together result in eventual chasis cracking or bending outwards lengthwise, resulting in severe damage and occassional broken body mounts.</p>\n\n\t<p>Good work keep it up.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 229,
      "author": "Imad",
      "email": "asda@eif.com",
      "date": "2003-10-22 06:56:38",
      "content": "<p>Thank you for the kind words. I am planning to deal with transmission and axle choices, and diesel conversion issues in other articles soon.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 230,
      "author": "Ehsan Kiani",
      "email": "ehsankiani@yahoo.com",
      "date": "2003-10-24 08:32:41",
      "content": "<p>Very impressive.. Nice to read through with lots of information.. Pictures would be an added benifit.. <img src='http://komac.local/wp-includes/images/smilies/icon_smile.gif' alt=':)' class='wp-smiley' /> .. Also.. a 1HZ costs much more then 60000 these days.. <span class=\"caps\">A B2</span> costs more then 60 K nowadays..</p>\n\n\t<p>Keep it up</p>\n\n\t<p>Ehsan</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 231,
      "author": "Imad",
      "email": "ipj@wwpjd.com",
      "date": "2003-10-25 20:12:47",
      "content": "<p><b> … a 1HZ costs much more then 60000 these days.. <span class=\"caps\">A B2</span> costs more then 60 K nowadays..</p>\n\n\t<p>Keep it up</p>\n\n\t<p>Ehsan </b></p>\n\n\t<p>Yes, I meant that it costs upwards of Rs 60,000 to <span class=\"caps\">REBUILD</span> or <span class=\"caps\">OVERHAUL</span> a 1HZ. I agree though, engine prices are ludicrous – these things arrive as scrap packed into a container like sardines and then the kabarias make a fortune off them</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 232,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2003-10-27 17:12:41",
      "content": "<p>My engine has been supposedly rotting in a container for the last 5 months…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 233,
      "author": "Usman",
      "email": "sh_usman_nasir@yahoo.com",
      "date": "2003-11-13 22:14:06",
      "content": "<p>I wanted to make my own off road jeep can u advise me on getting whihc one. We just want to use one that suits our needs in Norther Area roads and not highway</p>\n\n\t<p>Any starters guide lines. Your tips for engines are very good.</p>\n\n\t<p>Usman</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 234,
      "author": "Shan",
      "email": "toughguy_zee@hotmail.com",
      "date": "2003-12-06 00:17:52",
      "content": "<p>I hav a petrol Suzuki <span class=\"caps\">SJ410</span> but its consumption is quite much, i want to convert it into Diesel. I would prefer a diesel Turbo engine. Plz recommend a suitable engine.</p>\n\n\t<p>Thank you,</p>\n\n\t<p>Shan.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 235,
      "author": "imad",
      "email": "owuwh@oihg.com",
      "date": "2003-12-07 20:31:57",
      "content": "<p>There are no diesel engines in the local market that will install in an <span class=\"caps\">SJ410</span> without completely upsetting its weight distribution and ruining handling and ride quality. The smallest Toyota diesel is the 1C and it stills weighs <span class=\"caps\">MUCH</span> more than the SJ’s 1000cc petrol engine. The SJ doesn’t weigh enough to withstand the harsh vibrations of a diesel. The extra weight in the front also worsens the already marginal ride quality of the SJ. You may have noticed that the back end of the SJ is <span class=\"caps\">EXTREMELY</span> light. A diesel engine will make that even worse by adding extra weight in the front. The front leaf springs will also need extra leafs to handle the increased weight. As far as the efficiency of the diesel over the petrol engine is concerned, a 1C will use as much fuel as the 1000cc petrol, probably even more. The govt is also planning on equalizing the cost of petrol and diesel within the next couple of years so you won’t save any money by converting to diesel. Then there is also the cost of the engine and paying a mechanic to install it. Diesels also cost much more to overhaul than petrol engines and you will need to overhaul it at some point.</p>\n\n\t<p>Converting an <span class=\"caps\">SJ410</span> to diesel makes no sense from any point of view, whether engineering or financial. It would be a waste of money and time and you would end up with a vehicle with terrible ride quality and lousy acceleration.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 236,
      "author": "taimoor khan",
      "email": "khan_taimoor@yahoo.com",
      "date": "2003-12-21 16:55:37",
      "content": "<p>Hi there, its really a great site ur maintaining. I wanted to know that can the nissan 2.2 engine can work in cj-5 not for extreme offroading like u people do but basically for the farm house type, as I am about to buy a 1960 Cj-5 having nissan 2.2 .</p>\n\n\t<p>Thank you</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 237,
      "author": "imad",
      "email": "ouhd@pihref.com",
      "date": "2003-12-23 10:09:50",
      "content": "<p>Taimoor, whether a Nissan 2.2 Liter engine in a CJ-5 is suitable for you depends on a number of factors. Toyota’s comparable L, and now the 2L, are superior engines both from a power and reliability point of view. The Nissan 2.2 liter engine is more trouble prone, and parts are expensive and difficult to find. On the other hand you can find Toyota parts anywhere in the most remote corners of the country. However, the if the Jeep in question is in good enough shape to offset the disadvantage of having a Nissan 2.2 liter engine, and the engine is also in good shape, then go for it. It should be more than enough for light duty.</p>\n\n\t<p>To the webmaster – let’s move all question and answer sessions to the forums from here on. The comments sections are getting mighty cluttered while the forums remain bone dry. <span class=\"caps\">THIS</span> is what the forums are really for – to foster the open discussion of Jeep tech and travel.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 238,
      "author": "imad",
      "email": "ouhd@pihref.com",
      "date": "2003-12-23 10:19:25",
      "content": "<p>Note to future comment poster:</p>\n\n\t<p>Please post your questions in the forums. These are accessible through the link on the homepage. Thanks</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 239,
      "author": "Jason Heywood",
      "email": "ecolog@citytel.net",
      "date": "2004-03-10 10:49:09",
      "content": "<p>I am in British Columbia</p>\n\n\t<p>Are there many mid 80’s diesel toyota landcruisers there?</p>\n\n\t<p>What do they cost used in US dollars?</p>\n\n\t<p>Thanx</p>\n\n\t<p>Jason</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 240,
      "author": "Asim Khan",
      "email": "niazi_asim@hotmail.com",
      "date": "2004-03-27 22:55:59",
      "content": "<p>Jason, i’ve been out of touch for a long time but still remember the rates somewhat. I nicely tuned jeep might cost u between $3000 to $7000. It all depends on the condition of the engine, suspension and the overall look whereas the mileage is not that important there!</p>\n\n\t<p>Anyone wants to correct me on somepoint, please do.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 241,
      "author": "michael weinerth",
      "email": "michael_d_bigbird@yahoo.com",
      "date": "2004-04-06 14:49:46",
      "content": "<p>hello,im from the philippines I have an assemnled wrangler its engine is a Toyota 2L disiel engine, I want to know about its durability, can u give me some info and can you give me some info if it is supirior over other engines in its class?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 242,
      "author": "Dave",
      "email": "MecWelder@aol.com",
      "date": "2004-04-24 04:17:32",
      "content": "<p>I need info—trying to install 2LT in 87 toyota 4X4 pickup has 22RTE now. I have a 2LT engine lined up but need flywheel and bellhousing-transmission to make it work. Do you know where I can get needed items or have toyota part numbers? Thanks for any help you can give.</p>\n\n\t<p>Dave at MecWelder@aol.com</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 243,
      "author": "Rudy Santos",
      "email": "rodsan@speedsurf.pacific.net.ph",
      "date": "2004-05-22 18:48:23",
      "content": "<p>Good day Dear Chris.</p>\n\n\t<p>I am from Philippines, I got this Land Cruiser with only 2L Engine 2.4liter.</p>\n\n\t<p>Problem is the Fuel injection pump is not calibrated I think, black smoke and not much power, and “Engine Check led” indicator would always light up when engine warmed up, and engine lost almost 50% power and have noise of like fuel knock.. maybe because of the conversion from right hand drive to left hand drive.. (Japan to Philippine Standard)</p>\n\n\t<p>attached is the photo.</p>\n\n\t<p>I got the this Land Cruiser from an auction here, it came from Japan, manufactured in 1992.</p>\n\n\t<p>I believe the <span class=\"caps\">EFI</span> need computer software and to diagnose and calibrate the said fuel injection pump.. which we do not have it here.. I tried to resorting to changing the pump with the conventional type (NOT <span class=\"caps\">EFI</span>) , which we could not figure out how to make the engine build power.. finally I gave up.</p>\n\n\t<p>I want to replace the whole Engine with the following:</p>\n\n\t<p>3L, which heard many good things from your forum.. but cracking shaft is not very good news though… <img src='http://komac.local/wp-includes/images/smilies/icon_surprised.gif' alt=':o' class='wp-smiley' /> )</p>\n\n\t<p>(Does it have same engine mounting system?? also use the same transmission is ok?</p>\n\n\t<p>does 3L engine also equiped with <span class=\"caps\">EFI</span>?? which I have phobia meddling with.</p>\n\n\t<p>I want to ask if my land cruiser can be fitted with 3B Engine?? I think Toyota 3B are not <span class=\"caps\">EFI</span>.</p>\n\n\t<p>or 1KZ, which I think is with <span class=\"caps\">EFI</span>.. what do you think?  which is better?</p>\n\n\t<p>Regards.</p>\n\n\t<p>Yours truly,</p>\n\n\t<p>Rudy Santos</p>\n\n\t<p><span class=\"caps\">RODSAN </span>Enterprises</p>\n\n\t<p>1750-A Yacal Street, Sta. Cruz, Manila,</p>\n\n\t<p>1003 Philippines</p>\n\n\t<p>Mobile Phone #0063-919-6286591</p>\n\n\t<p>Telephone# 00632-2519051</p>\n\n\t<p>Tel/Fax# 00632-2511075</p>\n\n\t<p><a href=\"http://motorcyclephilippines.com/rodsan.html\" rel=\"nofollow\">http://motorcyclephilippines.com/rodsan.html</a></p>\n\n\t<p>mailto:rodsan@pworld.net.ph</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 244,
      "author": "aishwarya",
      "email": "aishy2k2@rediffmail.com",
      "date": "2004-05-24 23:05:08",
      "content": "<p>dear sir,</p>\n\n\t<p>i have an original ford gpw jeep in india, iand i have used toyota 1c engine. i just want to know is that good for jeep? and what will be the fuel consumption in the city?</p>\n\n\t<p>thanking you,</p>\n\n\t<p>aishy.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 245,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2004-05-29 14:35:48",
      "content": "<p>Yes, many people here have put in a 1C or 2C in the orignal Ford/Willys jeeps. These engines are very reliable, and fuel consumption is decent.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 246,
      "author": "Admin",
      "email": "LT1_madness@offroadpakistan.com",
      "date": "2004-06-06 23:07:03",
      "content": "<p><b> PLEASE <span class=\"caps\">REGISTER IN THE FORUMS AND POST ALL YOUR QUESTIONS THERE</span><img src=\"!\" alt=\"\" border=\"0\" /> THE <span class=\"caps\">COMMENTS SECTION IS FOR COMMENTS REGARDING THE ARTICLE ONLY</span><img src=\"!\" alt=\"\" border=\"0\" /></b></p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 247,
      "author": "Hameed",
      "email": "hsumbal@hotmail.com",
      "date": "2004-07-14 23:13:40",
      "content": "<p>Imad gr8 Show man. I really like the way U have explained all the engines. I plan to rebuild a landcrusier <span class=\"caps\">FJ 40</span> or <span class=\"caps\">BJ 40 </span>With a 2-H six cylinder Deisel. Tell me will it work? or would it be too heavy, and if I am not wrong the 3C the predisesser of 1C & 2C is also in the market.</p>\n\n\t<p>It also comes with  a tubcharger and dispalcment of 2.2 litre. the block is the same as 1 & 2C.</p>\n\n\t<p>For willys <span class=\"caps\">M38</span> flat fenders and <span class=\"caps\">MK IV</span> it a gr8 engine.</p>\n\n\t<p>Any how I really enjoyed the website & I hope that I make my mind up and come to Karachi (fr Lahore) to get my dream com true.</p>\n\n\t<p>Hameed</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 248,
      "author": "Afshar",
      "email": "afshar786@yahoo.com",
      "date": "2004-07-20 02:53:05",
      "content": "<p>I have a <span class=\"caps\">CJ5</span> jeep in blue.. i wannna know which gear box will go best with the 2.4l toyota engine.and which diffrencials would u reccomend for it,,to give it speed and power in 4×4 mode…</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 249,
      "author": "Tonito",
      "email": "tonigr@gmx.net",
      "date": "2004-08-27 04:10:37",
      "content": "<p>Great site, great article<img src=\"!\" alt=\"\" border=\"0\" /></p>\n\n\t<p>Im driving a Toyota <span class=\"caps\">BJ70</span> with the 3B-engine and its a fantastic engine!</p>\n\n\t<p>Youre article about the diesel-engines shows me how many engines are build by Toyota(or Hino/Daihatsu). I never noticed that there are so many.</p>\n\n\t<p>best wishes from germany,</p>\n\n\t<p>Tonito</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 250,
      "author": "Khurram Baig",
      "email": "xtrariter@yahoo.com",
      "date": "2004-09-08 18:50:35",
      "content": "<p>I personally lover the B series. I run a 2B overbored in my CJ-7 and while I don’t save much on diesel the acceleration and raw power are worth it. Thanks for a wonderful and very informative piece.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 251,
      "author": "max jost",
      "email": "max@der-reporter.de",
      "date": "2004-09-26 17:59:03",
      "content": "<p>hi everybody,</p>\n\n\t<p>i plan to convert my M – 38 to diesel ( now i have the buick 225 engine – boozzer). the toyota 2l-te conversion sounds really great but has anyone of you a detailled plan on what parts will be needed and what to pay attention to? can i keep the original gearbox?</p>\n\n\t<p>thank you for your help</p>\n\n\t<p>max</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 252,
      "author": "Erwin Palma",
      "email": "erwin.palma@gmail.com",
      "date": "2004-11-16 07:07:10",
      "content": "<p>I have a 2L-T engine and I was just want to know if I can put air filter in the turbo air intake system that is designed for gasoline cars?</p>\n\n\t<p>For example: filters that was placed in honda cars, the mushroom type filter insted of the conventional filter.</p>\n\n\t<p>Thank you.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 253,
      "author": "Imad",
      "email": "jdc@iopfh.com",
      "date": "2004-11-16 17:39:29",
      "content": "<p>Erwin,</p>\n\n\t<p>You can use any type of air filter as long as it filters properly and doesn’t choke the engine. Turbos don’t like any dirt at all.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 254,
      "author": "Darshan",
      "email": "dsbr19@rediffmail.com",
      "date": "2004-11-26 17:30:40",
      "content": "<p>Hai sir, i want a knowlege from u that i want to place a engine in jeep(peugeot 550 xdp) .please tell me which engine will be fit for it for economy and power. it is alredy fitted with peugeot engine 2400 cc but it doesnt give fuel average only10 kms per litre i am intrested  in taking 15 to 18 kms average with per litre of diesel. thanks</p>\n\n\t<p>Darshan  punjab /india</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 255,
      "author": "Yaseen",
      "email": "yaseen@offroadpakistan.com",
      "date": "2004-11-30 14:51:03",
      "content": "<p>Hello Darshan,</p>\n\n\t<p>I would like some information from you about this engine that you are currently using. What horse power and torque does this engine produce and at what rpm?</p>\n\n\t<p>Now for some knowledge from us. In Pakistan, as you might have noticed, Toyota disel engines are very popular substitutes. Reason being that Toyota engines are very reliable and their parts are widely available. As for efficiency, not matter what toyota diesel engine we have put in our jeeps we get 8 km per litre in city driving and about 12-14 km per litre in highway driving. The design of Jeeps like ours is a major player in determining fuel efficiency, not to mention the driveline ratios, tyre size and driving habits.  Only efi diesels are known to give 15-18 kms/litre while delivering reasonable power.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 256,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2004-11-30 17:34:45",
      "content": "<p>Yaseen, my efi diesel engine only gives about 8-10 km per litre in both the city and the highway.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 257,
      "author": "Imad",
      "email": "jdc@iopfh.com",
      "date": "2004-12-04 20:57:47",
      "content": "<p>Super efficient TDi hatchbacks and small sedans are the only cars I know of that will deliver 15-18 km/L, that too with a puny (but surprisingly powerful) 1.8-2.0L turbo <span class=\"caps\">EFI</span> diesel. Expecting a jeep to get that kind of mileage borders on the unreasonable. The aerodynamics are next to not being there and gear ratios are low and ill suited for good mileage (very high ratios can hurt mileage just as much too). 8-10 km/L is all you should expect, whether in the city or on the highway. Anymore and consider it bonus mileage. Our CJ-7 managed to squeeze out 14 km/L on a highway journey with a tailwind after getting new injectors. The tailwind added a good 2km/L (maybe more) to the mileage as it takes a lot of power to push that wall of a windscreen through the air at 100kmh. Cruising at excessively high speeds and hard acceleration kills mileage too. About 85-100kmh is good for a jeep with 4.11 axle gears in 5th gear, <span class=\"caps\">PROVIDED</span> your suspension and steering allow that kind of speed. The criteria for a new engine should be adequate power, smoothness, and noise. Fuel mileage doesn’t really figure into the jeeper’s grand scheme of things.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 258,
      "author": "michael weinerth",
      "email": "michael_d_bigbird@yahoo.com",
      "date": "2004-12-05 15:51:33",
      "content": "<p>is a 2L-T a with <span class=\"caps\">EFI</span> a resonable reliable engine?who is the fuel consupmtion on this type of engine?is it resonablly powerful?</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    },
    {
      "id": 259,
      "author": "KO",
      "email": "khalido@go4b.net",
      "date": "2004-12-06 18:07:03",
      "content": "<p>2LT-EFI: The fuel consumption varies from 7-10 km/litre. Since I have low gearing in my jeep, on the highway the consumption actually gets worse. It’s reliable – hasn’t even sputtered once. The efi system has a much longer service life than the manual system it replaces.</p>\n\n\n",
      "parent_id": 0,
      "approved": true
    }
  ]
}